[
  {
    "url": "https://therealdeal.com/national/atlanta/2025/03/18/jp-morgan-affiliate-buys-massive-atlanta-rental-portfolio/",
    "title": "JP Morgan lands $176M to buy single-family rental portfolio",
    "subhead": "Brookfield loan on trend with institutional investment in Sun Belt built-to-rent market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:32 PM",
    "pub_date_dt": "2025-03-18T17:32:00",
    "content": "A JPMorgan Asset Management-backed investment group has acquired a massive portfolio of single-family rentals across metro Atlanta, the Atlanta Business Chronicle reported.\nThe 709-home deal comes with a $176 million credit facility from New York-based Brookfield Asset Management to support the acquisition. That’s $248,000 per home.\nThe portfolio includes seven rental communities located in six growing Atlanta suburbs: McDonough, Loganville, Cartersville, Dallas, Hoschton and Jefferson.\nThe homes feature a mix of three-, four- and five-bedroom layouts, catering to renters seeking more space amid rising homeownership costs.\nWalker &amp; Dunlop’s New York capital markets team secured the loan and cited Atlanta’s strong job market and population growth as factors driving demand for suburban rental housing.\n\nIt aligns with a broader strategy among institutional investors to expand their presence in the built-to-rent sector, especially\nacross the relatively low-density Sun Belt\n. With\nhome prices continuing to rise\n, companies are increasing their stakes in single-family rentals to meet the demand from would-be buyers priced out of the market.\nThe deal follows\nanother JPMorgan-backed venture\n, with Georgia Capital and homebuilder Paran Homes, which is developing built-to-rent communities across the Southeast. At least one of those projects is already underway in the Atlanta suburbs.\nMetro Atlanta has emerged as a key market for institutional landlords, who see long-term potential in the region’s growing population and affordability compared to other Sun Belt cities.\nInvestors are betting demand for professionally managed rental communities will continue to rise as millennials and young families are priced out of homeownership.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/texas/austin/2025/02/06/dallas-fort-worth-is-second-best-market-for-built-to-rent/",
      "https://therealdeal.com/national/2025/02/28/pending-home-sales-crater-to-all-time-low-again/",
      "https://therealdeal.com/national/atlanta/2025/02/19/jpmorgan-georgia-capital-target-built-to-rent-development/",
      "https://therealdeal.com/national/atlanta/2025/02/19/jpmorgan-georgia-capital-target-built-to-rent-development/",
      "https://therealdeal.com/texas/austin/2025/02/06/dallas-fort-worth-is-second-best-market-for-built-to-rent/",
      "https://therealdeal.com/national/atlanta/2025/02/03/dream-finders-homes-enters-atlanta-market-with-acquisition/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 21:32:39 +0000",
    "published_dt": "2025-03-18T21:32:39+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/haley-hospitality-buys-hotel-in-laguna-hills-for-17m/",
    "title": "Haley Hospitality buys 121-room hotel in Laguna Hills for $17M",
    "subhead": "Deal comes after investor’s OC hotel deal with 107% return",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "Haley Hospitality Enterprises has snapped up a 121-room hotel in Laguna Hills for nearly $17 million after selling a hotel in Costa Mesa at a hefty profit for a hotel-to-residential conversion.\nThe Lake Forest-based hospitality firm led by Bhavesh Ahir bought the three-story Laguna Hills Lodge at 23932 Paseo De Valencia,\nthe Orange County Business Journal\nreported, citing CoStar. The seller was locally based LHMLP.\nThe deal works out to nearly $140,500 per room. Brokers Oliver Shah and Justin Myers of Atlas Hospitality Group represented the buyers. It’s not clear what LHMLP paid for the property, and when.\nThe 87,500-square-foot economy class hotel, built in 1968, is near Interstate 5 at El Toro Road. Its rooms were recently offered for discount rates for refugees of January’s fires in Pacific Palisades and Altadena.\nHotel sales in central and south OC have cooled, according to CoStar. Sales between Newport Beach and Dana Point were $125 million during the last “volume year,” compared to a three-year average of $340 million a year.\nThe market didn’t prevent Haley from doing well in its sale late last year of a 120-room Travelodge by Wyndham Orange County Airport/ Costa Mesa at 1400 Bristol Street\nIn December, the county agreed to buy the Travelodge from Haley for conversion into homeless housing under the state’s\nProject Homekey program\n. The hotel purchase and conversion into 78 supported apartments was to cost\n$45 million\n.\n\nThe $45 million redevelopment project, dubbed Homekey Bristol, included a $4 million contribution from Costa Mesa and $3 million from neighboring Newport Beach. Orange County kicked in $7 million and nearly 50 project-based vouchers. The grants totalled\n$14 million\n.\nThe bulk of the money came from a Project Homekey grant from the state Department of Housing and Community Development, which kicked in\n$29 million\nfor the project led by American Family Housing. The Midway City-based nonprofit developer was to revamp the motel and run it as supportive housing.\nSuch grants generally cover the purchase of the property. In the case of the Travelodge, that means Haley likely sold the 120-room hotel for $29 million, or $241,667 per room.\nHaley Hospitality bought the Travelodge, built in 1970, in 2021 for\n$14 million\n, or $116,667 per room, according to the Central OC Times. The purchase came at the height of the pandemic, when the\nhotel industry tanked\nwhile\ntens of thousands of rooms\nwent dark.\nThree years later, the county, via a grant from the state, bought the 54-year-old motor inn for a 107 percent markup for its last traded price. And Haley walked away with a windfall.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/real-estate/orange-county-companies-exchange-laguna-hills-lodge/",
      "https://therealdeal.com/la/2022/08/29/project-homekey-to-pump-452m-into-la-market/",
      "https://www.ocregister.com/2024/08/22/costa-mesa-motel-will-be-converted-into-supportive-housing-with-29-million-state-grant/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://centraloctimes.com/stories/619309404-haley-hospitality-enterprises-llc-purchases-1400-bristol-st-costa-mesa-for-14m",
      "https://therealdeal.com/magazine/national-february-2021/check-out-anytime-you-like/",
      "https://therealdeal.com/new-york/2022/10/25/lights-out-why-more-than-10000-hotel-rooms-remain-closed/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/12/19/oc-to-buy-travelodge-motel-in-costa-mesa-for-project-homekey/",
      "https://therealdeal.com/la/2024/08/26/american-family-housing-to-convert-costa-mesa-motel-to-homes/",
      "https://therealdeal.com/la/2024/02/02/shangri-la-industries-loses-homekey-sites-to-receiverships/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/bullet-train-battle-could-impede-dallas-convention-center-project/",
    "title": "DFW bullet train threatens to derail convention center",
    "subhead": "Design plans still up in the air months after groundbreaking ceremony",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-18T17:30:00",
    "content": "A proposed high-speed rail line connecting Dallas and Fort Worth is throwing a wrench in plans\nfor Dallas’ new convention center.\nNearly a year after the city\ncelebrated the groundbreaking\nof the $3.7 billion expansion of the Kay Bailey Hutchison Convention Center, Hunt Realty proposed shifting the project toward Reunion Tower, the site of a\n$5 billion redevelopment project\nby Hunt, the Dallas Morning News\nreported\n.\nAt issue is the $6 billion high-speed rail line, which is being spearheaded by the North Central Texas Council of Governments.\nHunt has been trying to kill the project for years, arguing it would impede the Reunion redevelopment, which is set to include thousands of multifamily units, a hotel, office and retail, since the track will be seven stories high. Economic analyst the Perryman Group conducted a study that validated Hunt’s fears and found the train could lead to the closing of the Hyatt and billions in losses for the city.\n\nProponents of the rail line claim moving the convention center would delay the opening of the facility and stymie the development of the train, which the North Central Texas Council of Governments has spent years planning.\nHunt president Colin Fitzgibbons said in a statement that he heard the city was still exploring location options for the convention center. Although a groundbreaking ceremony was held last year, the convention center design hasn’t been finalized; plans for the facility have shifted multiple times.\nConcerns about the train project compelled Dallas City Council to back an alternative route for the train last summer; officials said they’d revisit the issue after reviewing the economic impact of various high-speed routes.\nHunt is also the developer behind NorthEnd, a $5 billion mixed-use development that will include a\n$500 million campus\nfor Goldman Sachs.\n–Jess Hardin\n",
    "related_links": [
      "https://www.dallasnews.com/news/2024/06/26/dallas-37b-convention-center-expansion-underway/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/",
      "https://www.dallasnews.com/business/real-estate/2025/03/17/could-dallas-convention-center-move-near-reunion-tower-hunt-realty-presents-plan-to-city/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/texas/dallas/2023/12/15/hunt-pouring-5b-into-redevelopment-of-reunion-tower-area/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-18T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/tourmaline-capital-buys-coral-gables-columbus-center/",
    "title": "Tourmaline pays $76M for Coral Gables office complex facing foreclosure",
    "subhead": "Lender Värde Partners had alleged the previous owner, Affinius Capital, defaulted on a $69M debt",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 18, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-18T17:00:00",
    "content": "A year into Coral Gables’ Columbus Center’s debt woes, Tourmaline Capital Partners paid $76 million for the property facing foreclosure.\nBryn Mawr, Pennsylvania-based Tourmaline bought the office complex consisting of a 14-story building and an eight-story building on a 2.5-acre site at 1 Alhambra Plaza, according to records and real estate database Vizzda. The buyer borrowed $71.6 million for the purchase from Banesco USA.\nThe 262,000-square-foot complex was sold by receiver Chris Neilson, who was appointed by the court to oversee Columbus Center and its financials in the foreclosure suit pending against its previous owner, San Antonio, Texas-based Affinius Capital.\nAffinius started facing issues with its Columbus Center debt in March of last year. At the time, Affinius’ $71.6 million loan on the property\nentered special servicing\ndue to its failure to renew an interest rate cap for its floating-rate loan, according to Morningstar Credit. That constituted a default under the financing agreement between Affinius and lender Värde Partners.\nAn interest rate cap is a hedge against rate increases.\nIn October, Minneapolis-based Värde filed the foreclosure suit against Affinius, alleging it defaulted on a\n$68.9 million\nloan. The total amount owed was $77.4 million, including interest and late fees, according to the complaint.\n\nThe $76 million sale to Tourmaline doesn’t satisfy the total debt owed, but “represents a reasonable and fair market value,” according to a motion to approve the sale filed by the receiver and Värde in January in the foreclosure case. Tourmaline bought the property free from liens or other financial obligations.\nAffinius’ attorney in the foreclosure case, Jamie Zysk Isani, didn’t immediately return a request for comment.\nAffinius, led by Len O’Donnell, paid $10.7 million for Columbus Center in 1989, financing the purchase with a $10.6 million loan, according to records. The loan was amended several times in the following decades and assigned to Värde in 2020.\nTourmaline, led by\nBrandon Huffman\n, also has an ownership stake in the 34-story\nCitigroup Center\nat 201 South Biscayne Boulevard in downtown Miami. In 2023, Tourmaline and New York-based Monarch Alternative Capital paid\n$250 million\nfor the 28-story office tower at 801 Brickell Avenue in Miami’s Brickell. It marked the\nbiggest\nSouth Florida office deal that year.\nSouth Florida’s office landlords have felt the\nsting\nfrom higher interest rates, skyrocketing property insurance and skittish lenders. While the tri-county region became a magnet for out-of-state companies from late 2020 through 2022, demand slowed in recent years. In some cases, even well-leased buildings have struggled due to higher interest rates.\nIn downtown Fort Lauderdale, lender Trimont filed a foreclosure suit in August against Alliance HP for allegedly defaulting on a\n$59.2 million\nloan for the 28-story One Financial Plaza at 100 Southeast Third Avenue. The case is pending, with Neilson serving as the court-appointed receiver for that property as well.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/06/21/affinius-capitals-columbus-center-loan-in-special-servicing/",
      "https://therealdeal.com/miami/2024/10/10/varde-files-foreclosure-against-coral-gables-office-owner/",
      "https://therealdeal.com/miami/2023/12/12/q-a-with-tourmaline-capital-partners-ceo-brandon-huffman/",
      "https://therealdeal.com/miami/2021/05/12/monarch-paying-300m-for-downtown-miami-office-tower/",
      "https://therealdeal.com/miami/2023/09/27/nuveen-selling-801-brickell-to-monarch-tourmaline-capital/",
      "https://therealdeal.com/miami/2023/12/20/inside-south-floridas-top-office-sales-of-2023/",
      "https://therealdeal.com/magazine/national-december-2023/tough-decisions-south-florida-to-feel-sting-as-office-debt-matures/",
      "https://therealdeal.com/miami/2024/08/23/alliance-hp-fort-lauderdale-office-tower-faces-foreclosure/",
      "https://therealdeal.com/magazine/national-june-2023/dont-believe-the-hype-the-true-story-of-south-floridas-office-space/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-18T21:00:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/santana-row-gets-in-on-ai-office-rush/",
    "title": "Santana Row gets in on AI office rush",
    "subhead": "Federal Realty inks leases for Etched, Securiti.ai in upscale San Jose district",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-18T17:00:00",
    "content": "Artificial intelligence firms are moving into San Jose’s upscale Santana Row.\nEtched, based in Cupertino, and Securiti.ai, based in San Jose, leased a combined 60,400 square feet in the One Santa West building at 3155 Olsen Drive,\nthe San Jose Mercury News reported\n.\nTerms of the separate deals with landlord Federal Realty Investment Trust, based in Maryland, developer and principal owner of the mixed-use Santa Row district, were not disclosed.\nEtched, which makes specialty AI semiconductor chips, leased the 49,500-square-foot second floor.\nSecuriti.ai, which provides software services to allow for safer use of artificial intelligence and data, leased 10,900 square feet on the third floor.\nWith these deals, the 375,000-square-foot One Santana West is now 80 percent leased, according to Jan Sweetnam, chief investment officer for Federal Realty.\n“Santana West is ideal for companies seeking a modern and efficient workspace and the deepest set of amenities and services available,” Sweetnam told the Mercury News.\n\nThe AI tech leases occurred after the real estate investment trust pivoted from its original strategy to lease the entire building to a single tenant.\nAfter Federal Realty decided to make chunks of the offices available to separate tenants, One Santana West began to draw firms interested in flexible leasing options.\nA\ncrush of companies that piled into the eight-story building\ninclude PwC U.S. Group, which leased 141,000 square feet; Acrisure, for  29,000 square feet; Couchbase for 23,700 square feet; Calix, for 23,000 square feet; Pivot Interiors, for 15,000 square feet; and  BetterHelp, for 10,400 square feet.\nThe Good Eating Company, a full-service cafe, has struck a deal to operate on the office building’s ground floor.\nThe building’s 20 percent vacancy compares to the\n21.8 percent vacancy\nfor Silicon Valley in the third quarter, according to a\nDecember report\nfrom Joint Venture Silicon Valley and JLL Silicon Valley, according to the San Jose Spotlight.\nSouth Bay office availability — empty offices plus offices being listed for sublease — was 25.9 percent in the fourth quarter ending in December,\naccording to Savills\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/17/san-jose-tech-economy-office-property-build-real-estate-ai-develop/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://sanjosespotlight.com/silicon-valley-san-jose-commercial-real-estate-vacancy-rates-pass-20-percent/",
      "https://siliconvalleyindicators.org/special-reports/commercial-space-q3-2024/",
      "https://www.mercurynews.com/2025/01/07/san-jose-south-bay-tech-nvidia-google-amazon-economy-jobs-office-work/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/06/one-santana-west-in-san-jose-70-leased/",
      "https://therealdeal.com/san-francisco/2024/04/02/pwc-signs-141k-sf-lease-at-santana-row-in-san-jose/",
      "https://therealdeal.com/san-francisco/2024/02/23/silicon-valley-vies-with-sf-as-ai-capital-of-the-world/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-18T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/18/19m-mansion-hits-austin-market-as-luxury-listings-swell/",
    "title": "$19M mansion hits market as luxury listings swell",
    "subhead": "Inventory jumped with 48 offerings over $2 million",
    "authors": "ByJudah Duke",
    "pub_date": "Mar 18, 2025, 4:39 PM",
    "pub_date_dt": "2025-03-18T16:39:00",
    "content": "A $19 million asking price for an estate on the Colorado River topped Austin’s offerings last week as listings over $2 million surged.\nThe property, at 4705 Island Cove, includes an updated modern home on just over an acre with an adjacent 2.1-acre lot at 4709 Island Cove.\nThe main residence features eight living spaces, including a game room, walk-in humidor, pool with swim-up bar and an outdoor kitchen. The property also includes three guest suites, a safe room, three-car garage and a two-slip boat garage. The asking price pencils out to $1,860 per square feet.\nA separate listing includes 4705 Island Cove, 4709 Island Cove and 4400 Island Avenue for $25.5 million, combining 4.85 acres and approximately 450 feet of Lake Austin frontage.\nEric Moreland of Moreland Properties has the listing; the identity of the seller, who owns all three properties, is hidden by a trust.\nForty-eight listings over $2 million were added to Austin’s inventory last week, 12 more than it added\nthe week prior\n, according to the Eklund Gomes luxury report.\n\nContracts on luxury homes dipped, from 12 the week before to six last week, five single-family homes and one $2.24 million condo. Purchases typically slow when the annual 9-day SXSW festival and conference takes over the city, Eklund Gomes’ Michael Reisor said.\nThe top contract was for a 5,800-square-foot home last listed for $5.3 million at 4900 Amarra Drive in Barton Creek. It has five bedrooms and a detached guesthouse. It asked $900 per square foot and was listed by Eric Moreland.\nThe other four single-family homes ranged in listed price from $2.5 to $3.25 million, with three in Tarrytown and one near Bee Cave, in the Bella Montagna neighborhood.\nThe condo deal went down for a penthouse asking about $900 per square foot at 901 West 9th Street, unit 704, at the Nokonah residences. The nearly 2,500-square-foot unit has 2 bedrooms, a balcony and an 800-bottle wine cellar.\nThe Nokonah was developed by Robert Barnstone and Perry Lorenz in 2001. The condo was listed by Moreland Properties’ Diane Humphreys.\n— Judah Duke",
    "related_links": [
      "https://therealdeal.com/texas/austin/2025/03/11/austin-luxury-condo-market-gains-steam/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 20:39:56 +0000",
    "published_dt": "2025-03-18T20:39:56+00:00",
    "author": "Judah Duke"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/shoma-sells-hialeah-project-to-imc-equity/",
    "title": "Shoma sheds another property, sells Hialeah project to IMC for $81M",
    "subhead": "Coral Gables-based firm also recently sold Bird Road dev site to 13th Floor, Related Group and LeFrak",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 18, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-18T16:30:00",
    "content": "For the second time in less than a month, Shoma Group’s commercial portfolio got lighter — along with its overall debt.\nThe Coral Gables-based firm, led by power couple Masoud Shoajee and\nStephanie Shojaee\n, sold a fairly new Hialeah mixed-use project to Yoram Izhak’s North Miami-based IMC Equity Group, records and real estate database Vizzda show.\nAs part of the deal, IMC Equity assumed a\n$65 million\nloan from the U.S. Department of Housing and Urban Development that financed construction of Shoma Village, a complex of two eight-story apartment buildings with 304 units and a seven-story parking garage that Shoma completed in 2022. IMC Equity’s purchase also included two retail outparcels spanning 8,076 square feet built in 2023.\nIMC Equity representatives did not respond to requests for comment. “Shoma Group has sold tens of thousands of units since 1985 and has never kept any assets longer than two or three years,” A Shoma spokespeson said in a statement. “This has always been our business model — develop a project and sell the assets. There has been no change in our strategy.”\nRoughly three weeks ago, Shoma sold a 2.5-acre shuttered car dealership at 3650 Bird Road for\n$35 million\n, abandoning plans to redevelop the site into a two-tower mixed-use project with 748 apartments and 20,000 square feet of retail.\n\nShoma sold the property for $1 million above its\n$34 million\npurchase price in 2022. A joint venture between 13th Floor Investments and Related Group, two Coconut Grove-based firms, and New York-based LeFrak Organization bought the site.\nThe same day the deal closed, Shoma paid off a $38.8 million loan secured by the former dealership, records show.\nShoma and its top two executives have faced some turmoil in recent months. In December, a foreclosure complaint was filed against Masoud and Stephanie Shojaee and two trusts under his name for allegedly failing to repay a\n$10.5 million\nloan secured by the retail component of Shoma Village. The lender voluntarily dismissed the lawsuit two weeks after filing it.\nIn January,\nCity National Bank\nfiled a foreclosure lawsuit against Masoud Shojaee and a Shoma entity alleging default on loans totaling $14.1 million, including a mortgage on a Coral Gables condo where the Shojaees reside. The bank quickly dismissed the complaint and reinstated the loans after reaching a settlement.\nShoma is also facing a pending construction defects lawsuit by the condominium association for\nTen30\n, a boutique three-story condominium with 33 units in Miami Beach that Shoma built in 2022.",
    "related_links": [
      "https://therealdeal.com/miami/2024/11/25/stephanie-shojaee-joins-real-housewives-of-miami/",
      "https://therealdeal.com/miami/2020/07/17/shoma-group-scores-67m-loan-for-mixed-use-hialeah-project/",
      "https://therealdeal.com/miami/2025/03/07/13th-floor-lefrak-related-pay-35m-for-shoma-dev-site/",
      "https://therealdeal.com/miami/2022/05/06/shoma-pays-34m-for-miami-apartment-towers-dev-site/",
      "https://therealdeal.com/miami/2024/12/13/lender-sues-masoud-and-stephanie-shojaee-over-11m-debt/",
      "https://therealdeal.com/miami/2025/02/06/city-national-bank-drops-lawsuit-against-masoud-shojaee/",
      "https://therealdeal.com/miami/2024/12/05/ten30-condo-association-sues-shoma-group-for-alleged-defects/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 20:30:00 +0000",
    "published_dt": "2025-03-18T20:30:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/national-association-of-realtors-roundly-disliked-survey-finds/",
    "title": "NAR missteps alienate pros, public alike",
    "subhead": "Sexual harassment, commission collusion put organization in the doghouse",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-18T16:00:00",
    "content": "The National Association of Realtors is in the doghouse.\nThe Chicago-based organization’s reputation hasn’t recovered from recent setbacks, and it is unpopular with real estate professionals as well as the general public, according to the\nHousing Sentiment Survey\n, conducted by Lance Lambert’s real estate analytics site ResiClub. It ranked NAR near the bottom among 16 real estate-related entities, with 62 percent of real estate agents and brokers holding an unfavorable view of the organization, Crain’s\nreported\n.\nAmong executives in real estate and housing, 66 percent reported a negative perception, while 68 percent of the general public viewed NAR unfavorably.\nSome top Chicago-area agents weren’t surprised.\nNAR is “so far out of touch with reality” that it failed to anticipate the class-action lawsuits challenging its long-standing commission model, prominent Compass agent Mario Greco said.\nThe organization, which most agents must join to access multiple listing services, has been under intense scrutiny following a\nsexual harassment scandal in 2023\nand a federal jury ruling that found NAR and large brokerages\ncolluded to keep commissions artificially high\n, making homeownership costlier.\n\nIn response, NAR abandoned its previous commission standards\nlast August\n, but the lack of a unified standard to replace it has\nleft the industry in flux\n.\nJennifer Ames, head of Engel &amp; Völkers Chicago, offered a more measured view, acknowledging that while NAR’s lobbying has been “important” for homeowners, its reputation has taken a major hit. The group has been instrumental in shaping fair housing efforts and advocating for policies like the mortgage interest income-tax deduction.\nNAR CEO Nykia Wright has been\nworking to repair the trade group’s image\n, introducing conduct standards and focusing on restoring trust.\nThe organization responded to the survey results by stating it is committed to strengthening relationships with brokerages, local associations and industry partners.\nAgents are skeptical despite the efforts. Marina Carney, a Compass agent in Lake Forest, said NAR is “a fine mess” but added that meaningful change will take time.\n— Judah Duke\n",
    "related_links": [
      "https://www.resiclubanalytics.com/p/housing-market-2025-q1-resiclub-housing-sentiment-survey%20",
      "https://www.chicagobusiness.com/residential-real-estate/national-association-realtors-scores-poorly-new-survey",
      "https://therealdeal.com/national/2023/08/26/kenny-parcell-accused-of-sexual-harassment-creating-toxic-culture-at-nar/",
      "https://therealdeal.com/national/2024/03/15/nar-resolves-commission-lawsuits/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/03/15/heres-what-nars-landmark-commissions-settlement-means/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/",
      "https://therealdeal.com/national/2025/01/13/scotus-denies-to-hear-nars-petition-over-doj-probe/",
      "https://therealdeal.com/national/2024/09/10/nars-remaining-legal-battles-doj-pressure/",
      "https://therealdeal.com/national/2024/08/19/nar-taps-nykia-wright-as-permanent-ceo/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-18T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/wilf-familys-west-orange-development-raising-local-worries/",
    "title": "Wilf family’s West Orange development raising local worries",
    "subhead": "Plan to build nearly 500 units far exceeds previous proposal for area",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 3:47 PM",
    "pub_date_dt": "2025-03-18T15:47:00",
    "content": "The Wilf family thinks its revamped development can go event bigger in New Jersey as West Orange looks to contribute its fair share of affordable housing.\nGarden Homes, the development company led by Minnesota Vikings owner Zygi Wilf, proposed building an apartment community of nearly 500 units across four buildings in a forest on top of a mountain in West Orange, Gothamist\nreported\n. A previous 136-home plan for the same land was rejected by the town.\nThe development would include 100 apartments for low- and medium-income residents, which would help West Orange on the path to contributing its fair share of affordable housing, as required under state law.\nLocal opposition is hitched to environmental concerns and the possibility the retraction of the forestland would lead to worse flooding. Environmental experts fear developing the 120-acre land — the largest undeveloped tract in a densely populated part of the state — could also lead to dangers for residents living atop a mountain.\nWest Orange Township Council president Joe Krakoviak doesn’t support the project, but voted in favor of including it in West Orange’s affordable housing plan in 2020, fearing the possibility of a lawsuit and a loss of control over what is ultimately built on the site through builder’s remedy, a court order that allows developers to bypass town control to build affordable housing.\n\nWhen the Wilfs first proposed an initial project in the early 2000s, it was rejected and public safety was the chief reason given. The deputy fire chief testified it would be dangerous and inefficient for both residents and emergency responders.\nAfterwards, local residents banded together to try and preserve the forest as protected open space, but couldn’t come up with the necessary financing.\nWest Orange officials and the Fair Share Housing Center kicked off negotiations over utilizing the land in 2015 to work towards affordable housing goals. At the time, the land was analyzed and there was no objection in including it in the town’s settlement agreement, according to a Fair Share director.\nThe West Orange planning board is set to hold a hearing regarding the project on Wednesday.\n—\nHolden Walter-Warner",
    "related_links": [
      "https://gothamist.com/news/amid-environmental-concerns-billionaire-family-plans-to-build-housing-in-nj-forest",
      "https://therealdeal.com/author/holden-walter-warner/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 19:47:01 +0000",
    "published_dt": "2025-03-18T19:47:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/13th-floor-jsb-nab-68m-davie-rentals-construction-loan/",
    "title": "13th Floor scores $68M construction loan for Davie rentals",
    "subhead": "Complex will consist of 383 apartments, including 77 workforce",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 18, 2025, 3:31 PM",
    "pub_date_dt": "2025-03-18T15:31:00",
    "content": "13th Floor Investments and JSB Capital Group scored a $67.5 million construction loan for a 383-unit apartment complex near Broward College in Davie.\nCoconut Grove-based 13th Floor and Miami Beach-based JSB Capital plan the five-story Parks at Davie with some workforce apartments on the northwest corner of Davie Road and Southwest 37th Street, according to a 13th Floor news release. The developers lease the site from Broward College.\nSantander Bank is the lender for the construction financing. Houston-based Marble Capital made a preferred equity investment for an undisclosed amount.\nPeter Mekras led the Aztec Group team that represented the developers in the loan and equity investment.\nParks at Davie will consist of studios and one- to three-bedroom apartments, with units ranging from 568 square feet to 1,415 square feet. It will include 6,200 square feet of retail and co-working space.\nAbout 77 of the units will be at workforce rents, according to a 13th Floor spokesperson. The targeted area median income will be determined when the project is closer to completion.\nConstruction will start this month, and is expected to be completed in 2027, the release says.\n13th Floor\n, led by Arnaud Karsenti, has completed about 3,900 residential units since its founding in 2008 and has more than 4,800 units in the pipeline, according to the release.\n\nIn July, the firm completed the\n420-unit Savio\napartment complex at 1874 Heron Club Drive in Delray Beach. The Ardid family’s Key International, Wexford Real Estate Investors and CDS International Holdings partnered with 13th Floor on Savio, which marked the first phase of their Parks at Delray development slated for a total of 693 apartments and 54 townhouses.\nIn Hallandale Beach, 13th Floor is developing the five-story, 398-unit\nParks at Hallandale\napartment complex at 2002 Pembroke Road.\nJSB, led by J. Jay Lobell, is a private equity and alternative investment firm that focuses on real estate, according to its website. It has ramped up its South Florida investment in recent years.\nIn December, JSB paid\n$69 million\nfor the 197-unit Stellar at Emerald Hills apartment complex at 5800-5840 Lakeshore Drive in Dania Beach. JSB also bought the Havn Residences &amp; Yacht Club condo complex with 36 units and 54 boat slips at 176 Lake Drive in Palm Beach Shores for\n$58.5 million\nin 2023.\nThe Parks at Davie construction loan comes as South Florida faces a multifamily supply overhang. Developers completed a record\n18,600 apartments last year\n, outpacing 15,000 new leases signed, according to CoStar Group data. That’s led to slower lease-ups, an increase in concessions and a slight decrease in rents. South Florida’s median rent dropped by nearly 2 percent in February, year-over-year, a\nRealtor.com report\nshows.\nDemand is expected to catch up to supply this year and next year due to a slowdown of construction starts.\nSouth Florida multifamily\nconstruction lending\ncontinues to flow. This month, TM Real Estate landed\n$53.5 million\nto build the 250-unit Shalimar at Boynton Beach complex at 3570 West Boynton Beach Boulevard in Boynton Beach. That came on the heels of Savanna scoring a\n$380 million\nconstruction loan for the two 26-story Olara project with 170 apartments and 287 condos at 1919 North Flagler Drive in West Palm Beach.\n",
    "related_links": [
      "https://therealdeal.com/tag/13th-floor/",
      "https://therealdeal.com/miami/2022/11/28/13th-floor-jv-nab-102m-construction-loan-for-delray-project/",
      "https://therealdeal.com/miami/2024/08/14/arnaud-karsentis-13th-floor-nabs-rentals-construction-loan/",
      "https://therealdeal.com/miami/2024/12/12/stellar-sells-dania-beach-rental-complex-to-jsb-capital/",
      "https://therealdeal.com/miami/2023/11/01/jsb-capital-buys-singer-island-condos-and-marina-for-59m/",
      "https://therealdeal.com/miami/2025/01/24/after-record-south-florida-rental-completions-lease-ups-slow/",
      "http://realtor.com",
      "https://therealdeal.com/tag/construction-loans/",
      "https://therealdeal.com/miami/2025/03/13/tm-real-estate-nabs-construction-loan-for-boynton-rentals/",
      "https://therealdeal.com/miami/2025/03/07/savanna-lands-380m-construction-loan-for-olara-in-west-palm/",
      "https://therealdeal.com/miami/2025/01/09/13th-floor-plans-340-rentals-at-boca-raton-tri-rail-stop/",
      "https://therealdeal.com/miami/2025/02/27/white-oak-ares-management-plan-davie-apartment-project/",
      "https://therealdeal.com/miami/2025/02/11/calta-group-nabs-construction-loan-for-hollywood-rentals/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 19:31:17 +0000",
    "published_dt": "2025-03-18T19:31:17+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/moshe-silber-sentenced-after-mortgage-fraud/",
    "title": "Mortgage fraud co-conspirator sentenced to “significant” 30 months",
    "subhead": "Moshe Silber, now banned from industry, once held $1B in real estate",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 18, 2025, 3:15 PM",
    "pub_date_dt": "2025-03-18T15:15:00",
    "content": "A federal judge in New Jersey sentenced Moshe Silber to 30 months in prison for his involvement in a\nbroad mortgage fraud scandal\n.\nSilber\n, 35, had turned himself in three weeks ago for violating the terms of his bond. He faced up to five years after pleading guilty to one count of conspiracy to commit mortgage fraud in 2024.\nThe U.S. district court judge, Robert Kirsch, repeatedly said that Silber had committed a “significant crime” and a “significant sentence was necessary.” Silber, a co-conspirator of Boruch Drillman, had teamed up to buy an Ohio apartment building, the Department of Justice said. The group picked up the building, called the Williamsburg of Cincinnati, for $70 million, using a stolen identity, then flipped it to Drillman for $96 million, receiving a $74 million loan based on the second, inflated price.\nKirsch noted he deemed the fraud significant because of the “layers and labyrinth of chicanery.”\nThe sentence is shorter than another one Kirsch handed out in the scandal:  Aron Puretz, who pleaded guilty last year to one count of wire fraud, got\n60 months\n, though his son, Chaim “Eli” Puretz, only\ngot 24.\n\nSilber showed up to the packed court handcuffed, wearing a green jumpsuit with a white undershirt. Dozens of members of\nhis community\nwere present. Women read prayer books and cried during the course of the two-hour hearing.\nIn a surprise twist,\nMark Nussbaum\n— a lawyer who\nshuttered his firm\nin January and is the subject of several civil lawsuits over missing escrow funds — showed up to court wearing gold-rim glasses, a modern blazer and tight black pants. He sat with Silber’s family and friends.\nAs the judge was reading Silber’s sentencing, Nussbaum’s phone went off, and security asked him to leave. (He returned to the courtroom at the end of the hearing.)\nKirsch observed that Silber had\nlived the American dream\n, with cars and jewelry worth $2.2 million, but still decided to commit fraud. He also noted how Silber had an annual salary of over $3 million from his father and from someone named Mr. Hoffman, yet claimed to be “in the red” financially.\n",
    "related_links": [
      "https://therealdeal.com/magazine/may-2024/too-small-to-fail/",
      "https://therealdeal.com/tag/moshe-silber/",
      "https://therealdeal.com/new-york/tristate/2024/12/17/aron-puretz-sentenced-to-five-years-in-prison-for-fraud/",
      "https://therealdeal.com/new-york/tristate/2025/01/02/eli-puretz-sentenced-to-prison-for-mortgage-scheme/",
      "https://therealdeal.com/magazine/february-2025/lakewood-nj-confronts-a-widening-commercial-mortgage-fraud-scandal/",
      "https://therealdeal.com/new-york/tristate/2025/03/10/mark-nussbaums-escrow-mess-explained/",
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/",
      "https://therealdeal.com/new-york/2025/01/28/moshe-silbers-attorney-accuses-doj-of-lying/",
      "https://therealdeal.com/new-york/2024/12/06/new-york-investor-moshe-silber-banned-from-real-estate/",
      "https://therealdeal.com/new-york/2025/01/28/moshe-silbers-attorney-accuses-doj-of-lying/",
      "https://therealdeal.com/magazine/february-2025/lakewood-nj-confronts-a-widening-commercial-mortgage-fraud-scandal/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 19:15:50 +0000",
    "published_dt": "2025-03-18T19:15:50+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/henry-crown-scores-chicago-lease-expansion-from-fintech-firm/",
    "title": "Henry Crown and Co scores another lease expansion from fintech firm",
    "subhead": "Bucks trend of companies downsizing; office market’s average lease size increased for first time since pandemic",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 3:13 PM",
    "pub_date_dt": "2025-03-18T15:13:00",
    "content": "Henry Crown and Company brushed off the Loop’s bleak office leasing landscape with a tenant’s second expansion.\nFintech company NinjaTrader is adding 15,700 square feet at 222 North LaSalle for a second time, bucking the post-pandemic trend of office downsizing. The expansion brings the firm’s space up to nearly 42,000 square feet, spanning a full floor in the 1 million-square-foot building.\nAvison Young’s Chris O’Leary and Jeff Lindenmeyer represented NinjaTrader; Tishman and Speyer represented the landlord.\nNinjatrader previously occupied 6,400 square feet at 363 West Erie Street in River North before relocating to a 19,500-square-foot space at 222 North LaSalle in 2021. The firm added 6,600 square feet in 2023.\n\nThe city’s average office lease size has increased for the first time since the pandemic, a promising sign of resilience, O’Leary said.\nIt’s likely too soon to tell if the broader office market in Chicago is headed for a noticeable turnaround. The downtown office vacancy rate hit 26.3 percent in the fourth quarter, up from 23.8 percent at the end of 2023 and more than double the 13.8 percent rate recorded at the start of the pandemic, according to CBRE.\nHenry Crown and Co. bought the 27-story building at 222 North LaSalle for $112 million in 2006 with a $100 million loan from the Teachers Insurance and Annuity Association of America.\nThe investment firm dates back to 1959 and is tied to one of Chicago’s wealthiest families. One of its scions, the businessman and philanthropist Jim Crown, died in 2023, and his Gold Coast condo at\n65 Goethe Street\n, was listed the following year for $17.5 million.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/10/31/the-late-jim-crowns-chicago-condo-lists-for-17-5-million/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-developer-sterling-bay-downsizes-office-space/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/03/12/investor-pitches-conversion-for-chicagos-pittsfield-building/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 19:13:59 +0000",
    "published_dt": "2025-03-18T19:13:59+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/bh-photo-buys-333-west-34th-street-from-brookfield/",
    "title": "B&H Photo bought Brookfield’s 34th Street office building",
    "subhead": "Iconic camera retailer picked up 333 West 34th Street at steep discount",
    "authors": "ByRich Bockmann",
    "pub_date": "Mar 18, 2025, 2:52 PM",
    "pub_date_dt": "2025-03-18T14:52:00",
    "content": "The identity of the buyer that snapped up Brookfield’s 34th Street office building has come into focus.\nIconic photography retailer B&amp;H Photo is the mystery buyer that purchased Brookfield’s 333 West 34th Street for a\nhefty discount\n, sources told\nThe Real Deal\n.\nProperty records hit yesterday showing Brookfield sold the 10-story building for $150 million — $105 million less than the company paid for the property in 2018. The buyer’s identity had been hidden behind an LLC, which was signed for by Zalman Gottlieb.\nGottlieb is the financial controller for B&amp;H. Representatives for B&amp;H and Brookfield did not immediately respond to requests for comment.\nThe sale of the 287,000-square-foot office property works out to $523 per square foot.\nIt’s not clear what the new owner has planned for the 287,000-square-foot building, which is located around the corner from B&amp;H’s iconic store at 420 Ninth Avenue. The retailer was previously reported to have\nexecutive offices at 440 Ninth Avenue\n.\n\nThe tenants at 333 West 34th Street include the Metropolitan Transportation Authority, Sam Ash Music and Godiva Chocolatier. The MTA leases at least 100,000 square feet on a lease that isn’t set to expire until 2035, according to\nCompStak\n.\nB&amp;H originally opened in Tribeca in 1973 and moved into its current store in 1997. The property is owned by the Kibel Company, which purchased it in 1994, according to property records.\nKnown as the Smith Barney Building, 333 West 34th Street was developed in 1954. SL Green bought the property in 2007 for $184 million and reportedly invested about $26 million worth into it. SL Green sold it to Nicholas Schorsch’s American Realty Capital New York Recovery REIT in 2013 for $220 million.\nThe owner changed its name to New York REIT and then eventually went into liquidation, selling the property to Brookfield.\nThe West Side of Manhattan on 34th Street saw a surge of investment as the Related Companies’ Hudson Yards and Brookfield’s Manhattan West started to rise.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://therealdeal.com/new-york/2018/08/02/unizo-holdings-looks-to-sell-another-building-out-of-1-3b-portfolio/",
      "https://property.compstak.com/333-West-34th-Street-New-York/p/81",
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://therealdeal.com/new-york/2013/10/21/bh-planning-exit-from-brooklyn-navy-yard/",
      "https://therealdeal.com/new-york/2017/11/09/brookfield-buying-new-york-reits-333-west-34th-for-255m/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 18:52:35 +0000",
    "published_dt": "2025-03-18T18:52:35+00:00",
    "author": "Rich Bockmann"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/chicago-approves-lgbtq-hotel-in-northalsted/",
    "title": "LGBTQ+ hotel with rooftop pool among handful of rooms in pipeline",
    "subhead": "51-key hotel in Northalsted will replace former Yoshi’s Cafe",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-18T14:30:00",
    "content": "A boutique hotel project geared toward LGBTQ+ travelers is moving forward in Lakeview after receiving Chicago City Council approval, clearing the way for construction to begin.\nThe proposed hotel at 3257 North Halsted Street will have six-stories and 51 rooms, Block Club\nreported\n.\nIt would replace the former Yoshi’s Cafe, a neighborhood staple that closed in 2021 after 39 years in business.\nThe project is led by local developer Allan O’Brien, owner of the Men’s Room Chicago at 3343 North Halsted Street, which sells clothing and accessories for the gay community. His partners in the deal are Andrias Campbell and Bob Sievers.\nThe development will feature a restaurant on its ground floor, a rooftop bar with a pool and cabanas and a speakeasy-style lounge in the basement. The lobby, restaurant, speakeasy and rooftop lounge will be open to the public when not reserved for private events.\nThe rainbow-themed building was designed by Chicago-based Jonathan Splitt Architects.\n\nO’Brien’s team secured the approval with strong community support, having worked with Alderman Bennett Lawson and neighborhood groups. No timeline for construction has been announced.\nThe developer’s “good-neighbor agreement” with the city includes 24-hour on-site staff and security, hosting community events with discounted offerings for neighbors and reinstating a three-car standing zone on Aldine Avenue for guest drop-offs and pickups.\nTo ease congestion, the developers are also working with city officials to establish a second standing zone on Halsted Street for ride-share and taxi access.\nChicago’s hotel development pipeline has fallen to the lowest level in recent years as construction lending froze up, with fewer than 1,500 rooms under construction in the fourth quarter, CoStar\nreported\n— Judah Duke\n",
    "related_links": [
      "https://blockclubchicago.org/2025/03/12/lgbtq-hotel-with-rooftop-bar-speakeasy-in-lakeview-gets-city-council-ok/",
      "https://www.costar.com/article/1060761240/chicago-hotel-development-pipeline-slows-more-than-national-average",
      "https://therealdeal.com/chicago/2025/03/06/skokie-developer-em-hit-with-24m-hotel-site-foreclosure/",
      "https://therealdeal.com/chicago/2025/03/04/struggling-sonder-ditching-hotel-in-chicagos-river-north/",
      "https://therealdeal.com/chicago/2024/11/21/chicago-hotel-owners-push-back-on-massive-tax-valuations/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-18T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/18/baking-powder-heirs-list-the-last-piece-of-their-ct-holdings/",
    "title": "Baking powder heirs list private island in last of Darien holdings",
    "subhead": "Private Hay Island hits the market for $35M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-18T14:00:00",
    "content": "The Zieglers are continuing their long and expensive farewell to Darien, Connecticut.\nCynthia Ziegler, a descendant of baking powder magnate William Ziegler, listed the private Hay Island off the Gold Coast for $35 million, the New York Post\nreported\n. The 18-acre island is the last piece of real estate held by the Zieglers in Darien, where they’ve embarked on a long-winded selloff.\nThe listing was first reported by\nMansion Global\n. Cynthia and her husband, Renfrew Brighton, are planning to relocate to the south.\nThe island with views of the Long Island Sound is accessible by a gated causeway. Not simply a plot of land, the island also has an 8,700-square-foot colonial home with six bedrooms, seven bathrooms and six fireplaces, and a two-bedroom guest house constructed 15 years ago.\nThere’s also an infinity-edge pool, a private dock and a spa. It takes only minutes to get to the heart of Darien, an affluent town on Connecticut’s Gold Coast.\n\nSotheby’s International Realty’s Lesle McElwreath has the\nlisting\n. She’s pitching the two-lot listing as a way for a buyer to mold a family compound, like the Zieglers did. They’ve since moved “far and wide,” according to McElwreath.\nIn May 2023, the town of Darien\npaid $85 million\nfor Great Island, a peninsula off of the Gold Coast. The Steinkraus family, descended from Ziegler’s granddaughter, put the property up for sale in 2016 for $175 million. The town floated a museum, youth camps, pickleball and a community pool among options for the land, which it aimed to preserve from extensive development.\nIn late 2023, descendants of the industrialist\nsold Ziegler Farm\nto an anonymous buyer for $57.5 million, more than $1 million per acre. The largely undeveloped 51-acre parcel was listed for $85 million, meaning the sellers took a 32 percent discount from the original ask.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://nypost.com/2025/03/13/real-estate/hay-island-in-connecticut-lists-for-35m/",
      "https://www.mansionglobal.com/articles/gilded-age-industrialists-new-england-private-island-hits-the-market-for-35-million-139b19e7",
      "https://www.lesliemcelwreath.com/greenwich/sales/54e7f850-9b1a-4e5b-9d70-332927261063",
      "https://therealdeal.com/new-york/tristate/2023/05/05/fairfield-county-town-closes-on-85m-island-purchase/",
      "https://therealdeal.com/new-york/tristate/2023/12/28/connecticut-waterfront-parcel-sells-for-57m-32-below-ask/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/tristate/2023/12/28/connecticut-waterfront-parcel-sells-for-57m-32-below-ask/",
      "https://therealdeal.com/miami/2024/03/22/baking-powder-heiress-sells-palm-beach-house-for-16m/",
      "https://therealdeal.com/new-york/tristate/2023/05/05/fairfield-county-town-closes-on-85m-island-purchase/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-18T18:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/18/saks-fifth-avenue-may-be-poised-to-exit-sfs-union-square/",
    "title": "Retail chain reaction casts doubt on Saks flagship at Union Square",
    "subhead": "Department store’s lease expires in 2027",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:59 PM",
    "pub_date_dt": "2025-03-18T13:59:00",
    "content": "The dominoes of department stores and boutique shops falling around San Francisco’s Union Square may include another luxury retail store: Saks Fifth Avenue.\nCanada-based Hudson Bay Company, which owns Saks, appears ready to cut the cord for its appointment-only store at 384 Post Street when its lease expires in 2027,\nthe San Francisco Chronicle reported\n.\nThe move comes after an affiliate of Hudson Bay, Saks Global Enterprises, picked up the Union Square flagship store from Neiman Marcus late last year at 150 Stockton Street during its acquisition of Neiman Marcus and its real estate properties for\n$2.7 billion\n.\nThe transfer of the six-story, 208,900-square-foot building at 150 Stockton assigned a new market value of $160 million, or $766 per square foot, according to public records and an unidentified source.\nThat left Saks, which for decades has leased a 136,000-square-foot building at 384 Post diagonally across the street from Neiman, vulnerable.\nSaks Fifth Avenue faces an expiring lease in January  2027, Charlie McCabe, a locally based real estate investment broker, told the Chronicle. The department store’s ongoing tenure in that building “may be tenuous,” he said.\nSaks pays more than $6 million a year in rent to landlord Lincoln Property, based in Dallas. Last summer, Saks laid off workers as it converted the store to\n“appointment only,”\ncurtailing its retail clout in Union Square.\nKazuko Morgan, a veteran retail broker who specializes in leasing around Union Square, said that she was told Saks doesn’t plan to renew its lease — and hasn’t heard that Saks could move in with Neiman Marcus across the street.\n\n“If Saks does exit the market, it’s not such a terrible thing today, since they have been appointment-only for months,” Morgan told the newspaper. “They’ve already diminished their presence.”\nLincoln Property and Germany-based Cara Investment bought the building in 2021 for $156 million, or $115 per square foot. They now plan to redevelop it as “mixed use,” Morgan said.\nThe loss of Saks could be inscribed into a larger retail tombstone for greater Union Square, once the city’s golden shopping district.\nNordstrom, which for decades anchored the mall at 865 Powell Street, packed up in 2023. Bloomgindale’s, which occupied more than 300,000 square-feet at the nearly empty San Francisco Centre mall,\nwill close this month\n.\nMacy’s, which for decades has occupied its three-building flagship store in Union Square plaza, plans to\nsell the property and close the doors\nof its only San Francisco store.\nOther retailers that have pulled up stakes include Saks Off Fifth, Nordstrom Rack, H&amp;M and Uniqlo, according to the Chronicle. Meanwhile, luxury retailers may be drifting over to historic Jackson Square.\nThis month, Ralph Lauren has returned to San Francisco with a\nnew store at 441 Jackson Street\n, following an\ninflux of luxury retailers\nlike Paul Smith, Isabel Marant and Zimmermann.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/realestate/article/union-square-nieman-marcus-saks-fifth-avenue-20226191.php",
      "https://www.neimanmarcusgroup.com/HBC,-Parent-of-Saks-Fifth-Avenue,-to-Acquire-Neiman-Marcus-Group-for-2-65-Billion-and-Establish-Saks-Global,-a-Technology-Powered-Luxury-Retail-Company",
      "https://www.sfchronicle.com/realestate/article/s-f-union-square-saks-appointment-shopping-19582844.php",
      "https://therealdeal.com/san-francisco/2025/01/23/bloomingdales-to-close-flagship-in-san-francisco-centre-mall/?firstLevel=sanfrancisco&secondLevel=2025&thirdLevel=01&fourthLevel=23&fifthLevel=bloomingdales-to-close-flagship-in-san-francisco-centre-mall",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://www.sfchronicle.com/realestate/article/postscript-business-san-francisco-19986839.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/la/2025/03/03/macys-downtown-los-angeles-closure/",
      "https://therealdeal.com/san-francisco/2025/01/29/sf-retail-agents-read-tea-leaves-on-bloomingdales-exit/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 17:59:22 +0000",
    "published_dt": "2025-03-18T17:59:22+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/real-estate-firms-scrap-dei-after-trump-orders/",
    "title": "Real estate companies ditch DEI",
    "subhead": "More than a dozen firms removed or tempered information about statistics and programs from annual reports",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 18, 2025, 1:59 PM",
    "pub_date_dt": "2025-03-18T13:59:00",
    "content": "Real estate companies are making sure the words “diversity,” “equity” and “inclusion” do not appear next to each other in public filings.\nMore than a dozen publicly traded firms that had dedicated sections about DEI in last year’s annual reports removed that language in Securities Exchange Commission filings this year. Some swapped diversity lingo for words like “culture” or “workforce,” modifying sections to express that the company values diverse viewpoints or inclusivity in the workplace, while others eliminated once-robust sections bragging about their efforts — but didn’t replace them.\nThe changes coincide with a major political aboutface on DEI.\nPresident Donald Trump began targeting DEI initiatives on his first day in office. He issued one executive order\ndirecting\nfederal agencies to eliminate all DEI programs, policies and positions.\nAnother\nrequires institutions receiving federal grants or contracts to certify that they do not “operate any programs promoting DEI that violate any applicable Federal anti-discrimination laws.” The orders also go after the private sector, instructing federal agencies to identify up to nine potential investigations into public companies, large nonprofits and others related to their DEI practices.\nThe Real Deal\nreviewed 20 public commercial and residential real estate companies with DEI language in their reports. Of those, 15 added or ramped up DEI language in their annual reports after the death of George Floyd in 2020 only to remove it by 2025. Of these, at least two had already reduced or amended the sections in 2024 before eliminating them completely. (Corporations across sectors similarly disposed of their DEI policies, several reports revealed.) It is unclear whether any of these efforts are continuing despite the changes to the reports.\nAfter Floyd was killed, several real estate companies publicly\npledged\nto encourage diversity within their ranks and in the C-suites.\nTRD\n’s review included companies that previously disclosed DEI programs.\nIn its 2020 annual report,\nreleased in February 2021\n, BXP, formerly Boston Properties, indicated that it took “concrete steps to formalize and elevate our focus on diversity and equity within our company and in the communities we serve.” The company pointed to the creation of a Diversity &amp; Inclusion Committee that year, describing its mission as “promoting diversity, inclusion, equality and transparency as part of our culture, business activities and decision-making practices.”\nThe report\nreleased in 2024\nincluded graphics detailing the makeup of the company’s workforce as of 2023, showing that 62 percent of its total workforce is white, 10 percent Black, 10 percent Hispanic, 8 percent Asian and 10 percent other.\nThe annual report\nreleased this year\ndoes not include the “Diversity &amp; Inclusion” section that appeared in reports published over the last four years. Neither of those words appear in reference to BXP’s employees. Instead, the report notes that its policy “has been, and will continue to be” hiring without regard to race, sex, gender identity, disability or any other protected status.\n“Our hiring practices do not, and have not, included quotas or numerical targets based on any of these characteristics,” the report states.\n\nVornado Realty Trust similarly added a diversity and inclusion section to its annual report in 2022 and published employee demographic data. Both disappeared from the report filed in 2025. DEI-related sections were eliminated from annual reports filed this year by several commercial brokerages, including JLL, Cushman &amp; Wakefield, CBRE and Newmark.\nMost of the real estate companies whose reports\nTRD\nreviewed did not respond to requests seeking information on why they eliminated diversity-related sections from their fillings. Timing of the removal of the language suggests that the threat of losing federal contracts or grants, or potentially being investigated, may have contributed to the decisions. A representative for Marcus &amp; Millichap indicated that the removal of its DEI section was not related to the Trump administration’s orders but would not explain the reasons for the change.\nVornado, Newmark and Cushman declined to comment. A person familiar with the reasons for the changes to Newmark’s annual report this year suggested the “Employee Diversity, Inclusion and Equal Opportunity” section was deleted as part of a broader slimming down of the “Human Capital Management” portion of the report, though they couldn’t specify what else had been eliminated. Newmark’s website still features a\ndiversity and inclusion policy\n.\nTrump’s order “escalated” a risk that was already there, according to Andrew Turnbull, an attorney with Morrison Foerster who co-chairs a task force dedicated to DEI strategy and defense at the firm. The 2023 U.S. Supreme Court decision\nstriking down affirmative action\npolicies at colleges and universities had opened the door to legal challenges to DEI programs at corporations, and some companies began scaling back their DEI initiatives before the Trump administration’s actions.\nEmpire State Realty Trust added a “Diversity &amp; Inclusion” section in its annual\nreport released in 2021\n, which disappeared from its annual report in 2024. That report still spoke about the importance of its “diverse workforce.”\n“We strive to attract, hire and retain diverse candidates who meet our high standards,” the report released in 2024 states.\nThat language, however, was removed from the report filed in February 2025.\nReal estate companies, of course, are not alone in changing their diversity and inclusion policies after the Trump administration’s actions. The number of S&amp;P 500 companies that used “diversity, equity and inclusion” language in their public filings so far this year has dropped nearly 60 percent from 2024,\naccording to an analysis\nby the New York Times.\nTurnbull said some companies may have gotten out over their skis with DEI programs, referring to fellowships, internships or hiring targets based on race or gender as high-risk. Still, he advised against wholesale elimination of such initiatives.\n“If they just go in and haphazardly strike their DEI stuff, it could send the wrong message to their employees, and stakeholders,” Turnbull said. “It can have reputational risks if you roll back too far.”\n",
    "related_links": [
      "https://www.whitehouse.gov/presidential-actions/2025/01/ending-radical-and-wasteful-government-dei-programs-and-preferencing/",
      "https://www.whitehouse.gov/presidential-actions/2025/01/ending-illegal-discrimination-and-restoring-merit-based-opportunity/",
      "https://therealdeal.com/magazine/national-july-2022/after-george-floyd/",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642321000006/bxp-20201231.htm",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642324000007/bxp-20231231.htm",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001037540/000165642325000009/bxp-20241231.htm",
      "http://nmrk.imgix.net/uploads/images/Newmark-DI-Policy-FINAL.pdf",
      "https://www.supremecourt.gov/opinions/22pdf/20-1199_hgdj.pdf",
      "https://www.sec.gov/ix?doc=/Archives/edgar/data/0001541401/000162828021003417/esrt-20201231.htm",
      "https://www.nytimes.com/interactive/2025/03/13/business/corporate-america-dei-policy-shifts.html",
      "https://therealdeal.com/magazine/national-july-2022/after-george-floyd/",
      "https://therealdeal.com/magazine/new-york-january-2017/real-estate-diversity-problem/",
      "https://therealdeal.com/new-york/2020/07/21/real-estate-is-acknowledging-its-diversity-problem-now-what/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 17:59:08 +0000",
    "published_dt": "2025-03-18T17:59:08+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/18/paramount-ceo-brian-robbins-in-contract-on-bev-hills-home/",
    "title": "Paramount Pictures, Nickelodeon CEO in contract to sell Beverly Hills home",
    "subhead": "Trousdale Estates five-bedroom listed for $20.8M",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 18, 2025, 1:41 PM",
    "pub_date_dt": "2025-03-18T13:41:00",
    "content": "Media and entertainment honcho\nBrian Robbins\nmoved closer to striking a deal on his Beverly Hills contemporary pad in what marked last week’s top Los Angeles County home under contract.\nThat’s according to the Douglas Elliman Eklund Gomes team’s weekly report, tracking homes that went into contract. The team counts properties in the Multiple Listing Service priced at $4 million or more and lists them by asking dollar volume in its report.\nRobbins, who has been president and CEO of Paramount Pictures and Nickelodeon since 2021, placed the home at 1335 Carla Lane on the market in late January with a $20.8 million asking price.\nThe executive bought the Trousdale Estates property in 2020 for $16.8 million through an entity called Stella Properties LLC, state records show. He nabbed a deal on the home, which was originally listed for nearly $24 million, about a year before he bought it.\nThe Beverly Hills Estates’ Rayni Williams and Branden Williams hold the listing and did not respond to a request for comment.\nThe home is 11,000 square feet with five bedrooms and eight bathrooms. Features include a two-story courtyard, glass walls, oak ceilings, infinity pool and Japanese garden.\n\nSouth of Beverly Hills, a beachfront property on The Strand in Manhattan Beach came in second on the Eklund Gomes report.\nThe home at 304 The Strand in\nManhattan Beach\nis listed at just under $14 million, with Strand Hill Properties’ Kevin Pratt and Amy Olivares marketing the property.\nThe seller is a limited liability company tied to a New York address, property and state records show.\nThere’s a three-bedroom, three-and-a-half bath home on the 3,326-square-foot lot. Above the property’s garage is a one-bed, one-bath unit.\nOverall, Los Angeles County saw 23 signed contracts last week, adding up to asking dollar volume of $161.8 million, according to the Eklund Gomes report. The majority of those contracts, 22, were single-family homes as\ncondo activity\nnormalized from the burst of signings within the segment seen for the week ended March 9.\n",
    "related_links": [
      "https://therealdeal.com/la/2019/09/06/this-week-in-celeb-real-estate-ellen-degeneres-flips-for-santa-barbara-and-jonah-hill-settles-down-in-santa-monicaand-more/",
      "https://therealdeal.com/la/2024/07/22/manhattan-beachs-priciest-home-trade-fetches-24-5m/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
      "https://therealdeal.com/la/2025/03/04/la-luxury-residential-contract-activity-slows-to-76m/",
      "https://therealdeal.com/la/2025/02/25/la-inks-120m-in-signed-resi-contracts/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 18 Mar 2025 17:41:01 +0000",
    "published_dt": "2025-03-18T17:41:01+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/trinity-launches-indian-creek-condo-sales-near-faena/",
    "title": "Trinity leading development of JMH’s former condo project near Faena District",
    "subhead": "Developer tapped Serhant to lead sales in Miami Beach; Jason Halpern’s firm to remain involved",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 18, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-18T13:30:00",
    "content": "Bill and Dana Lozito’s Trinity Southern is taking over development of a long-planned luxury condo project in Miami Beach called 29 Indian Creek,\nThe Real Deal\nhas learned.\nDeveloper Jason Halpern’s JMH Development will remain an investor-partner and adviser on the planned 22-unit development at\n2901 and 2911 Indian Creek Drive\n, near the Faena District, Bill Lozito said. It marks the first South Florida development for New York-based Trinity, an owner-builder that has been involved in the ownership, assemblage or construction of more than 1 million square feet in its history, according to a press release.\nJMH launched sales of an 11-unit building on the site about\ntwo years ago\n.\nTrinity bought into the project for an undisclosed amount in September, Lozito said, declining to disclose more details about the deal.\n“We took the hard work that JMH has done and put our own spin on it,” he said.\nThe development, which will overlook the Indian Creek waterway, will now include a 20-unit condo building with one- and two-bedroom units, and two two-story townhouses, the release said. Prices will range from $1.4 million to just over $3 million, and the developers tapped Ryan Serhant’s\neponymous firm\nto lead sales. Serhant’s other South Florida projects include Mercedes-Benz Places and MG Developer’s\nThe George\ntownhouse development in Coral Gables.\nThe 29 Indian Creek condos will range from 820 square feet to 1,750 square feet. The townhouses will include 500-square-foot terraces with summer kitchens and wet bars.\n\nThe project will have “as many [amenities] as the big developments,” including a rooftop pool, gym and fitness area,” Lozito said. Urban Robot is designing the development.\nBuyers will also receive membership to the beach club at the nearby Miami Beach Edition, according to the release.\nThe team could begin demolition work in April and begin construction shortly after that. The project could be completed by the end of 2026. Trinity is bringing its team down and will supplement construction labor with local subcontractors.\nThe developers will self-fund construction at the start and later take out a construction loan, Lozito said. Trinity is looking to work on additional projects in South Florida, he added.\nThe 0.3-acre Indian Creek development site previously traded in 2017 for $7.8 million. Halpern’s JMH was tied up in\nlitigation\nwith former partners who included investor Dhruv Piplani. In 2022, a judge in New York dismissed the lawsuit filed by Piplani’s PSB Indian Creek and affiliated entities, allowing JMH to move forward with the project.\nIt’s a few blocks away from Len Blavatnik’s Faena District, a luxury complex that includes the Faena House condo building and Faena Hotel Miami Beach, both developed with Alan Faena.\nAman Residences\n, developed by Vlad Doronin and backed by Blavatnik, is under construction in the district.\n",
    "related_links": [
      "https://therealdeal.com/miami/2022/04/12/court-ruling-allows-jason-halpern-to-develop-miami-beach-resi-project/",
      "https://profilemiamire.com/miamirealestate/2023/2/1/twenty-nine-indian-creek-launches-sales-of-luxury-residences-in-the-faena-district",
      "https://therealdeal.com/company/serhant/",
      "https://therealdeal.com/miami/2024/09/17/mg-developer-taps-serhant-to-sell-coral-gables-townhomes/",
      "https://therealdeal.com/miami/2017/03/20/jason-halperns-partner-in-miami-beach-deals-sues-him-seeks-10m/",
      "https://therealdeal.com/miami/2023/01/10/vlad-doronin-len-blavatnik-score-242m-construction-loan-for-aman-miami-beach/",
      "https://therealdeal.com/miami/2022/04/12/court-ruling-allows-jason-halpern-to-develop-miami-beach-resi-project/",
      "https://therealdeal.com/miami/2023/01/10/vlad-doronin-len-blavatnik-score-242m-construction-loan-for-aman-miami-beach/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-18T17:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/dallas-gets-meeting-with-saks-to-save-downtown-neiman-marcus/",
    "title": "Dallas gets Saks to negotiating table in effort to save Neiman Marcus",
    "subhead": "City manager to pitch “financially beneficial” deal for downtown flagship",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-18T13:30:00",
    "content": "Dallas officials secured a meeting with Saks Global as they make a final push to keep the Neiman Marcus flagship open downtown, but the retailer insists its decision to close remains unchanged.\nDallas City Manager Kimberly Bizor Tolbert will meet with Saks executives next week following the city’s latest attempt to pitch what it describes as a “financially beneficial” offer, the Dallas Morning News\nreported\n. Where the meeting will take place wasn’t reported.\nThe meeting comes after Tolbert and the Dallas Consortium, a coalition of business and civic leaders,\nsent a letter\nto Saks Executive Chairman Richard Baker and others, urging a discussion before the store shutters on March 31.\nSaks has “always been open to speaking with the city manager of Dallas,” it said in a statement, but reaffirmed that its decision to close the downtown Neiman Marcus location, which it\nmade in February\n, has not changed.\nThe letter to Baker claimed that keeping the store open for a few more months would allow Saks to “capture the opportunity we wish to discuss.”\n\nThe city has not publicly disclosed details of its proposal but previously worked to remove a major barrier to keeping the store open by securing the deed to a disputed portion of the property earlier this month.\nSaks, which acquired Neiman Marcus for $2.7 billion last year, has\npushed back on the city’s efforts\n, arguing that the situation is “far more complicated than what the public is being led to believe.” The company, which is owned by Hudson Bay Company, has also claimed that some of its previous attempts to engage with Dallas officials were rejected.\nThe meeting is the latest development in an ongoing effort to preserve the store, which has been a landmark in downtown Dallas for over a century. The closure threatens to leave a major void in the city’s retail core, as Neiman Marcus also plans to vacate its 82,000-square-foot headquarters at Cityplace Tower.\nWhile Dallas officials hold out hope for a deal, Saks is already moving forward with plans to invest $100 million into its Neiman Marcus location at NorthPark Center, suggesting its focus is shifting away from downtown.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/17/dallas-gets-meeting-with-saks-global-over-downtown-neiman/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-18T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/nasdaq-to-open-second-headquarters-in-dallas-suburb-irving/",
    "title": "Nasdaq joins Y’all Street movement with Dallas expansion",
    "subhead": "Wall Street index to open first regional headquarters in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:05 PM",
    "pub_date_dt": "2025-03-18T13:05:00",
    "content": "The financial migration to “Y’all Street” is accelerating as Nasdaq plans to open its first regional headquarters in Dallas.\nThe stock exchange, long associated with its Times Square presence in New York City, will establish a regional management division at its existing office at 5030 Riverside Drive in Irving later this year to serve Texas and the broader Southeast, The Dallas Morning News\nreported\n.\nThe exchange tapped Rachel Racz, a Texas native and oil-and-gas industry veteran, as senior vice president, head of listings for the Texas, Southern U.S. and Latin America division.\nThe office will house parts of Nasdaq’s technology and financial crime management divisions, which clients use to detect fraud and money laundering, but will not primarily focus on acquiring stock listings.\nNasdaq’s Texas, Southern U.S. and Latin America region serves more than 480 clients across various industries, collectively valued at $1.9 trillion. Within Texas alone, over 200 companies trade on Nasdaq, accounting for $1.3 trillion in market capitalization, the firm said.\nIt’s another sign of Texas’ growing influence in the financial world, and for Dallas, proof that\nY’all Street\nis still filling out.\nThe New York Stock Exchange plans to launch an electronic exchange in Dallas,\nrebranding the Chicago Stock Exchange as NYSE Texas\nand further shifting trading operations to the Southwest.\nMeanwhile, the Texas Stock Exchange, a startup seeking to challenge Wall Street’s longstanding dominance, is awaiting regulatory approval to launch in Dallas next year. The fully electronic exchange has raised $120 million, with backing from BlackRock and Citadel Securities.\n\nNasdaq’s move comes as Dallas developers push a $1 billion transformation of Uptown Dallas into a financial hub that could rival New York’s stronghold.\nThe area has attracted a wave of finance firms in recent years, with its own pool of developers. Hunt Realty hired Ross Perot Jr.’s Hillwood to manage construction of a\n$500 million campus\nfor Goldman Sachs. KDC and Pacific Elm Properties are building a\n30-story tower\nthat will house Bank of America and Granite Properties’ $173 million office tower\nsigned Deloitte for four floors\n, over 100,000 square feet of space.\nGoldman Sachs and Bank of America’s offices are slated to deliver in 2027. Deloitte will enter its offices when Granite Properties’ 23Springs tower opens this year.\nGoldman Sachs recently gave its managers in New York and London an ultimatum to move to either its Dallas hub or to Salt Lake City or face termination.\nThe Lone Star State recently introduced Texas Business Courts to handle corporate matters, part of the state’s play to offer an alternative to Delaware’s Court of Chancery system.\nTexas’ pro-business stance has fueled speculation that more financial firms could shift operations to Dallas, where commercial real estate costs and corporate taxes are significantly lower than in the Northeast.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/economy/2025/03/18/nasdaq-plants-roots-in-dallas-with-new-hq-as-north-texas-draws-attention-from-wall-street/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2023/10/10/goldman-sachs-starts-500m-dallas-campus/",
      "https://therealdeal.com/texas/dallas/2024/04/16/pacific-elm-scores-construction-loan-for-bank-of-america-tower/",
      "https://therealdeal.com/texas/dallas/2024/01/16/deloitte-leases-100k-sf-in-uptown-dallas/",
      "https://therealdeal.com/magazine/october-2024/wall-to-yall/",
      "https://therealdeal.com/chicago/2025/02/14/chicago-stock-exchange-moving-to-texas-yall-street/",
      "https://therealdeal.com/texas/dallas/2024/11/19/oaktree-capital-launches-formida-capital-in-dallas/"
    ],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 17:05:36 +0000",
    "published_dt": "2025-03-18T17:05:36+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/trump-begins-push-to-use-federal-land-for-new-housing/",
    "title": "Trump begins push to use federal land for new housing",
    "subhead": "A taskforce will identify federal land suitable for affordable homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-18T13:00:00",
    "content": "Donald Trump is preparing to leverage federal land to boost the nation’s housing stock.\nThe Trump administration is launching a taskforce to identify government land that is suitable for housing development, the Wall Street Journal\nreported\n. The Interior Department and the Department of Housing and Urban Development will lead the taskforce.\nThe initiative will brush up against challenges well known in the homebuilding industry. Infrastructure and zoning — and NIMBYism — could make building more difficult on the local level. Environmental and logistical concerns could also end up at play, not to mention material costs at risk of surging during the trade war with Canada and other countries.\nThe government could sell land to private developers, though that would be on a case-by-case basis, according to a HUD representative. The administration may also work to transfer or lease suitable parcels to local governments, nonprofits or public housing authorities.\nFreeing up federal land for development — either by leasing or transferring parcels — could yield big results. The Bureau of Land Management, which falls under the Interior, has 512,000 acres in its footprint, which would be enough to yield between three and four million homes, according to the American Enterprise Institute.\n\nMuch of the federal land, however, is located in rural states like Utah and Idaho, which aren’t facing the same level of housing shortages as other parts of the nation. Only 7.3 percent of federal land — 47 million acres — is within metro areas in need of more homes, according to data from the National Association of Realtors.\nThe idea has been touted by both parties.\nDuring last year’s vice presidential debate\n, both J.D. Vance and Tim Walz supported building housing on federal land. Walz, however, cited concern for preserving national parks and noted the limited availability of federal land in hot housing markets.\nThe federal government owns 650 million acres, more than a quarter of all land in the country, making it the biggest landlord in the United States.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.wsj.com/economy/housing/trump-wants-to-build-homes-on-federal-land-heres-what-that-would-look-like-6b8fb82e",
      "https://therealdeal.com/new-york/2024/10/03/jd-vance-tim-walz-talk-building-housing-on-federal-land/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/10/03/jd-vance-tim-walz-talk-building-housing-on-federal-land/",
      "https://therealdeal.com/new-york/2024/09/20/the-daily-dirt-the-next-big-housing-developer-isthe-federal-government/",
      "https://therealdeal.com/new-york/2024/08/22/adams-has-agencies-study-city-owned-property-for-housing/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-18T17:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/real-estate-columnist-responds-to-liberal-label/",
    "title": "Engquist’s truth revealed: Closet liberal or industry stooge?",
    "subhead": "To be credible on real estate policies, choose facts over ideology",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 18, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-18T12:30:00",
    "content": "An odd thing happened Sunday after I tweeted about Lee Zeldin’s\nabout-face\non climate change: I was attacked on X by an owner of rent-stabilized housing.\nUsually, we are on the same side. But this landlord’s message accused me of being a left-wing “activist.”\nAgitated, I\nfired back\n:\n“Find one reporter on the planet who has written more about the failure of rent control. Let me know when you do.”\nThis isn’t the only social media commentator to accuse me of bias. X users on the left have accused me of being an enemy of working people and a mouthpiece for the real estate industry.\nWhy? Because I advocate for privately-developed multifamily projects and don’t believe social housing can solve the affordability crisis. Moreover, these critics note that I am employed by a real estate publication.\nI can see why people are confused. They want to assign everyone a label — liberal, conservative, Democrat, Republican, progressive, socialist, even libertarian. This way, instead of considering the contents of what someone says, they can just dismiss it based on a presumed tribal affiliation or financial motive.\nLet me be clear: I don’t take positions on issues for the sake of a political party, ideology, employer or bank account. (No one goes into journalism to make money.)\nCredibility comes from basing your positions on economics, science, data and facts — even if it upsets your audience.\n\nTrying to live up to a label only biases your thinking. You’ll start at the end — “I’m progressive, so I support rent control” or “I’m conservative, so I support free markets” — and then work backward, crafting a rationale for a predetermined conclusion.\nBetter to judge things on a case-by-case basis, even if the results don’t fit a neat pattern. In my case:\nI favor regulation in the form of\ncongestion pricing\nbut not the\nHousing Stability and Tenant Protection Act\n.\nI support affordable housing, but not in a way that\nconcentrates poverty\n.\nI support a minimum wage, but not one that limits apartment projects to 99 units,\nas 485x has\n.\nI cheer the fundamental\nwork standards\nwon by organized labor but not the hotel workers union’s special permit requirement that\nstopped hotel development cold\n.\nSometimes, a policy that seems reasonable — such as giving poor people but not high earners a break on sales tax — is impractical, which is why clothing items priced under $110 in New York are\ntax-free\neven for billionaires.\nThen there’s the\nscaffold law\n, which sounds unreasonable, but on further exploration, is …\neven worse\n.\nThe landlord who questioned my motives was gracious enough to delete the tweet after another reader came to my defense. And the owner then complimented my column about the legislature’s\nbaseless bills\nagainst investors’ buying houses.\nFor the record, on housing issues, we generally agree.\n“We’ll never have enough housing in NYC until it becomes profitable to build, own, operate it,” he\nposted\nrecently. “You can’t\nregulate\nyour way out of a supply problem.”\n",
    "related_links": [
      "https://x.com/erik_engquist/status/1901254175339516372",
      "https://x.com/erik_engquist/status/1901500841841799254",
      "https://therealdeal.com/new-york/2025/02/22/congestion-pricing-results-validate-real-estates-support/",
      "https://therealdeal.com/tag/housing-stability-and-tenant-protection-act/",
      "https://therealdeal.com/new-york/2024/12/02/why-south-bronx-savior-majora-carter-was-deemed-sellout/",
      "https://therealdeal.com/new-york/2024/05/02/how-nyc-investors-value-421a-extension-485x-tax-break/",
      "https://en.wikipedia.org/wiki/Fair_Labor_Standards_Act_of_1938",
      "https://therealdeal.com/new-york/2022/12/09/how-special-are-these-permits-no-one-got-any/",
      "https://portal.311.nyc.gov/article/?kanumber=KA-01675",
      "https://therealdeal.com/new-york/2013/03/18/builders-insurers-wage-war-on-nycs-scaffold-law/",
      "https://www.crainsnewyork.com/article/20130607/OPINION/130609905/editorial-new-york-s-stupidest-law",
      "https://therealdeal.com/new-york/2025/03/13/nys-senate-assembly-make-hochuls-bad-housing-plan-worse/",
      "https://x.com/WestHarlm/status/1901449931644149775",
      "https://x.com/WestHarlm/status/1901308870590369907",
      "https://therealdeal.com/new-york/2025/03/17/can-city-solve-housing-crisis-and-keep-vacancy-under-5-no/",
      "https://therealdeal.com/new-york/2025/03/12/nyc-housing-disparity-unfair-but-projects-arent-a-burden/",
      "https://therealdeal.com/new-york/2024/02/29/2019-rent-law-wrecked-rent-stabilized-buildings-report/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 16:30:00 +0000",
    "published_dt": "2025-03-18T16:30:00+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/18/kairoi-lands-62-million-refinancing-for-dallas-apartments/",
    "title": "Kairoi scores $62M refi for Oak Cliff apartments as pipeline slows",
    "subhead": "Boheme was delivered in 2023; rent growth on horizon with drop off in development",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 18, 2025, 12:15 PM",
    "pub_date_dt": "2025-03-18T12:15:00",
    "content": "Kairoi Residential’s apartment development in Oak Cliff scored a refinancing deal in a sign that lenders could be warming up with rent growth on the horizon.\nThe 352-unit complex it delivered in 2023 landed $62 million in fresh financing, according to a release from Sunrise Realty Trust, the lender on the deal. That works out to $176,000 per unit.\nSunrise Realty Trust, an affiliate of TCG Real Estate, is providing $46.5 million of the loan; the rest was syndicated to an affiliate on the TCG Real Estate platform, the release said.\nThe Class A property, at 1207 North Zang Boulevard, is located across the street from Methodist Dallas Medical Center and was built on the site of El Fenix restaurant. It features a rooftop pool and a remote work lounge with private meeting rooms.\nSan Antonio-based developer Kairoi is known for its upscale apartments. In Dallas, it also built the 297-unit Amelia at Farmers Market, at 999 South Harwood Street, and the 146-unit Selene, at 2620 Maple Avenue, next to the Crescent. Its fourth project is under construction at 4939 North Central Expressway in Knox-Henderson.\n\nSince interest rates began trending downward, lending has been a little easier to come by.\nPlus, the bottom of this cycle for Dallas-Fort Worth’s multifamily market is in the rearview mirror. The Metroplex has survived a historic deluge of deliveries, which peaked last year, and the attendant pressure on rental rates and vacancy levels.\nNearly 39,000 units were delivered in DFW from the beginning of last year to mid-November, an increase from the year before, when 36,209 were completed, according to Partners Real Estate.\nAbout 22,000 units are expected to be delivered this year. The narrowing of the pipeline is expected to shrink vacancy levels and elevate rental rates.\nClass A properties have shown more resilience amid this period of growth, Partners said.",
    "related_links": [],
    "market": "Texas",
    "published": "Tue, 18 Mar 2025 16:15:08 +0000",
    "published_dt": "2025-03-18T16:15:08+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/rechler-equity-boss-sells-park-ave-co-op-for-11m/",
    "title": "Rechler Equity boss sells Park Ave co-op for $11M",
    "subhead": "Gregg Rechler paid $2.4M in 2005 for unit at 955 Park Avenue",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 11:45 AM",
    "pub_date_dt": "2025-03-18T11:45:00",
    "content": "One member of the Rechler real estate dynasty parted ways with prime personal real estate on Park Avenue.\nGregg Rechler, a managing partner of Rechler Equity Partners and the brother of RXR’s Scott Rechler, sold his co-op at 955 Park Avenue for $10.5 million, according to public records\nreported\nby Crain’s. The sale marks 10 percent off the initial price Gregg and his wife, Lisa, sought when it listed in June.\nThe couple purchased the eighth-floor unit in 2005 for $2.4 million.\nThe buyers were Elliott Investment Management partner Jason Genrich and his wife Sara, an attorney.\nThe five-bedroom, five-and-a-half bathroom home on East 82nd Street in the Upper East Side features a living room with a decorative fireplace, a primary suite with two bathrooms and two dressing rooms and a kitchen with a china closet. Two storage units were also included in the deal.\nGregg and Lisa listed the property in June for $12 million, eager to sell the unit at the prewar property as they continue to wind through a divorce battle that started almost five years ago.\n\nA Sotheby’s International Realty team including Juliette Janssens had the\nco-op listing\n.\nRechler Equity, run by Gregg and cousin Mitchell Rechler, went public in 1995 and emerged as one of the tri-state area’s largest real estate investment trusts. Eight years later, the company spun off its Long Island properties into Rechler Equity, an entity with roughly 7 million square feet in the portfolio today.\nRechler Equity is\nshopping the Hampton Business District\nin Westhampton Beach, a five-building, 385,000-square-foot industrial park. Bidding for the campus is expected to top $200 million, which would easily shatter Long Island’s industrial sale record.\nElsewhere on the Upper East Side this week, Allen Simon — the inventor of the Wee Wee Pad —\nagreed to sell\na sixth-floor apartment at 838 Eighth Avenue, which was listed for slightly less than $25 million. Simon spent seven years searching for a buyer.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.crainsnewyork.com/real-estate/long-island-landlord-gregg-rechler-unloads-park-avenue-co-op-about-11m",
      "https://955parkavenue8thfl.com",
      "https://therealdeal.com/new-york/tristate/2025/03/12/rechler-equity-seeks-record-sum-for-li-industrial-park/",
      "https://therealdeal.com/new-york/2025/03/17/pet-entrepreneurs-ues-condo-lands-a-buyer/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/tristate/2025/03/12/rechler-equity-seeks-record-sum-for-li-industrial-park/",
      "https://therealdeal.com/new-york/2025/03/17/pet-entrepreneurs-ues-condo-lands-a-buyer/",
      "https://therealdeal.com/new-york/tristate/2023/08/28/rechler-equity-partners-shrinks-sayville-housing-project/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 15:45:00 +0000",
    "published_dt": "2025-03-18T15:45:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/cobble-hill-townhouses-lead-brooklyn-luxury-contracts/",
    "title": "Cobble Hill townhouses lead strong week for Brooklyn luxury contracts",
    "subhead": "Borough’s luxury market saw 26 contracts signed for $85M",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 18, 2025, 11:06 AM",
    "pub_date_dt": "2025-03-18T11:06:00",
    "content": "For the third straight week\nIn total, there were 26 contracts — 10 condos, three co-ops and 13 houses — for homes asking at least $2 million, according to Compass’ weekly report. The total contract volume was $85.4 million, up from\n$80.8 million across 27 signed deals\nreported in the previous period.\nDuring the same week last year, there were 19 contracts signed in the Brooklyn luxury market for a total volume of $75.3 million.\nThe top contract went to 246 Clinton Street in Cobble Hill with an asking price of $8.5 million.\nThe home previously sold over a decade ago for $4.4 million.\nSpanning 5,400 square feet with four beds and four baths, the 25-foot-wide home was renovated by Aman Architecture to maintain original details and add modern enhancements geothermal heating and cooling, radiant heated floors, water purification, smart home technology and an irrigation system for the garden.\nThe parlor floor features a living room with 21-foot ceilings and floor-to-ceiling windows, and the garden floor functions as a self-contained one-bedroom.\nThe InHouse Group’s Robert Earl and Virginia Incalcaterra had the listing.\n\nThe second priciest contract belonged to another Cobble Hill townhouse. This one, at 144 Baltic Street, had a last asking price of $5 million.\nThe 25-foot-wide brownstone spans 5,440 square feet, with an additional 1,600 square feet of outdoor space and 1,400 square feet in the unfinished basement.\nThe home is currently configured as a three-family property, explaining its sub-$1,000 price per square foot. The first three floors are set up as an owner’s triplex, with floor-through apartments on the second and third floors.\nThe parlor floor features 11.5-foot ceilings, while the garden floor has two bedrooms and two bathrooms. The second floor has two bedrooms and one bathroom, and the third floor is a two-bed, two-bath with a 500-square-foot private terrace.\nHistoric features like three fireplaces with marble mantles, crown moldings and exposed brick accents can be found throughout the home.\nThe home originally hit the market last May asking $6 million before a series of price cuts over the course of the last nine months.\nCompass’ Randy Baruh and Christine Calvo had the listing.\nLuxury homes entering contract last week had an average price per square foot of $1,364 and an average discount of 2 percent.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/11/brooklyns-luxury-contracts-kick-off-march-on-a-climb/",
      "https://therealdeal.com/new-york/2025/02/04/how-this-prospect-heights-townhouse-gets-access-to-condo-amenities/",
      "https://therealdeal.com/new-york/2025/01/28/brooklyn-heights-townhouse-asking-22m-tops-boroughs-contracts/",
      "https://therealdeal.com/new-york/2025/01/14/brooklyn-luxury-real-estate-january-2025/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 15:06:04 +0000",
    "published_dt": "2025-03-18T15:06:04+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/integra-launches-sales-for-sereno-fort-lauderdale-condos/",
    "title": "Integra launches sales for Sereno Fort Lauderdale condos",
    "subhead": "Prices at 14-story, 76-unit project start at $1.4M",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 18, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-18T10:30:00",
    "content": "Integra Investments is launching sales for Sereno Fort Lauderdale, a condo project with prices starting at $1.4 million.\nThe Miami-based developer is planning the 14-story, 76-unit condominium for 2901 Northeast 9th Court in Fort Lauderdale, according to a press release. It was\noriginally planned\nas an 11-story, 54-unit condominium with a 12-story, 100-key hotel.\nIntegra, led by principals Paulo Tavares de Melo, Victor Ballestas and Nelson Stabile, amended plans for the previous Ocean Park Residences project and renamed it Sereno Fort Lauderdale. The developer\nwon approval for the new concept\nin November.\n\nThe updated condo plan includes one-, two- and three-bedroom units that span 1,100 square feet to 2,400 square feet, the release shows. Amenities will include two rooftops, one with a pool and an outdoor kitchen, the other with a pickleball court, fitness center and spa facilities. Sereno will also have a lounge, children’s playroom and a pet spa, the release shows.\nThe design team includes FSMY Architects + Planners, interiors firm 1508 London and landscape architecture firm Design Studio Boca, according to the release. One Sotheby’s International Realty is leading sales and marketing for the project. Construction is expected to be completed in 2028, the release shows.\nFort Lauderdale\nhas emerged as a magnet for luxury condo developers.\nMore than 3,900 condos\nare in the development pipeline across Broward County, the majority of which are planned for Fort Lauderdale. Earlier this month, Regency Development Group launched sales for\nRegency Park\n, a 24-unit townhouse project planned in Fort Lauderdale, with prices starting at $2 million. In December, Naftali Group launched sales for\nViceroy Residences Fort Lauderdale\n, a planned 45-story, 370-unit branded condo tower with prices starting at $520,000.\n",
    "related_links": [
      "https://therealdeal.com/miami/2022/06/09/integra-scores-approval-for-ocean-park-hotel-and-condo-project-in-fort-lauderdale/",
      "https://therealdeal.com/miami/2024/11/22/integra-to-launch-sales-of-14-story-condo-in-fort-lauderdale/",
      "https://therealdeal.com/tag/fort-lauderdale/",
      "https://therealdeal.com/miami/2025/01/15/inside-broward-countys-condo-development-pipeline/",
      "https://therealdeal.com/miami/2025/03/04/regency-launches-luxe-townhouse-project-in-fort-lauderdale/",
      "https://therealdeal.com/miami/2024/12/03/naftali-launches-viceroy-branded-fort-lauderdale-condos/",
      "https://therealdeal.com/miami/2025/01/15/inside-broward-countys-condo-development-pipeline/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-18T14:30:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/fhfa-director-overhauls-fannie-mae-freddie-mac-boards/",
    "title": "Trump-appointed FHFA director overhauls Fannie Mae, Freddie Mac boards",
    "subhead": "Bill Pulte will chair boards of both enterprises amid uncertain future",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 10:00 AM",
    "pub_date_dt": "2025-03-18T10:00:00",
    "content": "The futures of Fannie Mae and Freddie Mac remain up in the air, but a Trump appointee is already making major shakeups.\nThe Federal Housing Finance Agency, under its new director Bill Pulte, removed eight members from the Fannie Mae board and six members from the Freddie Mac board on Monday, the Wall Street Journal\nreported\n. Four new members were appointed to each board, including Pulte, who will chair both boards.\nThese moves come only three days after Pulte was sworn in as director of the FHFA. Donald Trump\ntapped the private equity businessman\nto serve as the nation’s top housing regular two months ago.\nThe mortgage giants have been under government control since the housing bubble burst in 2008. Chatter about taking them back private has persisted over the years but has yet to result in action.\nDuring Trump’s first administration, there was an effort to take the two enterprises private once more. That attempt was\ndropped in the waning days\nof his presidency, however, and Joe Biden’s incoming administration didn’t pursue it, instead shifting attention towards improving housing affordability and ownership.\n\nEarlier this year, the FHFA and the Treasury Department agreed to amend the senior preferred stock purchase agreements between the Treasury and the two enterprises, according to\nCNBC\n. This was viewed as a step towards the eventual release of Fannie Mae and Freddie Mac from government control.\nShould the enterprises go private, the ramifications could be myriad. Mortgage rates may jump, for example, depending on how the transition unfolds. Investors of mortgage-backed securities could also face bigger risks without the government backstop.\nFannie Mae and Freddie Mac support approximately 70 percent of the country’s mortgage market, according to the National Association of Realtors.\nPulte told\nCNN\nlast week that privatizing the two enterprises is not a top priority, though he added that they “shouldn’t be in conservatorship forever.” Instead, keeping in line with Trump’s overall mandate, Pulte said he is focusing on finding and eliminating fraud within the companies.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.wsj.com/finance/regulation/fhfa-director-to-head-fannie-mae-freddie-mac-boards-amid-shake-ups-0b8ef5a6",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/national/2021/01/15/treasury-quits-bid-to-privatize-fannie-mae-freddie-mac/",
      "https://www.cnbc.com/2025/02/12/heres-what-privatization-of-fannie-mae-freddie-mac-may-mean-for-your-mortgage.html",
      "https://www.cnn.com/2025/03/13/business/fannie-freddie-privatization-fhfa-director/index.html",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/national/2021/01/15/treasury-quits-bid-to-privatize-fannie-mae-freddie-mac/",
      "https://therealdeal.com/national/2024/08/05/fannie-mae-freddie-mac-to-tighten-cre-loan-rules-even-more/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 14:00:00 +0000",
    "published_dt": "2025-03-18T14:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/18/miami-dade-county-weekly-condo-report-54/",
    "title": "Estates at Acqualina closing tops Miami-Dade weekly condo sales",
    "subhead": "Top 10 sales ranged from $3.5M to $25M",
    "authors": "ByKate HinscheResearch byAdam Farence",
    "pub_date": "Mar 18, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-18T09:45:00",
    "content": "Miami-Dade County’s condo sales and dollar volume rose last week.\nBrokers closed 135 condo sales totaling $177.2 million from Mar. 9 to Mar. 16. The previous week, brokers closed 117 condo sales totaling\n$120.8 million\n.\nLast week’s units sold for an average of $1,312,551, higher than the $1,032,863 average price from the previous week. The average price per square foot rose to $685 from $653, according to data from Redfin.\nFor the top 10 sales, prices ranged from $3.5 million to $25 million.\nUnit 4701/4702 at\nEstates at Acqualina\n, at 17975 Collins Avenue in Sunny Isles Beach, took the top spot with\na $25 million closing\n. The sale closed at $2,747 per square foot after 123 days on market. It marked the latest pricey deal in the complex’s north tower, following a $26 million penthouse sale in September that was linked to\nIranian-Canadian billionaire Michael Latifi\n.\nMichael Goldstein with Acqualina Realty had the listing, and Benjamin Moss and Liz Hogan with Compass represented the buyer.\nThe penthouse at Ocean House, at 125 Ocean Drive in Miami Beach, closed for the second highest amount,\n$24 million, or $6,098 per square foot\nafter 35 days on market. Private equity mogul Marc Leder, co-founder of Boca Raton-based Sun Capital Partners, sold the penthouse to Kayak CEO Steve Hafner. It marked  a South of Fifth price-per-square-foot record.\nSarah Williams with Societe Real Estate had the listing, and Michael Duchon and Eloy Carmenate with the Corcoran Group represented the buyer.\n\nHere’s a breakdown of the top 10 sales from Mar. 9 to Mar. 16:\nMost Expensive\nEstates at Acqualina, 17975 Collins Avenue, unit 4701/4702, in Sunny Isles Beach | Price: $25,000,000 | $2,747 psf | Listing agent: Michael Goldstein with Acqualina Realty | Buyer’s agents: Benjamin Moss and Liz Hogan with Compass\nLeast Expensive\nContinuum South Beach, 50 South Pointe Drive, unit 1207, in Miami Beach | Price: $3,500,000 | $2,426 psf | Listing agent: Lisa Yanowitz with Luxe Realty Group | Buyer’s agent: Sonia Toth with Brown Harris Stevens\nHighest Price Per Square Foot\nOcean House, 125 Ocean Drive, penthouse, in Miami Beach | Price: $24,000,000 | $6,098 psf | Listing agent: Sarah Williams with Societe Real Estate | Buyer’s agents: Michael Duchon and Eloy Carmenate with the Corcoran Group\nLowest Price Per Square Foot\nBellamare, 6000 Island Boulevard, unit 2604, in Aventura | Price: $4,775,000 | $1,131 psf | Listing agents: Richard Goihman and Ivonne Goihman with Douglas Elliman | Buyer’s agent: Richard Goihman with Douglas Elliman",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/11/miami-dade-county-weekly-condo-report-53/",
      "https://therealdeal.com/tag/estates-at-acqualina/",
      "https://therealdeal.com/miami/2025/03/17/trust-buys-estates-at-acqualina-condo-for-25m/",
      "https://therealdeal.com/miami/2024/09/26/trust-tied-to-michael-latifi-buys-26m-estates-at-acqualina-ph/",
      "https://therealdeal.com/miami/2025/03/14/marc-leder-sells-miami-beach-ph-to-kayaks-steve-hafner/"
    ],
    "market": "South Florida",
    "published": "Tue, 18 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-18T13:45:00+00:00",
    "author": "Kate Hinsche, Adam Farence"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/watermark-capital-lands-financing-for-office-to-resi-play/",
    "title": "Watermark Capital lands $125M for office-to-resi play in Dumbo",
    "subhead": "Integritas Capital, Bravo Property Trust provide financing for conversion",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-18T08:00:00",
    "content": "Watermark Capital Group secured financing for one of Brooklyn’s notable office-to-residential conversions.\nWolfe Landau’s firm scored $125 million in construction financing for the conversion of 175 Pearl Street in Dumbo, the Commercial Observer\nreported\n. Bravo Property Trust — an affiliate of Bravo Capital — and Integritas Capital provided the debt, which closed a year after BridgeCity Capital originated a $50.6 million acquisition loan.\nWatermark\nacquired\nthe eight-story, 185,000-square-foot office property last summer from Cannon Hill Capital Partners for $66.5 million. Landau immediately embarked on plans to convert the 1918-built property into a 19-story complex.\nOriginally, the plans reportedly called for a 14-story, 230,000-square-foot building with 238 rental units. Those plans have since shifted, with Watermark eyeing multifamily units on the eight converted floors and an 11-story condo property atop the rentals.\nCritically, the rental portion of the building will qualify for the city’s 467m program, giving Landau a tax abatement for 35 years in exchange for 25 percent of apartments being earmarked for affordable housing. The abatement provides a 65 percent exemption for the first 30 years before falling to 10 percent annually for the last five years of the abatement.\n\nOccupants at the building included Constangy, Brooks, Smith &amp; Prophete, Thelab and coworking company Spaces. But a BridgeCity analyst said at the time of acquisition that all tenants had either departed or were soon to do so.\nAmenities are expected to include tenant lounges and a fitness center. Watermark expects to complete the conversion in 2027.\nLast summer, Williamsburg-based Watermark\nsubmitted a proposal\nfor a residential project on the site of a shuttered church in Greenwood Heights. The 218-unit project requires a zoning change from the district’s light manufacturing zoning status to residential.\nIn June, the firm paid $15 million for Brooklyn’s Hanson Place Central United Methodist Church in Fort Greene, while in late 2023, Watermark paid $12.3 million for St. Lucy’s-St. Patrick Roman Catholic Church in Bedford-Stuyvesant and demolished it to make room for housing.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://commercialobserver.com/2025/03/125m-brooklyn-office-to-resi-conversion/",
      "https://therealdeal.com/new-york/2024/06/06/watermark-capital-plots-office-to-resi-play-in-dumbo/",
      "https://therealdeal.com/new-york/2024/08/16/watermark-eyes-third-church-property-for-redevelopment-in-under-a-year/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/06/06/watermark-capital-plots-office-to-resi-play-in-dumbo/",
      "https://therealdeal.com/new-york/2024/08/16/watermark-eyes-third-church-property-for-redevelopment-in-under-a-year/",
      "https://therealdeal.com/new-york/2025/01/23/sunlight-lands-99m-loan-for-nomad-office-to-resi-conversion/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-18T12:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/nyc-begins-public-review-of-350-park-avenue/",
    "title": "The Daily Dirt: City kicks off review of 350 Park Avenue",
    "subhead": "Project is first office tower presented to City Planning in 5 years",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 18, 2025, 7:30 AM",
    "pub_date_dt": "2025-03-18T07:30:00",
    "content": "The 1.8 million-square-foot office tower planned for 350 Park Avenue is a special case.\nDuring an earnings call last month, Vornado Realty Trust’s Steve Roth said the project was  “isolated, different,” than other ground-up office projects in part because billionaire Ken Griffin is involved. (Griffin’s Citadel is anchoring the tenant and is a partner on the project.)\nAt the time, Roth said the environment for ground-up development is otherwise so inhospitable that he doesn’t think any other project will get off the ground anytime soon. Of course, RXR, TF Cornerstone and BXP might have something to say about that, given that they plan to break ground on their own\ntrophy office towers\nthis year.\nBut on Monday the Park Avenue project became the first office tower to be presented to the City Planning Commission in five years. The Department of City Planning certified the project on Monday, kickstarting the monthslong public review of the project.\nThe project is made possible, in part, by the\n2017 rezoning\nof Midtown East, which allowed air rights from landmarked properties to be transferred to non-adjacent sites throughout the district. The development team is buying more than 480,000 square feet of air rights from St. Patrick’s Cathedral and St. Bartholomew’s Church. As part of those deals, the developers are paying more than $30 million to a public Realm improvement fund created as part of the rezoning.\nThe developers are also seeking special permits to add space for a public concourse and to make other design adjustments, hence why the project has to go through the Uniform Land Use Review Procedure.\nWhat we’re thinking about\n: What City Council races are you watching closely? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned\n: The Department of City Planning will begin public review of the Jamaica Neighborhood Plan, a rezoning that is expected to pave the way for the construction of more than 12,000 housing units in the Queens neighborhood over the next 15 years.\nElsewhere in New York…\n\n— U.S. Senate Minority Leader Chuck Schumer postponed several stops on his book tour this week, citing “security reasons” as he faces criticism for voting in favor of GOP-drafted stopgap spending bill,\nPolitico reports\n. Schumer was expected to make stops in Baltimore, Washington, New York City and Philadelphia this week to promote his new book, “Antisemitism in America: A Warning.”\n— A professor is accusing William Paterson University in New Jersey of losing his 380 million-year-old fossils,\nGothamist reports\n. Paleontologist Martin Baker is suing the school, alleging that it botched sending the fossils to a colleague in Florida, resulting in the collection being sent to a landfill in Tennessee.\n— The city plans to build a new NYPD training facility and indoor shooting range on City Island,\nthe City reports\n. Residents of City Island have complained over the years about the noise from the shooting range. NYPD representatives say the new facility will result in “almost zero to no noise at all.”\nClosing Time\nResidential:\nThe priciest residential sale Monday was\n$33.9 million\nfor a condo unit at 15 Central Park West. The Zeckendorf-developed unit’s last on-market sale was $22.7 million in 2008, though the condo is selling less than its initial listing price of over $60 million.\nCommercial:\nThe most expensive commercial closing of the day was\n$150 million\nfor 333 West 34th Street. Brookfield was the seller of the Garment District office property, which is 287,000 square feet. Brookfield faces a significant loss on the asset after paying $255 million for the property seven years ago,\nper reports\n.\nNew to the Market:\nThe highest price for a residential property hitting the market was $45 million at\n10 East 67th Street\n. The Lenox Hill townhouse is 13,100 square feet and is listed by Serhant.\nBreaking Ground:\nThe largest new building application filed was for a 48,902-square-foot, six-story, mixed-use building at 10-39 49th Avenue in Queens. The plans also feature 35 class-A units. Anthony Ng of Angelo Ng &amp; Anthony Ng Architects was the applicant on the file.\n— Joseph Jungermann",
    "related_links": [
      "https://therealdeal.com/magazine/march-2025/suddenly-developers-want-to-build-trophy-offices-again/",
      "https://therealdeal.com/new-york/2017/08/09/get-ready-for-a-ton-of-new-office-space-maybe-city-council-approves-midtown-east-rezoning/",
      "mailto:kathryn@therealdeal.com",
      "https://www.politico.com/news/2025/03/17/schumer-postpones-book-tour-over-security-concerns-00232634",
      "https://gothamist.com/news/paleontologist-says-nj-school-lost-his-380m-year-old-fossils-and-now-theyre-in-a-landfill",
      "https://www.thecity.nyc/2025/03/17/nypd-shooting-range-rodmans-neck/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031300509001",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031300353001",
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://www.compass.com/listing/10-east-67th-street-manhattan-ny-10065/1798656594379907745/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 11:30:00 +0000",
    "published_dt": "2025-03-18T11:30:00+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/beltway-capital-seizes-west-loop-offices-with-r2-still-aboard/",
    "title": "R2’s loft office debt workout cuts Heitman out of the picture",
    "subhead": "Nonperforming loan purchaser Beltway Capital kept Matt Garrison’s firm on board",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 7:15 AM",
    "pub_date_dt": "2025-03-18T07:15:00",
    "content": "Office properties hit hard by the pandemic often end up in the hands of their lenders or bargain-hunting buyers before they get a chance at a revival.\nYet for a West Loop office portfolio that plunged from 90 to 50 percent occupied, co-owner R2 has managed to remain in the drivers’ seat and go debt-free through a new partnership. Public records show its joint venture with Beltway Capital Management — finalized last month with a deed-in-lieu of foreclosure that took its former co-owner Heitman out of the picture — also adds a fifth building to the 350,000-square-foot portfolio.\nR2 bought six West Loop loft office buildings in 2016 for $86 million in a joint venture with Chicago-based Walton Street Capital. R2 later recapitalized a four-building portion of the portfolio in a joint venture with Chicago-based Heitman in 2019. The Heitman venture paid $65 million for the portfolio with a $42 million loan from Truist Financial. It’s unclear how much R2 paid to maintain its stake in the properties.\nThe joint venture struggled to hold onto the four assets, located at 641 West Lake Street, 901 West Jackson Boulevard and 130 South Jefferson Street, after the pandemic hit.\nMaryland-based Beltway, which specializes in buying distressed debt, bought the loan note from Truist last May, when the properties and their owners faced a murky path forward. The loan was labeled nonperforming at the time of its sale, meaning it likely traded for less than its face value.\nIt’s not uncommon for distressed debt buyers to file foreclosure actions shortly after acquiring a struggling loan.\nWhen Truist put the $42 million debt on the market, R2 and Heitman hadn’t technically defaulted on the loan, but it was in cash management, people familiar with the offering said. That means its excess cash flow was being used to cover debt service costs.\nIn this case, Beltway tapped R2 as its partner in managing the assets. R2 CEO Matt Garrison declined to share how much the firm invested into the portfolio to maintain its stake or what terms dictated Heitman’s departure from the joint venture.\nRepresentatives of Heitman did not respond to requests for comment.\nGarrison said R2 will be investing in “aggressive retention efforts for existing tenants,” and upgrades to common areas.\n\nIt was worth it for R2 to hang onto the assets because loft offices are often the type of buildings targeted for residential conversions, he said, meaning the number of competing properties could dwindle. Others aren’t in a position to fund the costs of competing for tenants.\n“Many of the (loft office) owners are undercapitalized or lack a rationale to invest capital in new leases, because their properties are worth less than the debt,” Garrison said. “This makes the effective inventory even smaller. We think there will always be demand for well executed loft buildings in the West Loop, and supply and demand looks better today for the right buildings than it has in a long time.”\nA few months before it bought the distressed note from Truist, Beltway also pounced on another struggling loan issued by Sun Life Assurance Company of Canada to the Feil Organization for a loft office building at 730 North Franklin Street. Beltway also partnered with R2 to take over that asset.\nNow the firms co-own all five properties outright. Debt-free buildings\nhave emerged as an appealing strategy\nfor office investors seeking flexibility in making significant building upgrades and attracting tenants with competitive lease terms.\n“Debt is just financial engineering. It isn’t required from this entry basis to generate great returns,” Garrison said. “One of the first questions tenant reps ask is about debt. Is the building in trouble, etc. Owning a property in all cash is the best answer to this question.”\nWhether the new approach will kickstart a turnaround for the full portfolio remains to be seen.\nThe office at 901 West Jackson is 90 percent occupied but the offices at 641 West  Lake and 130 South Jefferson are 50 percent occupied. Garrison said the firm is negotiating several leases across the properties.\n“In the office business, it is hard to stay flat,” he said. “You are either growing or you are declining. The Chicago office market is really two markets today, with almost half of the buildings effectively offline.”\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/03/04/debt-free-office-buildings-can-give-chicago-landlords-an-edge/",
      "https://therealdeal.com/chicago/2023/06/23/r2-buying-michigan-avenue-office-tower-for-70m-as-cbre-takes-loss/",
      "https://therealdeal.com/chicago/2024/02/16/feil-facing-beltways-foreclosure-on-river-north-office/",
      "https://therealdeal.com/chicago/2024/07/26/beltway-capital-seizes-chicago-office-building-from-feil/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 11:15:00 +0000",
    "published_dt": "2025-03-18T11:15:00+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/fannie-mae-gets-receiver-for-mendel-steiners-rentals/",
    "title": "Fannie Mae secures receiver for Mendel Steiner’s properties",
    "subhead": "Judge granted emergency motion over late investor’s rentals in Cleveland",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 18, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-18T07:00:00",
    "content": "The receivers are coming for the late Mendel Steiner’s rental properties.\nA federal judge recently granted Fannie Mae’s request to appoint a receiver to take control of Steiner’s 308-unit portfolio around Cleveland.\nThe Borough Park investor had amassed thousands of multifamily units across the U.S. But in January, Steiner died by suicide at the age of 33, sending\nshockwaves\nthrough Brooklyn’s close-knit commercial real estate community.\nFannie Mae’s lawsuit, which sought to foreclose and appoint a receiver for Steiner’s properties in Cleveland, offers new details about the financial pressure Steiner faced prior to his death.\nFannie\nsued Steiner and his affiliated entities in 2024, alleging he defaulted on a $22.7 million loan originated by Greystone. Fannie alleges Steiner’s companies failed to pay taxes, falsified rent rolls and failed to provide information during an inspection. Steiner guaranteed the loan, making him personally liable, according to the lawsuit.\nThe lawsuit alleges Steiner neglected the properties, failing to service any of the fire extinguishers at the properties for two years. Gas was shut off for months and trash piled up at some of his properties, according to Fannie’s lawsuit.\nDuring two years of Steiner’s ownership, occupancy fell from 99 percent to 25 percent.\n\nBy September 2024, Fannie sought to appoint a receiver for the properties in Cleveland and Shaker Heights spanning 15 parcels and totaling 333,580 square feet.\nBut Steiner’s lawyers contested the receivership. They argued a receiver would add an extra layer of cost and Steiner was working hard to address the issues with the properties. Steiner’s father Lieb Steiner filed a declaration supporting the motion to oppose the receiver.\nOn February 10, Steiner’s counsel filed a “Notice of Suggestion of Death,” which stated that Steiner died a month prior. In late February, Fannie sought an immediate appointment of a receiver for the properties.\nThe judge ruled in favor of Fannie and appointed Michael Guggenheim as the receiver.\n“The evidence submitted by Fannie Mae reveals significant and ongoing damage to the properties due to mismanagement,” Judge Bridget Meehan Brennan said in the order.\nIn late February, a judge approved Bank of Montreal’s request to appoint a\nreceiver\nfor Steiner’s 800-unit rental properties in Baltimore. Steiner secured a $160 million refinancing from BMO for the properties in early 2024.\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/",
      "https://therealdeal.com/tag/fannie-mae/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/01/10/mendel-steiner-dead-at-33/",
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-18T11:00:00+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/east-bay-architect-eyes-15-homes-next-to-war-memorial-in-lafayette/",
    "title": "East Bay architect wants to build 15 homes next to war memorial in Lafayette",
    "subhead": "Lara Dutto to preserve Lafayette Hillside Memorial from development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 8:22 PM",
    "pub_date_dt": "2025-03-17T20:22:00",
    "content": "Architect-turned-builder Lara Dutto plans to build 15 homes next to a war memorial of thousands of white wooden crosses in Lafayette.\nDutto, principal of Orinda-based Laraarchitecture, bought the\nLafayette Hillside Memorial\nat 3600 Deer Hill Road two years ago to save the 3.1-acre parcel from development,\nthe San Francisco Chronicle reported\n.\nNow Dutto, a professor of architecture at Diablo Valley College, has pitched a plan to develop 15 homes on the northern two-thirds of the site.\nShe wants to split off the southern portion to preserve the memorial conceived in 2006 by contractor Jeff Heaton as a “place to recognize, honor, and commemorate individual national service contribution” of those dying in the Iraq and Afghanistan wars.\nNonprofit Lafayette Hillside Memorial would continue to maintain the crosses.\n“Its scale and rawness and simplicity somehow makes me stop, forces me to take a deep breath, and in that moment I am so grateful for my freedoms,” she told the Chronicle.\nDutto, who has worked since 2010 to support the memorial and once sat on its board, grew concerned when the family that owned it put it up for sale, fearful that whoever bought it would remove the crosses. So she bought it in 2023 for an undisclosed price.\nPlans now call for preserving the memorial and half the property as open space, while building a subdivision of 15 single-family homes around a “village green,” with an outdoor cooking and dining area, according to the Chronicle.\nFive of the homes would have accessory dwelling units, or granny flats. The development would climb up the slope along Oak Hill Road, below a ridgeline of preserved open space.\n\nDutto has employed a state density bonus and Senate Bill 330 for streamlined approvals. On Monday, the Lafayette Planning Commission was slated to hold an informational hearing.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals.\nThe lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nMayor Susan Candell took issue with the lawsuit, according to the Chronicle, saying the City Council has approved all housing projects that have come before it. She said the city will have no choice but to approve the Deer Hill Road project.\nLafayette, a wealthy city with $2 million homes, was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nWithin a 10-year span, 115 homes were built in the city of 25,000 residents, including 10 in 2010, 76 in 2018 and 29 in 2019. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.lafayettehillsidememorial.org/",
      "https://www.sfchronicle.com/bayarea/article/housing-war-memorial-lafayette-20217913.php",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 00:22:50 +0000",
    "published_dt": "2025-03-18T00:22:50+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/tampa/2025/03/17/developer-offers-260-million-for-tropicana-field/",
    "title": "$260M cash offer for Tropicana Field plays off Rays exit",
    "subhead": "Blake Investment Partners, unnamed firm offered $60M upfront to repair damage from Hurricane Milton ahead of MLB team’s 2028 lease expiration",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 7:12 PM",
    "pub_date_dt": "2025-03-17T19:12:00",
    "content": "A developer’s $260 million cash offer for the hurricane-beaten Tropicana Field is about $70 million less than what the city of St. Petersburg says it’s worth.\nBlake Investment Partners, a prominent local private equity firm, has teamed up with an unnamed “household” New York investment firm for the offer, setting the stage for a potential redevelopment of the Rays’ stadium, the Tampa Bay Business Journal\nreported\n.\nThe unsolicited offer comes after the Major League Baseball team exited a\nprevious $1.3 billion redevelopment deal\nwith Hines. The offer includes a $60 million upfront payment for urgent stadium repairs from damage caused by Hurricane Milton and a second installment following the expiration of the Rays’ lease in 2028.\nThe city previously valued the 86-acre site at $331 million ($3.8 million per acre), but Blake argued that hurricanes, rising interest rates and development constraints have lowered its market potential, estimating it could take a decade to maximize its value.\nBlake has also committed to having at least $500 million in vertical construction permitted and ready to start by the time the lease concludes.\n\nThe developer would parcel out the land and sell it to various developers, targeting high-end hotels, restaurants and architects to shape a “varied” mixed-use district, Blake said.\nThe offer is likely to trigger an open bid process, inviting competing proposals, with any final agreement requiring approval from the St. Petersburg City Council.\nBlake is also working with the city on preserving up to 15 acres for a park around Booker Creek and another 2 acres for an African American museum. He suggested Pinellas County could use tourist tax dollars to fund a future convention center.\nMeanwhile, the Rays are playing this season’s home games at Steinbrenner Field, the New York Yankees’ spring training stadium.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/tampabay/news/2025/03/13/tropicana-field-land-purchase-proposal.html",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/03/06/400-central-developer-talks-next-projects-rays-future/",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/02/11/bank-ozk-loans-182-million-for-tampas-gasworx-development/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 23:12:01 +0000",
    "published_dt": "2025-03-17T23:12:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/kb-home-pays-58m-for-office-to-resi-plan-in-san-ramon/",
    "title": "KB Home pays $58M to get into office-to-resi redevelopment in San Ramon",
    "subhead": "Developer plans to raze 276,000 sq building to make way for 190 townhomes, single-family homes in Bishop Ranch",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:32 PM",
    "pub_date_dt": "2025-03-17T18:32:00",
    "content": "KB Home has paid $57.8 million for a 276,000-square-foot building it wants to replace with 190 homes in San Ramon’s Bishop Ranch.\nAn affiliate of the Los Angeles-based developer paid cash for the three-story office building at 2527-2545 Camino Ramon,\nthe San Jose Mercury News reported\n.\nThe seller of the Bishop Ranch 7 building was locally based Sunset Development, the principal owner and developer of Bishop Ranch.\nThe deal works out to $209 per square foot.\nPlans by the developer include bulldozing the offices at Camino Ramon and Executive Parkway to clear the way for 190 homes.\nKB Home wants to develop\nBartlett\n, a walkable neighborhood on the north side of Bishop Ranch, according to the Mercury News.\nThe project would have 396,100 square feet of housing, including 118 townhomes and 72 single-family homes, according to a planning document. The detached homes would range from 1,800 to 2,400 square feet with three to four bedrooms and two and a half to three bathrooms, with two-car garages.\nRenderings by SDG Architects show gray and white townhouses surrounding green courtyards with jacaranda trees. The project would be built next to City Village, a\n404-unit project\nnow being built by SummerHill Homes, a local unit of Calabasas-based Marcus &amp; Millichap.\n\nCost and timeline for the KB Home development were not disclosed.\nSunset, owned by the Mehran family, wants to redevelop the\n585-acre office campus at Bishop Ranch into a retail village\nwith up to\n10,000 homes\n.\nThe developer’s CityWalk Master Plan, approved in 2020, would redevelop 135 acres with thousands of homes, a hotel, shops and restaurants in three distinct neighborhoods.\nThe master developer, led by Alex Mehran Jr., also plans to build another\n2,600 homes at the former Chevron headquarters\nat 6001 Bollinger Canyon Road, along with 125,000 square feet of open-air shops and restaurants and a 2.5-acre park. Sunset, which sold Chevron the land for its headquarters in 1981, bought it back in 2022 for $174.5 million.\nMehran told\nThe Real Deal\nthis month that Sunset had made random selections as to which offices would be torn down for homes.\n“I threw a dart at the wall,” he joked, explaining how he decided which of his family’s office properties should be razed to create 300,000 square feet of retail and entertainment options at Bishop Ranch’s CityCenter, which opened in 2018, and 8,000 planned homes.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/11/san-ramon-home-build-property-east-bay-office-economy-real-estate-jobs/",
      "https://sanramonca.iqm2.com/Citizens/FileOpen.aspx?Type=1&ID=3748&Inline=True",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/?firstLevel=sanfrancisco&secondLevel=2022&thirdLevel=01&fourthLevel=13&fifthLevel=summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon",
      "https://therealdeal.com/san-francisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://www.bishopranch.com/press/bishop-ranchs-first-batch-of-homeowners-move-in/",
      "https://therealdeal.com/sanfrancisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/bishop-ranchs-transformation-with-sunset-development-ceo/",
      "https://therealdeal.com/san-francisco/2025/02/10/eden-housing-sunset-plan-200-affordable-units-in-san-ramon/",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 22:32:51 +0000",
    "published_dt": "2025-03-17T22:32:51+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/mesirow-lists-apartment-complex-in-hot-suburban-chicago/",
    "title": "Tax stability, retail galore grease Mesirow’s multifamily listing",
    "subhead": "294-unit apartment complex hits market in Vernon Hills",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:24 PM",
    "pub_date_dt": "2025-03-17T18:24:00",
    "content": "Mesirow is betting on strong rental demand, tax certainty and proximity to redeveloping retail with the listing of a Vernon Hills apartment complex.\nThe Chicago financial services firm is selling its 294-unit apartment complex at 1155 Museum Boulevard in Vernon Hills, Crain’s\nreported\n. The asking price wasn’t disclosed. Mesirow purchased the complex in 2018 for $87.1 million, or $296,000 per unit, according to CoStar Group.\nThe seven-story complex, the Mil’Ton, is 94 percent occupied, with an average unit size of 1,117 square feet and average rents of $2,546 per month, or $2.28 per square foot. The rents range from about $2,500 to $3,800, according to listing sites.\nMesirow tapped CBRE brokers John Jaeger, Justin Puppi and Jason Zyck to market the property.\nThe apartments benefit from proximity to the Hawthorn Mall, which is undergoing a\n$252 million redevelopment\n, along with Mellody Farm, a 270,000-square-foot retail and residential center completed in 2019.\n\nRegency Centers’ Mellody Farm development has been so successful that Vernon Hills officials are\nlooking at early retirement for the tax increment financing district\ncreated for the area.\nSuburban rental demand is strong,\noutpacing the city core\neven as elevated interest rates have made commercial deals more challenging. Suburban Chicago rents rose 4.4 percent year over year in the fourth quarter to $2.09 per square foot, according to Integra Realty Resources.\nAnother potential draw for buyers is the complex’s “Non-Cook County tax certainty.” Mesirow secured an agreement with the local assessor that stabilizes the property’s assessed value at $77.3 million, with tax increases capped at 3 percent annually for the next three years.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/vernon-hills-apartment-complex-sale",
      "https://therealdeal.com/chicago/2022/09/14/vernon-hills-approves-second-phase-of-hawthorn-mall-plan/",
      "https://therealdeal.com/chicago/2024/04/04/tif-revenue-for-regency-centers-vernon-hills-project-skyrockets/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2024/01/21/mesirow-downsizes-chicago-hq-in-lease-extension/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 22:24:18 +0000",
    "published_dt": "2025-03-17T22:24:18+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/gehry-designed-office-building-proceeds-in-playa-vista/",
    "title": "Gehry-designed office building proceeds in Playa Vista",
    "subhead": "NSB’s plan for 196K sf project suffered 2020 legal setback",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:39 PM",
    "pub_date_dt": "2025-03-17T17:39:00",
    "content": "NSB Associates is back on track for an approved 196,000-square-foot office building designed by Frank Gehry in Playa Vista, which stalled four years ago because of a lawsuit.\nThe Beverly Hills-based developer was reapproved by the Los Angeles City Planning Commission to build the eight-story building at 12575 West Beatrice Street,\nUrbanize Los Angeles reported\n.\nThe offices, approved in 2017, were forced by a court to undergo further environmental review. This month, the Planning Commission approved the revised environmental impact report for the project known as New Beatrice West.\nPlans include 3,400 square feet of shops and restaurants. An existing office building, home to Gehry Partners, would be retained.\nThe U-shaped, 135-foot-tall project, designed by Gehry, will have upper level setbacks to create terrace decks.\nConstruction is expected to take 18 months. A project cost and when NSB is expected to break ground were not disclosed.\n\nKarney Management, a property owner nearby, had repeatedly appealed the office building to attempt to force the project to undergo further environmental review, without success.\nThe company led by Aliza Karney Guren\nsued the City of Los Angeles\nto block the project. In January 2020, a Los Angeles judge ruled that the mitigated negative declaration conducted for the project had not sufficiently considered impacts to aesthetics, noise and traffic congestion.\nAs a result, the Planning Department was forced to redo the environmental review process, although project entitlements were not overturned by the decision, according to Urbanize.\nNew Beatrice West is the second collaboration between Larry Field, founder of NSB Associates, and his longtime friend Frank Gehry. In 2023, NSB completed its two-building,\n80,000-square-foot offices\n, designed by Gehry,\nin El Segundo\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/city-planning-commission-signs-eir-gehry-designed-offices-12575-beatrice-street-playa-vista",
      "https://casetext.com/case/karney-mgmt-v-city-of-los-angeles",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://urbanize.city/la/post/gehry-designed-office-building-completed-el-segundo",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://therealdeal.com/la/2016/04/13/playa-vista-is-getting-a-new-campus/",
      "https://therealdeal.com/la/2023/01/18/frank-gehry-project-with-approvals-for-sale-in-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:39:33 +0000",
    "published_dt": "2025-03-17T21:39:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/accesso-faces-dilution-in-69-million-chicagoland-debt-trouble/",
    "title": "Hamilton seeks reprieve for big office debt as Accesso bleeds equity",
    "subhead": "Minority owner of Esplanade building in Downers Grove is putting up capital to hang onto property as $69M debt transfers to special servicer",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 17, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-17T17:30:00",
    "content": "Hamilton Partners is maneuvering to save a struggling suburban Chicago office deal without getting much help from its distressed ownership companion, Accesso Partners, which faces foreclosures at a handful of properties in the area.\nItasca-based Hamilton is a minority owner of the Esplanade I, a 609,000-square-foot office complex at 2001 Butterfield Road in Downers Grove, a property that had its $69 million loan transferred last month to special servicer CW Capital, a sign of financial trouble for the landlord.\nAccesso, based in the Miami suburb of Hallandale Beach, has the larger ownership stake in the 19-story property of the two firms, but it’s either unable or unwilling to commit the capital necessary to work out the debt trouble alongside Hamilton, said Hamilton partner Ron Lunt.\nAs a result, Hamilton is seeking to delay the maturity of the property’s loan, which comes due in July of next year, and is starting debt workout talks with CW Capital around how to fund the costs of turning the property around, such as tenant allowances for workspace buildouts and leasing broker commissions, Lunt said.\n“We have some lease talks going, but if we’re going to spend a ton of money, we would like to work out an extension of some sort,” Lunt said. “Offices are low priority for lenders today, which is why you need to start the discussion early.”\nCW Capital declared the loan is headed toward “imminent monetary default,” although Lunt said the loan terms were only breached on a technicality because its previous loan servicer, Iowa-based Principal, was allowing rents to be collected and debt costs to be paid later in the month than the special servicer.\nCW is reviewing Hamilton’s request for a modification to the deal terms, and it’s unclear when it will come to a resolution. Accesso, meanwhile, will have its equity in the property diluted further with each dollar Hamilton kicks into the deal as it attempts to rescue the loan from the brink of distress, Lunt said.\nAccesso didn’t return requests for comment. It surrendered its office tower at 20 North Clark Street in the Chicago Loop to its lender earlier this year, and it is also facing a\n$75 million foreclosure at 200 West Monroe Street\n, which is next door to a property the firm previously sold at a major loss from its previous purchase price. Accesso made other\nsuburban office investments that recently ended up in foreclosure\n, too. The firm bought several of those properties from Hamilton, and entered the Esplanade deal in a 2015 joint venture.\nAccesso also lost a\nHouston office portfolio\nto financial distress last year.\n\nThe suburban Chicago property was appraised at $105 million ($172 per square foot) in 2016, when the joint venture’s commercial mortgage-backed securities loan was originated. That’s far more than what it’s likely worth today as interest rates and subdued demand from tenants have eaten into property values. The loan’s $57.3 million balance pencils out to $94 per square foot.\nThe property’s financial trouble was triggered in part by the 2023 exit of Hillshire Brands, an affiliate of Tyson Foods, that previously leased a 72,000-square-foot annex building that serves as a research and development facility on the Downers Grove campus.\nThat space hasn’t been refilled, and the asset is only 72 percent leased, about average for suburban Chicago office buildings amid one of the worst downturns of all time for the sector. The lackluster occupancy has sunk the property’s revenue to well below the level required to meet debt service obligations, public loan data shows.\nThe property’s debt-service coverage ratio was just 0.43 for 2024 through the end of September, loan data compiled by Morningstar Credit shows — anything less than 1.0 is below breakeven, meaning the Esplanade property was bringing in less than half the rent needed to cover its costs.\nStill, Hamilton is working with a brokerage team focused on food processing companies to help lease the space Hillshire vacated, with the hope it can get the deal back on track in time to dodge penalties with its lender.\nYet it’ll be vying for tenants with other office properties in the suburbs that have already been through foreclosure or deeply discounted sales in\nnearby suburban markets\n, allowing their buyers to offer lower rents in some cases, Lunt noted.\n“Major projects in\nSchaumburg\nhave gone through ownership changes and the bases are all reset, and it makes it tougher competition,” Lunt said.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/11/27/deutsche-files-75m-loop-foreclosure-against-accesso/",
      "https://therealdeal.com/chicago/2023/06/20/accesso-juggling-loan-deadlines-in-rough-suburban-office-market/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/",
      "https://therealdeal.com/chicago/2024/03/29/alfred-teo-buys-distressed-schaumburg-towers-near-chicago/",
      "https://therealdeal.com/chicago/2023/08/29/lender-slams-gluck-with-83m-schaumburg-office-foreclosure-suit/",
      "https://therealdeal.com/chicago/2025/01/10/accesso-partners-surrenders-chicago-office-tower-to-lender/",
      "https://therealdeal.com/chicago/2024/07/03/downers-grove-office-building-saddled-with-45m-delinquency/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-17T21:30:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/former-kb-home-ceo-bruce-karatz-sells-flats-home-for-27m/",
    "title": "Former KB Home CEO lands $27M for Beverly Hills Flats manse",
    "subhead": "Deal marks yet another trade for city’s Flats neighborhood",
    "authors": "ByKari HamanakaResearch byAbigail Nehring",
    "pub_date": "Mar 17, 2025, 5:25 PM",
    "pub_date_dt": "2025-03-17T17:25:00",
    "content": "Former KB Home CEO Bruce Karatz inked a deal to sell his Beverly Hills mansion for $27 million as activity continues in the Flats.\nKaratz and his wife, socialite and philanthropist Lilly Tartikoff, sold 620 North Beverly Drive for about 17 percent less than the $32.5 million ask the home had when it went on the market in mid-October.\nA limited liability company registered with a Westlake Village address is the buyer, according to property and state records.\nThe nine-bedroom, eight-bathroom home totals 10,554 square feet. Built in the 1920s, the traditional-style home sits on nearly an acre.\nIt has a screening room, library, pool house, tennis court, two-bedroom guest house and was renovated by acclaimed architect Paul Williams.\nCarolwood Estates’\nDrew Fenton\nlisted the property, while The Beverly Hills Estates’\nJack Harris and Michael Fahimian\nrepresented the buyer.\n\nThe Beverly Drive estate is the latest move in a steady flow of activity in Beverly Hills’ Flats neighborhood.\nLast month, the home at\n622 North Elm Drive\nsold for $19.9 million. It was a quick trade with the home on the market for less than a month and purchased by a trust tied to accountant Marc Sniderman and Michael Karlin, a business manager for celebrities and other high-profile clients.\nIn January TV executive\nDavid Salzman\nsold his former home at 702 North Sierra Drive for $17 million.\nInventory in the Flats has also seen a boost.\nCompass’ Josh Flagg listed the\nGloria Vanderbilt estate\nat 719 North Maple Drive for $16.5 million in late January. About two weeks later the home went into contract.\nFormer supermodel\nChristina Estrada\nlisted her home at 722 North Maple Drive earlier this month, with an asking price currently at $24 million — $2 million less than the original ask.\nHasbro CEO\nBrian Goldner and his wife Barbara Goldner lopped some off the asking price at 610 North Canon Drive. The couple placed the home on the market for $27 million in December and last month reduced it to $23.5 million.\n",
    "related_links": [
      "https://therealdeal.com/magazine/august-2024/how-las-boutique-brokerages-juggle-closing-deals-with-managing-the-business/",
      "https://therealdeal.com/la/2024/10/21/meet-las-youngest-team-of-luxury-home-mega-brokers/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/fresh-prince-producers-beverly-hills-home-sells-for-17m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/01/06/beverly-hills-manse-owned-by-late-hasbro-ceo-lists-for-27m/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:25:20 +0000",
    "published_dt": "2025-03-17T21:25:20+00:00",
    "author": "Kari Hamanaka, Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/jim-halperin-pitches-tower-to-replace-dallas-strip-mall/",
    "title": "Jim Halperin pitches resi tower to replace Oak Lawn strip mall",
    "subhead": "Local stakeholders support rezoning for development plan, which includes retail",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:11 PM",
    "pub_date_dt": "2025-03-17T17:11:00",
    "content": "A Dallas developer’s plans to transform an Oak Lawn strip mall into a mixed-use development received a warm welcome from local stakeholders.\nJim Halperin, co-founder of Irving-based Heritage Auctions, envisions a 24-story residential tower and upscale restaurants at 2615 Oak Lawn Avenue, which the Oak Lawn Committee gave unanimous support, the Dallas Business Journal\nreported\n.\nThe proposal aims to reshape a corner that could be a key gateway into the neighborhood. The 1.93-acre property has been owned by the Halperin family for the past 19 years.\nThe development would feature 310 residential units covering about 40 percent of the site, while the remainder will focus on open space, pedestrian-friendly amenities and two or three restaurants, some spanning multiple levels with roof terraces. GFF Design is attached to the project.\nTenants of the strip mall include Open Sesame Lebanese Grill, whose owners have been in discussions with Halperin about remaining in the neighborhood, though whether it stays on-site or relocates is still undecided.\n\nThe project’s design takes a cue from the Old Parkland campus redevelopment by Crow Holdings at 3819 Maple Avenue, which GFF CEO Evan Beattie called “transformational” for the neighborhood.\nThe redevelopment requires rezoning, which could take up to two years to finalize.\nThe project is set to add to the wave of redevelopment reshaping Oak Lawn, a neighborhood known for its nightlife and identity as the heart of Dallas’ LGBTQ+ community.\nSeveral office and residential developments are underway nearby, like McCourt Partners and HN Capital Partners’ 40-acre mixed-use development at\n1650 Oak Lawn Avenue\nas well as\nThe Oak Lawn Design Plaza\n, covering nine acres at 1444 Oak Lawn Avenue from Charlotte, North Carolina–based investor Asana Partners.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/oak-lawn-avenue-strip-mall-redevelopment-plans.html",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/",
      "https://therealdeal.com/texas/dallas/2025/02/13/henry-s-miller-clears-hurdle-for-controversial-mixed-use-plans/",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 21:11:33 +0000",
    "published_dt": "2025-03-17T21:11:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/trust-buys-estates-at-acqualina-condo-for-25m/",
    "title": "Trust buys Estates at Acqualina condo for $25M, adding to slew of pricey deals",
    "subhead": "Unit spans 9,100 sf with six bedrooms, hit market for nearly $28M in November",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 17, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-17T17:00:00",
    "content": "A trust bought a 9,100-square-foot Estates at Acqualina condo for $25 million, marking the latest pricey closing in the oceanfront luxury complex.\nRecords show Casa Numa Land Trust bought unit 4701/4702 in the north tower at 17975 Collins Avenue from an affiliate of Jules and Eddie Trump’s development firm, Trump Group. The Trumps have no relation to President Donald Trump.\nMichael Goldstein with Acqualina Realty had the listing, and Liz Hogan and Ben Moss with Compass brought the buyer.\nThe condo has six bedrooms and seven bathrooms and sold fully furnished, according to the listing.\n\nEstates at Acqualina\nis an oceanfront luxury condo complex that includes a 52-story, 94-unit north tower and a 49-story, 154-unit south tower. The towers have lobbies designed by the late Karl Lagerfeld, 45,000 square feet of amenities that include a bowling alley, ice skating rink and a movie theater, and the restaurant Avra Miami Estiatorio.\nThe Trump brothers started construction on the $1.8 billion project in 2018. Years of construction delays culminated in litigation between the Trumps and their general contractor, Suffolk Construction, that resulted in\nthe developer firing Suffolk\nfrom the project in 2023.\nClosings began in 2022, with some notable buyers like\nLeBron James\n,\nKimber gunmaker Leslie Edelman\nand\nEuropean Wax Center co-founder Joshua Coba\ndropping millions on Estates at Acqualina condos.\nMore recently, a trio of pricey deals closed in September. A trust linked to Iranian-Canadian billionaire Michael Latifi bought\na penthouse for $26 million\n. The heads of Mexico’s largest real estate investment trust, Fibra Uno, bought a unit for\n$20 million\n. A different trust bought a condo for\n$16.9 million\n.",
    "related_links": [
      "https://therealdeal.com/tag/estates-at-acqualina/",
      "https://therealdeal.com/miami/2023/07/07/estates-at-acqualina-developer-fires-general-contractor/",
      "https://therealdeal.com/miami/2022/10/19/lebron-james-buys-oceanfront-sunny-isles-condo/",
      "https://therealdeal.com/miami/2022/12/08/kimber-gunmaker-buys-estates-at-acqualina-condo-for-21m/",
      "https://therealdeal.com/miami/2024/05/16/european-wax-center-co-founder-buys-sunny-isles-beach-condo/",
      "https://therealdeal.com/miami/2024/09/26/trust-tied-to-michael-latifi-buys-26m-estates-at-acqualina-ph/",
      "https://therealdeal.com/miami/2024/09/10/mexican-reit-bosses-buy-20m-estates-at-acqualina-condo/",
      "https://therealdeal.com/miami/2024/09/30/trust-buys-estates-at-acqualina-condo-for-17m/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-17T21:00:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/17/beechwood-bogs-down-plans-in-kings-park/",
    "title": "Beechwood slims down Kings Park plans",
    "subhead": "Developer cuts more than 100 units from planned condo community",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:36 PM",
    "pub_date_dt": "2025-03-17T16:36:00",
    "content": "The Beechwood Organization is not abandoning its plans for Kings Park, but it is cutting them down significantly.\nThe Long Island-based developer is pitching a 288-unit community for Country Pointe Estates at Kings Park in Suffolk County, Newsday\nreported\n. That’s a significant retrenchment from the\n391-unit project proposed\ntwo years ago.\nMichael Dubb’s firm capsized the unit count amid concerns from the community, which Dubb said was a voluntary decision. The $220 million project now comprises 53 single-family homes, 153 townhomes and 82 villas, 29 of which would be set aside for affordable housing.\nThe development is still set to unfold on a property at the corner of Old Northport and Lawrence roads, previously home to a concrete manufacturing and sand mining operation. It also complies with Smithtown’s Comprehensive Plan.\nBut opposition remains. The president of the Kings Park Community Association says the group remains concerned the development is too large and that the reduction in size will simply open the door for other developers to increase the size of their own adjacent projects. He added the project “provides no discernible benefits to the community.” Concerns also include the area’s environment, drinking water, traffic and schools.\n\nBeechwood is building a wastewater sewage treatment plant in conjunction with the Country Pointe Estates. The development is still a long way off; Dubb is hoping to secure all approvals by 2027 and complete work on the development by 2030.\nKings Park is home to several sizable projects, creating concerns for some community members about overdevelopment. Smithtown is creating a comprehensive master plan for Kings Park’s downtown development.\nDespite concerns about overdevelopment, there’s also a need to update the housing stock in the hamlet; the Country Pointe Estates project could increase the number of units in the hamlet by 4.4 percent alone, according to project consultants.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.newsday.com/long-island/towns/country-pointe-kings-park-iw8ttud6",
      "https://therealdeal.com/new-york/tristate/2023/03/13/beechwood-planning-391-unit-condo-community-in-kings-park/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/tristate/2023/03/13/beechwood-planning-391-unit-condo-community-in-kings-park/",
      "https://therealdeal.com/new-york/tristate/2024/11/18/beechwood-pitches-400m-plan-to-revive-mastic-beach/",
      "https://therealdeal.com/new-york/tristate/2023/09/21/court-shoots-down-southamptons-fee-imposed-on-beechwood/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 20:36:17 +0000",
    "published_dt": "2025-03-17T20:36:17+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/drw-holdings-founder-sells-lakefront-mansion-for-7-million/",
    "title": "DRW Holdings founder banks profit in $7M sale of lakefront mansion",
    "subhead": "Beachfront home in Michigan’s Harbor Country scored while sellers often take price cuts in Chicago’s luxury market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Real estate heavyweight Don Wilson Jr. turned a tidy profit on a lakefront property he bought five years ago.\nThe founder and CEO of DRW Holdings sold his mansion at 16096 Lake Avenue in Union Pier, Michigan, for $7 million in one of the region’s biggest deals of last year, the Chicago Tribune\nreported\n.\nThe 10,750-square-foot home sold for $651 per square foot; Wilson bought it for $4.05 million ($377 per square foot) in 2020.\nHarbor Country has become a sought-after vacation and second-home destination for Chicagoans.\nAt least one off-market deal in nearby New Buffalo topped $8.5 million last year, but Wilson’s sale is believed to be one of the highest publicly listed sales in the area recently.\nThe region has long been a favored retreat for Chicagoans due to its proximity — just over an hour’s drive from the city. But\ndemand for vacation homes in the area\nhas surged in recent years, with limited inventory and rising prices proving its value as a second-home market.\nThe median listing home price in Union Pier, for example, jumped 50.6 percent year over year in February to $1.3 million,\naccording to Realtor.com\n.\n\nThe 28,000-square-foot property has 99 feet of Lake Michigan frontage. Built in 2007, the home has eight bedrooms, six full bathrooms, a wine cellar, a 12-seat theater, a gym and a lake-facing deck with a pool.\nElizabeth Roch and Toni Philander Morris of @properties Christie’s International Real Estate had the listing. The buyer was represented by @properties Christie’s agent Janice Smith.\nWilson listed the home for $9.2 million in 2023 before cutting the asking price to $8.5 million later that year. The buyer’s identity is hidden by a Delaware LLC that owns homes in Chicago suburb Oak Park and Palm Beach, Florida.\nWilson owns a Lincoln Park mansion and is\nstill marketing\nhis Wicker Park residence at 1407 North Hoyne Avenue for $6 million after extensive renovations that combined the historic property with an adjacent coach house. He listed the Wicker Park mansion for almost $7 million in 2023.\nWilson manages broad real estate interests, including projects led by Convexity Properties, DRW’s real estate arm. Convexity is known for redeveloping Chicago landmarks like the\nRobey Hotel\nand the Three Arts Club.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagotribune.com/2025/03/14/drw-holdings-michigan/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://www.realtor.com/realestateandhomes-search/Union-Pier_MI/overview",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2018/09/12/new-union-station-plan-ditches-apartments-adds-retail-and-park/",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://therealdeal.com/chicago/2024/05/02/goodman-scores-17m-to-replace-don-wilson-development-site-debt/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/figure-ai-leases-99k-sf-for-new-san-jose-headquarters-plant/",
    "title": "Figure AI leases 99K sf for new headquarters plant in San Jose",
    "subhead": "Humanoid robotics firm nearly quadruples base in move from Sunnyvale",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Figure AI has moved its headquarters to San Jose from Sunnyvale, nearly quadrupling the size of its office and manufacturing hub.\nThe artificial intelligence robotics firm now occupies a 98,700-square-foot industrial flex building at the Assembly at North First tech campus at 3960 North First Street,\nthe SiliconValley.com reported\n.\nTerms of the lease with landlord EQT Exeter, based outside of Philadelphia, were not disclosed.\nFigure AI’s former Sunnyvale office totaled 27,900 square feet, according to LoopNet.\nIts new “robot campus” in San Jose will support “manufacturing, fleet operations and overall engineering/design build-out,” Brett Adcock, founder and CEO Figure AI, said on his LinkedIn page.\nThe headquarters sits next to the\nhub for Logitech\nwithin the six-building Assembly at North First complex once occupied by Lam Research, a semiconductor firm.\n\nIn 2021, EQT Exeter bought the 27-acre, 489,100-square-foot  campus for\n$192 million\n, or $393 per square foot, according to\nThe Real Deal\n. The campus, built in 1984, was renovated in 2018, according to Loopnet.\nFigure AI is working to “bring humanoid robots into commercial operations,” according to Adcock.\nIn February last year,\nFigure AI landed $675 million through a capital raise\nfrom Microsoft, OpenAI Startup Fund, Nvidia, Amazon founder Jeff Bezos, Parkway Venture Capital, Intel Capital and others.\nEQT Exeter, founded in 2006 as Exeter Property Group, has more than $30 billion in assets under management, including more than 2,000 properties and 375 million square feet of warehouses, office and life sciences buildings and homes, according to its website.\nIn early 2021, Swedish private equity manager EQT AB acquired Exeter Property Group and renamed it EQT Exeter, which serves as its real estate arm.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.siliconvalley.com/2025/03/11/san-jose-ai-artificial-intelligence-robot-jobs-work-tech-build-property/",
      "https://www.mercurynews.com/2025/03/07/san-jose-logitech-bay-area-tech-jobs-economy-silicon-valley-computer/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://www.prnewswire.com/news-releases/figure-raises-675m-at-2-6b-valuation-and-signs-collaboration-agreement-with-openai-302074897.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://therealdeal.com/san-francisco/2025/03/07/super-micro-to-forge-ahead-with-north-san-jose-tech-campus/",
      "https://therealdeal.com/national/phoenix/2025/03/12/kenco-takes-up-642k-sf-warehouse-outside-phoenix/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/habitus-capital-nabs-approval-for-61-key-edgewater-hotel/",
    "title": "Habitus scores approval for 61-key hotel in Miami’s Edgewater, ramping up its South Florida hospitality investment",
    "subhead": "Renderings show the planned eight-story project to be branded by Sonder",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 17, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-17T15:30:00",
    "content": "Habitus Capital scored approval for a 61-key boutique hotel in Miami’s Edgewater, marking the firm’s continued investment in South Florida’s hospitality market.\nBrickell-based Habitus plans the eight-story building on a 0.2-acre lot at 459 Northeast 25th Street with 20 on-site parking spaces and two street parking spaces, according to a Miami City Commission agenda item. Renderings show the Sonder hospitality firm branding the project.\nCommissioners unanimously voted for the project at their meeting on Thursday. The resolution grants exceptions to Miami’s zoning code, allowing Habitus to develop half the required parking spaces and 10 percent less than mandated open space. Also, the vote allows a 10 percent reduction in the façade’s length.\nThe development firm paid $2 million for the 0.2-acre site in 2022, according to property records. The property now has a two-story, three-unit apartment building.\nHabitus –– led by Mauricio Magaña, Daniel del Rio and Pablo Ramos –– has developed more than 20 projects in Mexico City and now is focused on South Florida, its website shows.\n\nIt has at least two other hotel investments in the tri-county region.\nIn Miami’s Brickell, it plans an\neight-story, 40-key hotel\nat 511 Southwest Second Avenue. In August, Habitus paid\n$16.2 million\nfor the six-story, 110-key B&amp;B Hotel Miami Airport at 5125 Northwest 36th Street in Miami Springs.\nElsewhere in\nEdgewater\n, a\nhotel\ncould be in the works for the site at 2501 Biscayne Boulevard. Last year, New York hotel developer Harry Gross’ G Holdings bought the property for\n$28.5 million\n. Also last year. Peruvian developer William Ticona paid\n$15.1 million\nfor a 0.8-acre vacant property at 404- 436 Northeast 35th Street in Edgewater, which could be developed with 248 hotel keys under current zoning.\nIn other recent hotel proposals, Stephen Palmese’s Integritas Capital proposes a 57-story tower with 550 apartments and a\n253-key hotel\nat 111 Southwest Third Avenue in Fort Lauderdale.\n",
    "related_links": [
      "https://therealdeal.com/miami/2023/10/24/habitus-capital-scores-approval-for-40-key-brickell-hotel/",
      "https://therealdeal.com/miami/2024/08/09/bb-hotels-mhg-hotels-buy-separate-south-florida-properties/",
      "https://therealdeal.com/tag/edgewater/",
      "https://therealdeal.com/tag/hotels/",
      "https://therealdeal.com/miami/2024/01/19/infinity-sells-miami-dev-site-to-harry-gross-g-holdings/",
      "https://therealdeal.com/miami/2024/11/01/peruvian-developer-william-ticona-buys-edgewater-dev-site/",
      "https://therealdeal.com/miami/2025/03/04/integritas-capital-plans-fort-lauderdale-hotel-rentals-tower/",
      "https://therealdeal.com/miami/2025/02/19/wills-partners-launch-sales-for-islamorada-resort-villas/",
      "https://therealdeal.com/miami/2025/02/18/keyah-real-estate-group-gains-approval-for-new-miami-beach-hotel/",
      "https://therealdeal.com/miami/2025/02/12/wynwoods-moxy-hotel-secures-new-partner-and-36m-loan/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-17T19:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/17/dallas-mushroom-house-at-risk-under-car-dealers-ownership/",
    "title": "Highland Park “Mushroom House” at risk under Clay Cooley ownership",
    "subhead": "Car dealer and wife bought iconic property, two adjacent historic homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:20 PM",
    "pub_date_dt": "2025-03-17T15:20:00",
    "content": "The future of Dallas’ iconic “Mushroom House” is uncertain after car dealer Clay Cooley acquired the home along with two adjacent Highland Park properties, sparking speculation about potential teardowns.\nThe house at 4200 Armstrong Parkway, known for its curved design and green-blue copper roof, is one of three multimillion-dollar mansions Cooley and his wife, Lisa, own at Armstrong Parkway and Bordeaux Avenue, The Dallas Morning News\nreported\n. The other two are at 4208 Armstrong Parkway and 4209 Bordeaux Avenue.\nThe couple’s plans for their 2.5 acres of prime properties are a mystery. They haven’t commented, but it’s led to questions about whether the unique home, and the historic residences next to it, will survive or be cleared to make way for new construction.\nThe Cooleys haven’t filed any demolition or major renovation permits, though plumbing and mechanical permits were submitted for two of the properties. Preservationists are hopeful that at least the 1920s Tudor-style home on Bordeaux, designed by famed architect Hal Thomson, will be spared.\nThe group Preservation Park Cities recently toured two of the homes but wasn’t allowed inside 4208 Armstrong Parkway due to structural concerns.\nClay Cooley attended a Preservation Park Cities meeting in February, where he expressed a desire to avoid community conflict. Preservationists suggested a design that would retain the Bordeaux home as a guesthouse while allowing for a new build on the Armstrong lots.\n\nThe couple bought the home at 4208 Armstrong Parkway first, in 2020, county records show. They then purchased 4209 Bordeaux Avenue and the Mushroom House in a five-month period, transferring them into their name by December 2024.\nThe Mushroom House, completed in 1997 by Dallas architect Tom Workman, has long divided opinion for its whimsical, storybook-like design. Its price history is unavailable, but its market value is estimated at over $7.5 million, according to Zillow.\nPreservationists admit that while the house is architecturally significant, it may be less defensible due to its modern construction and location on a highly visible lot.\nLocal ordinances also complicate the equation. Highland Park rules prohibit combining all three parcels into a single lot, which could influence Cooley’s final decision.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/real-estate/2025/03/13/dallas-car-man-snaps-up-three-highland-park-mansions-but-his-plans-remain-unclear/",
      "https://therealdeal.com/",
      "https://therealdeal.com/texas/dallas/2025/02/21/home-in-dallas-preston-hollow-listed-for-13-7-million/",
      "https://therealdeal.com/texas/dallas/2025/01/06/dallas-most-expensive-home-listings-of-2024/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 19:20:34 +0000",
    "published_dt": "2025-03-17T19:20:34+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/whats-smaller-than-a-bungalow-small-lot-homes-on-melrose/",
    "title": "What’s smaller than a bungalow in East Hollywood?",
    "subhead": "Aaron Belliston-led affiliate plans to convert century-old apartments into small-lot homes on Melrose",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-17T15:00:00",
    "content": "Melrose Ten wants to turn century-old bungalow apartments in East Hollywood into single-family homes and a duplex.\nThe North Hollywood-based limited liability company led by Aaron Belliston has filed plans to convert the 1920s bungalow court at 4061-4069 West Melrose Avenue,\nUrbanize Los Angeles reported\n. No demolition or new construction are in the works.\nInstead, the owner of the property wants to convert the historic bungalows into single-family homes through a Los Angeles small lot subdivision ordinance.\nThe application said the Belliston affiliate wants to create nine single-family homes and one duplex, not far from Vermont Avenue and Los Angeles City College.\nThe potential increase in value to the property was not disclosed. It’s also not clear when the Belliston affiliate bought the property, and for how much.\n\nThe bungalow court, built in 1923 on a third of an acre in Virgil Village, was once listed for $211,500 per unit, or $2.1 million, according to a 2023 Marcus &amp; Millichap\nmarketing brochure\n.\nAnother small lot subdivision has been\nproposed nearby at 627 North Juanita Avenue\n, where Scott Barth of Barth Partners plans to build 10 townhomes on a vacant lot, according to Urbanize.\nBelliston is president of BMR Enterprises, a vertically integrated real estate firm based at the same North Hollywood address as Melrose Ten, according to state business records.\nMembers of the Melrose Ten LLC include Encino-based Bow Hunter Development, Prosper Fund, based in North Hollywood and Mark Priceman of Valley Village.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/bungalow-court-4061-w-melrose-ave-be-converted-small-lot-homes",
      "https://app.box.com/s/v556o0mu5bfqzzwof8us2dqjzdzgi7qy",
      "https://la.urbanize.city/post/10-townhomes-planned-627-n-juanita-avenue-east-hollywood",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/11/14/advanced-properties-eyes-51-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/12/20/category-plans-145-affordable-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/10/07/nba-stars-pitch-affordable-housing-in-east-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-17T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/chicagos-tax-assessor-corrects-massive-undervaluation/",
    "title": "Cook County corrects tax roll error after $444M undervaluation",
    "subhead": "Assessor reclassified hundreds of properties, owners hit with steep back taxes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:33 PM",
    "pub_date_dt": "2025-03-17T14:33:00",
    "content": "Cook County Assessor Fritz Kaegi has fixed hundreds of property misclassifications after a months-long audit, but questions remain over how many errors are still unresolved.\nAt least 620 properties were\nmisclassified or undervalued\nduring the 2023 tax year, resulting in an estimated $444 million in missed taxable value.\nThe assessor’s office has since corrected 491 of those errors, adding nearly $489 million in taxable value to county rolls — about 17 percent of the new construction value added countywide in 2023, the Chicago Tribune\nreported\n. An investigation by Illinois Answers and the outlet reported the misclassified properties last year.\nStill, 129 properties identified in the investigation remain incorrectly classified, with fixes delayed due to a backlog at the Cook County Board of Review and what Kaegi’s office described as “quirks in the tax calendar.”\nThe office also blamed inconsistent permit data from local municipalities as a key factor behind delayed corrections.\nThe misclassifications carried major financial consequences.\nSome homeowners, like those in suburban Lynwood, have already received back tax bills as high as $23,000 after belated reassessments. State law allows for up to three years of back taxes, though Kaegi’s office maintains that it won’t issue back taxes in cases where it failed to act on construction permits it had on file.\nIn 46 out of 55 back-taxed cases, Kaegi’s office did have relevant permit information, but missed it.\n\nMany affected properties were either new construction or had undergone significant renovations, but the assessor’s records failed to reflect those changes. In some cases, properties were still being taxed based on outdated classifications.\nFor instance, a home in Gilmore Park built in 2021 and sold for $843,000 continued to be assessed as a vacant lot, with its value listed at less than $45,000.\nKaegi’s office has since hired a dozen more staffers, including two permit specialists and 10 field inspectors, and promoted a veteran staffer to oversee data integrity. The office also plans to launch a sales validation team this year to help catch discrepancies, such as multimillion-dollar sales on properties incorrectly recorded as vacant.\nKaegi is pushing for broader systemic changes.\nLast week, he\ncalled on the Federal Housing Finance Agency\nto release appraisal data from Fannie Mae and Freddie Mac to local assessors. Kaegi argued that access to this data —\ncurrently restricted\n— would help improve the accuracy of property assessments, particularly in addressing long-standing issues like regressivity, where lower-value homes are often over-assessed relative to their market value. His office released a public dataset on Monday morning with building permits submitted to the office by municipalities, another bid to bring transparency to the process.\nCritics argue the long delays and lingering errors undermine confidence in Cook County’s property tax system — especially when homeowners can be hit with massive, unexpected tax bills for mistakes they had no hand in.\nKaegi’s office is reviewing the 46 back tax bills for errors, as delays in delivering the permits to the assessor’s office can slow its ability to make corrections, a spokesperson said.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://www.chicagotribune.com/2025/03/16/cook-county-assessor-fixing-mistakes-misclassified-properties/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/",
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 18:33:56 +0000",
    "published_dt": "2025-03-17T18:33:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
    "title": "Dallas makes last-ditch pitch to keep Neiman Marcus downtown",
    "subhead": "City manager tells parent company that “financially beneficial” offer is on the table",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:26 PM",
    "pub_date_dt": "2025-03-17T14:26:00",
    "content": "Dallas officials are mounting a last-ditch effort to stop the clock on Neiman Marcus’ closure of its downtown flagship store at 1618 Main Street.\nCity Manager Kimberly Bizor Tolbert and the Dallas Consortium, a coalition of city and business leaders, requested a meeting with executives from the brand’s parent company, Saks Global, within the next week to pitch their plan, The Dallas Morning News\nreported\n.\nThe letter, addressed to Saks Executive Chairman Richard Baker, said the city has crafted a “financially beneficial” offer that would support both Neiman Marcus’ brand and its ties with Texas clientele.\nSaks, which acquired Neiman Marcus last year for $2.7 billion, previously\nannounced the store’s closure\nby March 31, citing a dispute with landlord Slaughter Partners as a barrier to remaining open. But earlier this month, Dallas officials resolved that problem by securing the deed for the disputed portion of the property.\nThe company, however, has held firm, stating the\ndecision to close is “final”\nand that the situation is “far more complicated than what the public is being led to believe.” Saks has also said its attempts to meet with city officials have been rejected.\n\nIt remains uncertain whether the city’s proposed deal is enough to prompt reconsideration, or even a temporary extension of operations. Tolbert’s letter asked for a response to “the collective group,” and said Neiman Marcus would have time to “capture the opportunity we wish to discuss” if the company keeps the store open for a few months longer.\nAlong with the store, Neiman Marcus also plans to vacate its 82,000-square-foot headquarters in NexPoint’s 42-story Cityplace Tower at 2711 North Haskell Avenue.\nThe looming closure threatens to leave a major gap in the city’s downtown retail landscape and in the historic character of Dallas. Neiman Marcus has operated its flagship store for more than a century, serving as an anchor for the district’s identity and economic activity.\nThe consortium is holding out hope of avoiding the significant loss to the city’s downtown core, while Saks is investing $100 million into its Neiman Marcus store at NorthPark Center.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/14/dallas-dangles-financially-beneficial-opportunity-to-keep-neiman-marcus-downtown/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/dallas/2022/07/29/neiman-marcus-corporate-hub-project-lands-at-cityplace-tower/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 18:26:41 +0000",
    "published_dt": "2025-03-17T18:26:41+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/17/government-reverses-hundreds-of-lease-terminations/",
    "title": "You’re (not) fired: Government reverses hundreds of lease terminations",
    "subhead": "Why the Trump admin is tweaking its office downsizing plan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:09 PM",
    "pub_date_dt": "2025-03-17T14:09:00",
    "content": "At first, the federal government met resistance in\ncutting\nits real estate footprint. In more than 100 cases, it’s reversing its planned terminations.\nThe General Services Administration, which manages the government’s real estate holdings, is backtracking on the cancellation of 117 leases, the New York Times\nreported\n. Among the spaces getting a reprieve are an Energy Department office in New Mexico that manages a nuclear waste repository and an office used by the U.S. Army Corps of Engineers for hurricane response in Florida.\nLawmakers and agency officials have worked to slow or stop lease terminations, expressing worry about vital functions and the government’s own return-to-office mandate. One lawmaker in Oklahoma worked directly with Donald Trump’s administration and Elon Musk’s Department of Government Efficiency to salvage several agency offices in the Sooner State.\nMore leases are still being canceled than saved from the scrap heap. The GSA has sent out 827 termination notices since the start of Trump’s second term and only the 100-plus letters rescinding said notices, according to the agency.\n\nThe reversals are adding more confusion to the post-inauguration chaos in federal government-related real estate. For instance, Musk’s team has already claimed that it cut 793 leases and is saving the country approximately $500 million annually. But those lease cancelations don’t match the GSA’s termination notices, and officials aren’t providing updated lists on what deals are canceled and where. Three leases in Oklahoma supposedly saved from the chopping block still appear on the DOGE website of canceled leases.\nThere’s also the “non-core” asset inventory posted by the GSA two weeks ago. The agency documented 443 properties seemingly “designed for disposal” by the federal government, only for the inventory to disappear the following day; it has yet to reappear.\nThe inventory spanned nearly 80 million square feet of rentable space across the country. The GSA forecasted more than $430 million of annual operating cost savings if the entire inventory were to be offloaded.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://www.nytimes.com/2025/03/17/us/politics/musk-doge-lease-terminations.html",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/philadelphia/2025/03/06/philadelphia-buildings-on-gsa-disposal-list/",
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://therealdeal.com/national/2025/01/21/federal-government-could-sell-two-thirds-of-office-portfolio/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 18:09:26 +0000",
    "published_dt": "2025-03-17T18:09:26+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/canada-global-flow-nab-51m-loan-for-el-portal-dev-site/",
    "title": "Adam Neumann’s Flow nabs $51M loan for $71M El Portal site purchase, partners with Canada Global on mixed-use development",
    "subhead": "After winning court auction for 16 acres, Adam Neumann’s firm formed JV to develop project with 2,380-plus apartments",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 17, 2025, 1:46 PM",
    "pub_date_dt": "2025-03-17T13:46:00",
    "content": "Adam Neumann’s Flow nabbed a $51 million acquisition loan and is partnering with Canada Global for a planned mixed-use project on an El Portal development site.\nNew York-based Ladder Capital provided the mortgage to a Delaware entity with ties to Flow that paid\n$71.5 million\nfor a 16-acre former trailer park at 8500 Biscayne Boulevard, records show.\nCanada Global\n, an Israeli real estate firm led by Assaf Tuchmair and Barak Rosen, came on board as a majority partner shortly after Miami-based Flow won a January court auction for the vacant property, a source familiar with the joint venture told\nThe Real Deal\n. In November, the two firms also partnered to purchase an Aventura office complex for\n$116.2 million\n.\nOn the El Portal site, the joint venture is planning to build 2,380-plus apartments with commercial space and a school, the source said. Approved for a 3 million-square-foot mixed-use project with 150 units per acre, a developer can build up to roughly 2,400 apartments.\n\nThe site, previously known as the Little Farm trailer park, has sat empty since 2016 when 45 residents settled a lawsuit with the village of El Portal and the previous ownership entity, led by Fu Jing “Leo” Wu. The Village and Wu’s entity agreed to pay the residents $8,000 each for relocation costs. Wu also managed an entity that owned a former federal immigration building at 7880 Biscayne Boulevard in Miami.\nThe trailer park site and the immigration building landed in court receivership as a result of a 2020 Miami-Dade civil lawsuit alleging Wu’s entities misappropriated funds from\nEB-5 visa investors\n. The federal program grants permanent residency to foreign investors who finance business and real estate development projects in the U.S., as well as their immediate family members.\nIn 2023, receiver Michael Goldberg entered into a settlement agreement with Wu that allowed the sale of the properties to move forward without Wu’s objections. Upon both deals closing, Wu will receive $5 million from the sale proceeds. In 2023, Miami-based B Group Capital Management bought the immigration building for\n$23 million\n, but abandoned plans to also buy Little Farm.\nIn October, Miami-based Melo Group submitted a\n$35 million\nstalking horse bid for the 16-acre trailer park. During the court auction two months ago, Melo lost a bidding war to Flow by $400,000.",
    "related_links": [
      "https://therealdeal.com/miami/2025/01/21/adam-neumanns-flow-wins-el-portal-dev-site-with-71m-offer/",
      "https://therealdeal.com/company/canada-global/",
      "https://therealdeal.com/miami/2024/11/25/adam-neumanns-flow-canada-global-buy-aventura-offices/",
      "https://therealdeal.com/miami/2020/11/17/questions-surround-50m-in-eb-5-investments-tied-to-former-ins-building-lawsuit/",
      "https://therealdeal.com/miami/2023/05/16/b-capital-pays-23m-for-miamis-former-immigration-building/",
      "https://therealdeal.com/miami/2024/10/23/melo-group-bids-35m-for-el-portal-dev-site/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 17:46:15 +0000",
    "published_dt": "2025-03-17T17:46:15+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/jct-management-sells-dania-beach-offices-to-triarch-for-18m/",
    "title": "Triarch, partners buy Dania Beach’s Airport Commerce Park for $18M, amid a South Florida office market paradox",
    "subhead": "Purchasing entity also ties to Sarah and Sergio Selcer",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 17, 2025, 1:38 PM",
    "pub_date_dt": "2025-03-17T13:38:00",
    "content": "A group of investors bought Airport Commerce Park near Fort Lauderdale-Hollywood International Airport for $18.3 million.\nThe deal comes amid a paradox for South Florida’s office market. While aging suburban buildings have traded at discounts and\nforeclosures\nhave popped up, Broward County recently scored two office deals for over $200 million each.\nAn entity managed by Jorge Linkewer, principal at Aventura-based Triarch Capital Group, as well as Sarah and Sergio Selcer bought the complex at 4101 Ravenswood Road in Dania Beach from ACP Partners, according to records and real estate database Vizzda.\nSergio Selcer is associated with Step by Step Management in Coconut Creek. ACP is managed by Mario Henriquez and affiliated with Brickell-based JCT Management, according to Vizzda and state corporate records.\nThe buyers borrowed $10.3 million from Popular Bank.\nCompleted in 1987, Airport Commerce Park consists of four one-story buildings on a 6.6-acre site, property records show. ACP Partners paid $13.3 million for the property in 2007.\nTenants include computer repair service Rescuecom of Fort Lauderdale, Ocean Exotic Car Rental, Precision Air Conditioning, Digital Marketing Service Pro and the Consulate of Sweden.\n\nTriarch, founded in 1996 by Linkewer, Daniel Halberstein and Mario Grosfeld, has a portfolio of about 3.5 million square feet of commercial real estate, according to its website. Linkewer also is founder of brokerage Axiom Capital Advisors, which lists the same Aventura office as Triarch.\nTriarch is a frequent South Florida investor. In 2023, it bought the Shoppes at 41st Street plaza at 10355 and 10405 Northwest 41st Street in Doral for\n$18 million\n. That came on the heels of Triarch’s\n$7.2 million\npurchase of an industrial outdoor storage site at 12601 West Okeechobee Road in Hialeah Gardens.\nIn 2020, the firm scored a\n$35 million\nrefinancing for the One Turnberry Place office building at 19495 Biscayne Boulevard in Aventura, which Triarch bought in 2011 for $53 million.\nIn the fourth quarter, South Florida\noffice\nvacancies and asking rents\nremained flat or slightly increased\n, year-over-year, according to an Avison Young report. Broward County’s average asking rent hit $40.18 per square foot, up from $38.34 a square foot during the same period of 2023. The vacancy rate fell to 14.5 percent from 16.8 percent. But in all of last year,\nBroward’s\ntotal leasing was 2.4 million square feet, a 27 percent decline from 2023, the Avison report shows.\nGenerally, real estate has felt the sting from higher interest rates, skyrocketing insurance and a slowdown of the influx of out-of-state companies, experts have said.\nSome properties have traded at a discount. In September, Galium Capital bought the Lake Shore Plaza II office building at 1300 Concord Terrace in Sunrise for\n$17 million\n, a nearly 47 percent discount from its price in 2013. In January, Accesso Partners bought the six-story Sawgrass Lake Center at 13450 West Sunrise Boulevard in Sunrise for\n$36.5 million\n, a 36.4 percent discount from its price in 2018.\nStill, downtown Fort Lauderdale scored two mammoth deals. Last month, DWS Group sold the  Las Olas Centre I &amp; II at 350 and 450 East Las Olas Boulevard for\n$208 million\n, and the  Bank of America Plaza at Las Olas City Centre at 401 East Las Olas Boulevard for\n$220 million\n.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/11/18/fred-karlton-wins-foreclosure-judgment-for-miami-building/",
      "https://therealdeal.com/miami/2023/03/22/triarch-capital-picks-up-doral-retail-plaza-for-18m/",
      "https://therealdeal.com/miami/2023/02/03/hialeah-gardens-industrial-site-trades-at-1m-acre-as-market-softens/",
      "https://therealdeal.com/miami/2020/05/13/triarch-capital-scores-35m-refinancing-for-one-turnberry-place/",
      "https://therealdeal.com/tag/south-florida-office-market/",
      "https://therealdeal.com/miami/2025/01/22/south-florida-office-market-holding-steady/",
      "https://therealdeal.com/tag/broward-county/",
      "https://therealdeal.com/miami/2024/09/26/galium-capital-pays-17m-for-sunrise-office-building/",
      "https://therealdeal.com/miami/2025/01/14/foundry-sells-sunrise-offices-at-discount-to-accesso/",
      "https://therealdeal.com/miami/2025/02/13/dws-sells-las-olas-centre-i-ii-to-bradford-allen-for-208m/",
      "https://therealdeal.com/miami/2025/02/14/lone-star-funds-highline-square2-buy-fort-lauderdale-tower/",
      "https://therealdeal.com/miami/2025/01/13/terranova-gildenson-triarch-capital-apollo-score-tenants/",
      "https://therealdeal.com/miami/2025/02/14/avison-young-panel-dishes-on-south-florida-office-market/",
      "https://therealdeal.com/miami/2024/10/10/varde-files-foreclosure-against-coral-gables-office-owner/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 17:38:48 +0000",
    "published_dt": "2025-03-17T17:38:48+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/national/las-vegas/2025/03/17/oikos-advances-22-unit-affordable-apartment-complex-in-vegas/",
    "title": "Oikos advances 22-unit affordable apartment complex in Las Vegas",
    "subhead": "Planning Commission gives thumbs up despite strong pushback from Historic Westside neighbors",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-17T13:30:00",
    "content": "Oikos Development Nevada has moved forward with plans to build a 22-unit affordable housing complex in west Las Vegas, despite strong pushback from neighbors.\nThe Henderson-based affordable housing developer was unanimously approved by the Las Vegas Planning Commission to build the four-story building at the northwest corner of Van Buren Avenue and F Street, in the Historic Westside,\nthe Las Vegas Review-Journal reported\n.\nNeighbors had turned out to oppose the 51-foot-tall project, raising concerns over lack of parking, increased traffic, lower property values and overcrowding. One woman who lives directly behind the project said it would “result in a loss of privacy.”\nDespite the opposition, the project known as Westside Flats was approved and will be heard by the City Council on April 16. It will replace a one-third acre vacant lot owned by the city.\nPlans call for 22 one- to three-bedroom apartments from 622 square feet to 1,055 square feet, with a rooftop deck with barbecues, a children’s playground and picnic tables.\n\nThe apartments would be for households earning between 30 percent and 50 percent of area median income. Monthly rents would range from $442 to $1,051.\nThe $6.5 million gray, charcoal and periwinkle project, designed by Nadel Architects, aligns with the city’s Hundred Plan by boosting the number of homes, housing density, affordability and availability, according to the nonprofit developer.\nOikos Development Nevada is a unit of Kansas City-based Oikos Development, founded in 2018 by Michael Snodgrass, according to its website and\nClark County meeting records\n. The firm has developed more than 500 affordable apartments in Nebraska, Missouri, Kansas, Florida and Nevada.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.reviewjournal.com/business/proposed-historic-westside-apartment-project-receives-opposition-from-neighbors-3319140/?utm_campaign=widget&utm_medium=latest&utm_source=homepage&utm_term=Proposed%20Historic%20Westside%20apartment%20project%20receives%20opposition%20from%20neighbors",
      "https://webfiles.clarkcountynv.gov//CDAC%20minutes%201.17.23%20FINAL.pdf",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/las-vegas/2025/03/11/southern-land-cedar-street-bridge-go-big-in-las-vegas/",
      "https://therealdeal.com/national/las-vegas/2025/02/27/musks-boring-company-pitches-apartments-by-las-vegas-loop/",
      "https://therealdeal.com/national/las-vegas/2025/02/05/las-vegas-enters-top-10-luxury-market-list-beating-out-la/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-17T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/can-mayor-karen-bass-suspend-measure-ula-to-help-la-rebuild/",
    "title": "Bass says she wants to pause Measure ULA. Is she allowed?",
    "subhead": "City’s “Mansion Tax” could make it harder for fire victims to rebuild",
    "authors": "ByAbigail Nehring",
    "pub_date": "Mar 17, 2025, 1:02 PM",
    "pub_date_dt": "2025-03-17T13:02:00",
    "content": "Los Angeles Mayor Karen Bass has apparently grown cool toward Measure ULA.\nThe mayor said there’s cause to temporarily suspend the city’s two-year-old “Mansion Tax” and might try to do so herself, if she can find a way.\n“Maybe temporarily — we’re looking into that,” Bass told a\nBreitbart\nreporter\nin a press conference last Tuesday\n. “There’s two schools of thought. One is, that can’t happen. It has to go back to voters. And the other is that it might be able to happen with action from the council and the mayor’s office.\n“We’re having that investigated through our attorneys right now,” Bass said.\nShe hasn’t spoken further about the topic since.\nZach Seidl, the mayor’s communications deputy, didn’t answer specific questions from\nThe Real Deal\nabout Bass’ plans, but said in a statement to\nThe Real Deal\nFriday, “we are going to look at every possible option to support fire survivors and accelerate recovery.”\nIt’s unclear how the mayor or City Council could defy the results of the local ballot measure, which went into effect in 2023 and imposes a 4 percent tax on property sales above $5 million and a 5.5 percent tax on sales over $10 million.\n\nThe\nCity Charter states\nthat ballot measures can be overturned by voters in a subsequent election or by amending the City Charter to supersede the ballot measure.\nA spokesperson for L.A. City Attorney Hydee Feldstein Soto did not immediately respond to a request for comment.\nMeasure ULA aimed to raise up to $1.1 billion in tax revenue to fight homelessness and build affordable housing. It has so far fallen far short of that goal, raising\nabout $300 million in its first year on the books\n.\nFewer than 5 percent of deals meet the threshold to be subject to the tax, but historically they account for about 40 percent the city’s total property tax revenue, according to an analysis by Mott Smith, a founding member of the Council of Infill Builders and adjunct professor at the USC Price School of Public Policy.\nDuring her 2022 campaign for mayor, Bass\nnever took a stance supporting\nthe ballot measure, but she\napplauded a court ruling\ndismissing a lawsuit against it the following year.\nAnd later that year the former deputy mayor for housing took some heat saying real estate investors were having “\na bit of a temper tantrum\n” about the transfer tax, as\nTRD\npreviously reported.\n",
    "related_links": [
      "https://www.breitbart.com/politics/2025/03/11/l-a-mayor-karen-bass-says-city-considering-suspending-measure-ula-tax-to-help-rebuilding/",
      "https://youtu.be/EVJzGokdfAY?si=yUi6lLdDNsTb5z0p&t=746",
      "https://codelibrary.amlegal.com/codes/los_angeles/latest/laac/0-0-0-1863",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://www.latimes.com/california/story/2022-09-30/mansion-tax-la-ballot-measure",
      "https://mayor.lacity.gov/news/mayor-bass-city-attorney-hydee-feldstein-soto-and-la-housing-department-applaud-decision",
      "https://therealdeal.com/la/2023/11/01/la-deputy-mayor-recalls-temper-tantrum-on-measure-ula/",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://therealdeal.com/la/2024/04/16/las-mayor-bass-asks-the-wealthy-to-pay-for-homeless-housing/",
      "https://therealdeal.com/la/2024/06/20/ballot-measure-to-overturn-ula-struck-down-by-court/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 17:02:13 +0000",
    "published_dt": "2025-03-17T17:02:13+00:00",
    "author": "Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/17/ryan-serhant-expands-out-west/",
    "title": "Ryan Serhant expands west",
    "subhead": "Founder’s eponymous brokerage opens first outpost in Arizona with 50 agents",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 17, 2025, 10:33 AM",
    "pub_date_dt": "2025-03-17T10:33:00",
    "content": "Ryan Serhant is heading out West.\nThe celebrity agent’s eponymous brokerage is setting up shop in Arizona with more than 50 agents in Phoenix. The move marks the firm’s first foray away from the East Coast, where it’s been steadily expanding since 2023.\nThe expansion “has been an organic journey, not a race to be the biggest or the fastest for the sake of being big, or fast,” the firm’s founder and CEO wrote in a statement. “Our focus is on aligning with people who share our vision, and are committed to pushing boundaries.”\nAmong the new brokers are six founding agents and Todd Lee, designated broker for the region. Together, the agents notched more than half a billion in sales last year. The firm’s Western operation is launching with about 100 listings, including a five-bedroom home in the Scottsdale desert asking $4.9 million.\n“I wanted to try something different,” said Linda Salkow, one of the agents joining the firm.\nSalkow, whose listings include a $2.8 million home in Scottsdale, pointed to Serhant’s technology platform known as S.MPLE and the founder’s eye for social media and marketing as the reason for her move from a local Berkshire Hathaway HomeServices, where she spent nearly a decade as a top producer.\n“The real estate industry is changing. Everything in life is changing,” Salkow said. “We have to stay on top of it, and Serhant has a great feel for that.”\n\nWith the Arizona teams now in the fold, Serhant has more than 1,000 agents across nine states, including the Carolinas, Florida, New Jersey and Connecticut. The brokerage’s latest additions include a\n10-person team\noperating in the Hudson Valley, Westchester and Connecticut’s Fairfield and Lichfield counties.\nThe firm’s competitors have pushed back against Serhant’s moves along the East Coast, with some brokerages filing lawsuits against the firm for allegedly poaching their agents and stealing confidential information.\nSerhant notched a win in his legal battle for more territory in November, when\na judge dismissed\na $10 million lawsuit tied to its spread into Pennsylvania.\nKeller Williams Black Label and its parent company, Condo Shop, sued the brokerage and its founder in April 2023, alleging Serhant tried to “loot” the firm. A Philadelphia judge rejected the companies’ arguments, citing its inability to prove it sustained damages following its agents’ departure.\nSerhant, once a mainstay on Bravo’s “Million Dollar Listing New York,” launched his brokerage in 2020 and quickly established it as one of the top-producing firms in New York City. Last year, the company placed sixth among brokerages in Manhattan with $580 million in sales, according to\nThe Real Deal’s\n2023 ranking\n.\nSince its founding, the brokerage, bolstered by revenue from Serhant’s coaching business, Sell It, starred in a\nreality TV show\ncalled “Owning Manhattan,” which aired its first season on Netflix last summer. The firm also notched $45 million in\nventure capital funding\ngeared toward developing its artificial intelligence-powered technology.\nNetflix greenlit Season 2 of the series focused on the brokerage, according to Serhant. Filming last week and new episodes will air in the summer\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2024/10/11/serhant-expands-to-hudson-valley/",
      "https://therealdeal.com/national/2024/11/04/serhant-wins-lawsuit-over-pennsylvania-expansion/",
      "https://therealdeal.com/magazine/march-2024/ranking-nycs-top-brokerages-of-2023/",
      "https://therealdeal.com/national/2024/08/27/netflix-renews-owning-manhattan-for-season-two/",
      "https://therealdeal.com/magazine/january-2025/with-commission-revenue-in-question-brokerages-seek-side-hustles/",
      "https://therealdeal.com/magazine/august-2024/can-ryan-serhant-scale-a-brokerage-built-on-his-personality/",
      "https://therealdeal.com/national/2024/11/04/serhant-wins-lawsuit-over-pennsylvania-expansion/",
      "https://therealdeal.com/national/2024/08/27/netflix-renews-owning-manhattan-for-season-two/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 14:33:52 +0000",
    "published_dt": "2025-03-17T14:33:52+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/16/relateds-jackson-square-development-moves-forward/",
    "title": "Related California goes from “contrarian” to conviction on Jackson Square hotel-office tower",
    "subhead": "Plus Ralph Lauren, Blue Bottle, Sweetgreen to open new SF locations, $32 million Jackson Square buy and more San Francisco real estate news",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 16, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-16T13:00:00",
    "content": "Jackson Square was the market to watch this week, as Related California explained how its one-time “contrarian bet” on developing a\n41-story office-hotel tower\nin the neighborhood has turned to firm conviction about the future of the enclave.\nRalph Lauren got in the mood, too, opening a Polo store there after shuttering two previous locations in the city, and\nBrick and Timber Collective\nclosed a $32 million deal with a Michelin-starred chef as a partner.\nRelated’s plans call for a 544-foot tower with 360,000 square feet of offices atop a five-star, 200-room hotel at 530 Sansome, plus a new firehouse at 447 Battery Street to replace a station overtaken by the project. A previous 19-story hotel and fitness club project, approved in 2021, stalled.\n“This started out as a contrarian bet but as we dug in deeper and looked at the market, how it is evolving and maturing out of Covid, it doesn’t seem so contrarian any more,” Gino Canori, president of Related California, told the San Francisco Chronicle.\nRelated hopes to secure approvals to build the tower this fall, allowing the firm to break ground by late next year. If all goes well, it could be completed by 2030.\nMichelin-starred chef, Ralph Lauren come to Jackson Square\nRestaurateur Peter Hemsley of Michelin-starred Aphotic\njoined forces\nwith developer Brick &amp; Timber, which keeps its headquarters in the neighborhood, to buy a 15,600-square-foot store and building at 530 Jackson Street for $32.4 million, or over $2,000 a square foot.\n\nHemsley announced last year he would shut Aphotic, blaming the SoMa location. It’s not clear whether the chef intends to revive the sustainable seafood restaurant or launch a new concept in the ground-floor space that was home to Kells Irish Restaurant and Pub for decades. Paul McAleese is the owner of Kells Irish Restaurant and Bar as well as the seller of 530 Jackson.\nJust down the street from 530 Jackson, Ralph Lauren opened its first new store in the city in years.\n“The opening of Polo Ralph Lauren in Jackson Square is a testament to the neighborhood’s growing appeal as a premier destination for retail,” Robbie Silver, CEO of the Downtown SF Partnership, said in a statement.\nSweetgreen, Blue Bottle sign long-term Mission Rock leases\nIn further retail news, Mission Rock developers Tishman Speyer and the San Francisco Giants announced\ntwo new long-term deals\nat their Mission Bay development. Blue Bottle Coffee and Sweetgreen have signed 10-year leases at Mission Rock and Arsicault bakery finally opened its doors in the development.\nOakland-founded Blue Bottle will occupy 2,069 square feet at the base of the building occupied by Visa at 300 Toni Stone Crossing. Salad-and-grain bowl shop Sweetgreen will take just under 2,400 square feet at the base of The Canyon, a residential tower at the intersection of Dr. Maya Angelou Lane and Toni Strone Crossing.\nAlex Sagues and Madeline Mandanis represented the landlords in the deal. Sagues called Mission Bay “the most vibrant neighborhood in San Francisco”. He said retailers are drawn to the transit-friendly area because “it is a true seven-day neighborhood,” with office, life sciences, residential, and the UCSF hospital, as well as events at Chase Center and Oracle Park.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/02/11/brick-timber-bullish-on-sf-office-despite-citys-policies/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/"
    ],
    "market": "San Francisco",
    "published": "Sun, 16 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-16T17:00:00+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/16/trump-tariffs-drive-up-housing-costs/",
    "title": "How Trump’s tariffs are reshaping real estate’s future",
    "subhead": "Administration’s trade policies add fuel to surging rents, stalled construction projects",
    "authors": "ByMike Romano",
    "pub_date": "Mar 16, 2025, 9:30 AM",
    "pub_date_dt": "2025-03-16T09:30:00",
    "content": "President Donald Trump’s second-term trade policies are shaking up the market in ways that landlords, developers and homebuyers can’t afford to ignore. From surging rents to stalled construction projects, the impact of tariffs is rippling through the industry.\nThe uncertainty surrounding Trump’s tariffs and economic policies is pushing potential homebuyers to the sidelines, and that hesitation is driving\nrental prices to record highs\n.\nIn New York City, Manhattan’s median rent hit a fresh high of $4,500 in February — its highest level since 2023. Brooklyn and Queens are feeling the pressure too, with Brooklyn rents averaging over $4,000 and Northwest Queens surpassing $3,400.\nChicago isn’t far behind. Downtown apartment rents just broke the $3,000 threshold for the first time ever, and with\nsupply cratering\ndue to high construction costs, developers are holding back — meaning rents are only expected to spike further in 2025.\nTenants are afraid to take the plunge into homeownership amid fluctuating mortgage rates and economic instability. The result is lower vacancy rates, more bidding wars and landlords with the upper hand. With summer around the corner, expect even higher rents in the months ahead.\nWhile mortgage rates have\ndipped\nsince Trump’s return to the White House, experts say the unpredictability surrounding his tariffs is outweighing any potential savings — causing some renters who once considered buying to think again.\nThe outlook for new homes isn’t any rosier, and homebuilders are\nscrambling\n.\nTrump’s tariffs on steel, aluminum and lumber imports are\ndriving up costs\n, forcing builders to get creative. Some are stockpiling materials, gambling that today’s prices are better than what’s to come. Others are shrinking floorplans or pivoting to modular construction. The National Association of Home Builders estimates these tariffs could add $7,500 to $10,000 to the\ncost of a new home\n.\nAnd in places like California, where developers are already dealing with fire recovery costs, the\nadded expense\ncould mean the difference between rebuilding and walking away from projects altogether.\nPoliticians and pundits are pointing fingers at Commerce Secretary Howard Lutnick as the\narchitect of Trump’s tariff strategy\n. While Trump’s unpredictability has long been a hallmark of his economic policy, the former Cantor Fitzgerald head’s mixed messaging is keeping investors and industry players on edge.\nIn Texas, where industrial development has been booming, big players like Ross Perot Jr. are considering baking “\ntariff clauses\n” into contracts to prepare for rising costs. Meanwhile, Citadel founder Ken Griffin isn’t\nmincing words\n— calling Trump’s trade policies a “huge mistake” that could cripple the economy.\nHuge mistake or not, the uncertainty and chaos surrounding Trump’s tariffs is certainly making it difficult to stay ahead of the curve.\nOutside of Trump’s tariffs, there was plenty of news this week. Mark Nussbaum is in the spotlight after allegations of missing funds, HomeServices of America denied reports that its subsidiaries are being acquired by Compass, and RXR and SL Green nabbed a modification on a $940 million loan.\n\nHow Mark Nussbaum went from transactional lawyer to escrow-funded dealmaker\nHigh-profile real estate attorney Mark Nussbaum is at the center of a\ngrowing scandal\nafter multiple lawsuits alleged millions of dollars went missing from his escrow accounts. Nussbaum’s web of connections includes real estate investors already entangled in federal mortgage fraud investigations, including indicted investors Moshe Silber and Boruch Drillman.\nHomeServices CEO denies Compass deal talks\nThe head of Berkshire Hathaway HomeServices called bull on a Wall Street Journal report claiming Compass was in “advanced talks” to\nacquire the firm\n. The move would have been a major step in what has become a 12-month period of rapid consolidation for Compass, the nation’s largest brokerage by deal volume.\nRXR, SL Green save $940M Worldwide Plaza loan from special servicing\nRXR and SL Green have secured a loan modification for the $940 million mortgage on\nWorldwide Plaza\nafter the departure of a major tenant sent the property into distress. The 825 Eighth Avenue office tower landed in special servicing last year after law firm Cravath, Swaine &amp; Moore vacated, wiping out nearly half of the building’s rent roll.\nElliman closes bumpy 2024 with $76M loss\nDouglas Elliman ended 2024 with a\n$76 million loss\n, up from $43 million in 2023, as it faced leadership changes, lawsuits and scrutiny. Despite the losses, the firm grew revenue to nearly $1 billion, while cutting expenses by $20 million as part of an ongoing cost-reduction strategy.\nFlorida bills aim to boost HOA and condo association oversight, ease structural integrity requirements\nThe Florida Legislature is considering bills that target two of the thorniest issues at condo and homeowners associations:\nalleged fraud and structural requirements\n. To combat fraud, this legislative session’s bills seek to introduce an investigations pilot program and expand the powers of state oversight agencies. Other bills deal with structural safety requirements imposed on condo associations following the deadly Champlain Towers South collapse in Surfside in 2021.\nBenedict Canyon site once set for Bulgari hotel hits market for $175M\nA megalisting priced at $175 million has hit the market in what’s been a\ndrawn-out saga\nfor a piece of Benedict Canyon once slated for a Bulgari-branded hotel. The 15-parcel listing located in Beverly Hills Post Office now ranks as the third-priciest property on the market within Los Angeles County.\n“Land speculation becomes problematic”: Chicago cracks down on more debtors\nThe city of Chicago is going after its\nmost problematic landowners\n. Goldmine Investments and QCD Financial follow a pattern of owners being pursued by a city task force that’s designed to pin down Chicago’s most indebted landowners. The two firms face millions in fines after buying up distressed properties, often vacant lots in disadvantaged neighborhoods, and allegedly letting them decay.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/13/nyc-rents-smash-new-record-in-february/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/national/2025/03/05/mortgage-rates-fall-to-three-month-low-mba/",
      "https://therealdeal.com/national/2025/02/19/homebuilders-post-election-confidence-wilts/",
      "https://therealdeal.com/national/2025/02/11/trumps-steel-aluminum-tariffs-to-hammer-homebuilders/",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/la/2025/01/31/trump-tariffs-could-jack-up-costs-for-building-materials/",
      "https://therealdeal.com/national/2025/03/12/howard-lutnick-blamed-for-trumps-tariff-chaos/",
      "https://therealdeal.com/texas/2025/02/21/ross-perot-jr-s-firm-bracing-for-trumps-tariffs-deportations/",
      "https://therealdeal.com/new-york/2025/02/12/ken-griffin-takes-donald-trump-to-task-on-tariffs/",
      "https://therealdeal.com/new-york/tristate/2025/03/10/mark-nussbaums-escrow-mess-explained/",
      "https://therealdeal.com/new-york/tristate/2025/03/10/mark-nussbaums-escrow-mess-explained/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/miami/2025/03/12/roundup-of-2025-florida-condo-association-hoas-bills/",
      "https://therealdeal.com/miami/2025/03/12/roundup-of-2025-florida-condo-association-hoas-bills/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/new-york/2025/03/13/nyc-rents-smash-new-record-in-february/",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/national/2025/03/12/howard-lutnick-blamed-for-trumps-tariff-chaos/"
    ],
    "market": "National",
    "published": "Sun, 16 Mar 2025 13:30:00 +0000",
    "published_dt": "2025-03-16T13:30:00+00:00",
    "author": "Mike Romano"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/16/how-chicago-landlords-raised-rents-past-new-milestone/",
    "title": "How Chicago landlords raised rents past new milestone",
    "subhead": "Plus, Salesforce Tower lands massive CMBS loan, the city cracks down on more negligent real estate debtors and more Chicagoland real estate news",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 16, 2025, 9:00 AM",
    "pub_date_dt": "2025-03-16T09:00:00",
    "content": "Chicago landlords are set up to strongarm rent hikes this year and beyond.\nLeases struck within a group of 84 downtown buildings tracked by brokerage Luxury Living\nsurpassed an average of $3,000 per month\nlast year for the first time ever. With new supply limited by developers grappling with higher interest rates and construction costs, landlords are projected to have the upper hand until 2027, the earliest that a significant wave of rental deliveries is expected.\nChicago’s top city lawyers are taking aim at the\nmost negligent property owners\n, and\nThe Real Deal\nis taking a look inside their plights.\nSuzie Wilson, dubbed the city’s “worst landowner” by public officials, is nearing a $11.5 million settlement that could also include\na ban from investing in Chicago property\n.\nThe settlement would resolve the nearly $50 million in debts and legal claims she’s estimated to owe the city, and she’s not alone. The city is ramping its pursuit of two more firms,\nGoldmine Investments and QCD Financial\n, that similarly assembled large portfolios of properties on the South and West sides through delinquent tax sales and racked up a combined $9 million in unpaid fines and interest owed to the city through allegedly neglecting their real estate.\n\nIn the office market, the recently stubborn CMBS spigot loosed up to\nrain down $610 million on the owners of the newly built Salesforce Tower\n, which includes Hines and Chicago-based Chris Kennedy’s famous political family. The deal replaces $549 million in construction debt.\nOn the other side of the financial spectrum,\nBeacon Capital Partners’ 190 North LaSalle Street\nwas listed for sale with Cushman &amp; Wakefield, and, like several of its fellow office buildings in the central Loop, has potential to fall short of its debt with its ultimate sale price.\nThe\nFarpoint-led team redeveloping the former Michael Reese Hospital site\nin Bronzeville released its vision for the Chicago Bears’ new stadium to be built on the land. While the NFL team hasn’t expressed any interest in the site as of yet, the developer is hoping to sway the team away from its previously announced plans to either build a new stadium just south of Soldier Field or outside of the city in Arlington Heights.\nOut in the suburbs, developer\nAdvent Properties scrapped a 278-unit Des Plaines\napartments project, investor\nZell Kravinsky paid $19.3 million\nto FPA Multifamily for a 63-unit Algonquin apartment complex and FPA Multifamily turned around and bought a\nbig Naperville apartment complex for $68 million\n.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/01/22/infamous-chicago-landlord-lists-bankruptcy-sale-of-over-800-lots/",
      "https://therealdeal.com/chicago/2025/03/10/chicago-plots-next-moves-against-suzie-wilson-more-negligent-landowners/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/03/14/farpoint-visualizes-chicago-bears-stadium-in-bronzeville/",
      "https://therealdeal.com/chicago/2025/03/14/advent-properties-withdraws-suburban-chicago-multifamily-plans/",
      "https://therealdeal.com/chicago/2025/03/14/zell-kravinsky-buys-suburban-chicago-apartments/",
      "https://therealdeal.com/chicago/2025/03/10/fpa-multifamily-buys-suburban-chicago-asset-via-assumable-debt/",
      "https://therealdeal.com/chicago/2025/03/08/digging-into-chicagos-biggest-brokers-and-builders/",
      "https://therealdeal.com/magazine/december-2024/back-at-it/"
    ],
    "market": "Chicago",
    "published": "Sun, 16 Mar 2025 13:00:00 +0000",
    "published_dt": "2025-03-16T13:00:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/15/prologis-mixed-use-play-could-add-new-life-to-arts-district/",
    "title": "Prologis project could breathe new life into DTLA’s Arts District",
    "subhead": "Plus, locals say they’re OK with restricting building in fire-prone areas, La Cañada Flintridge retreats on builder’s remedy pushback and more LA real estate news",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 15, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-15T12:00:00",
    "content": "Talk around downtown Los Angeles’ Art District isn’t as buzzy as it once was.\nA\nredevelopment project from Prologis\nthat’s expected to break ground in 2027 could help breathe new life into the conversation around the most directional of downtown’s neighborhoods, which is sandwiched between Skid Row and Boyle Heights.\nA new planning study by Prologis calls for a 9-acre entertainment campus at a former Greyhound bus station. The campus at 1716 East 7th Street includes 364,000 square feet of studio space, offices, production support facilities and parking.\nIf all goes as planned, the project will break ground in 2027 and be completed two years later.\nOnce done, it could help to create a critical mass of residential, office and retail uses at the intersection of Alameda and 7th streets. Prologis’ project is less than a half-mile walk to the\nRow DTLA retail and office complex\nor the recently opened Ava Arts District apartments, both located on Alameda Street.\nPoll finds support for building restrictions in fire-torn areas\nResults from a poll conducted by the Berkley Institute of Governmental Studies, co-sponsored by the Los Angeles Times, showed L.A. County residents were open to\nrestricting home building in fire-prone areas\n— to the tune of 70 percent of the nearly 5,200 registered voters surveyed between Feb. 17 and Feb. 26.\nMeanwhile, those same poll participants were a little more than halfway split down the middle on building higher-density projects, with 55 percent in support of said developments in urban areas.\nThe poll results call into question whether other cities in the county would be open to offsetting any housing shortage created should there be restrictions on building in fire-ravaged areas. In such a case, more time would no doubt be tacked onto efforts to quickly rehouse those who wish to return to homes damaged or destroyed by the fires.\nBuilder’s remedy claims another win, this time in foothills\nSticking with the subject of building, this week brought more news for housing proponents by way of builder’s remedy.\nA legal battle between a proposed mixed-use development and the\ncity of La Cañada Flintridge\nis over. City officials gave up fighting the project, which would have consisted of apartments, hotel rooms and over 7,300 square feet of office space at 600 Foothill Boulevard.\n\nDeveloper Cedar Street used the builder’s remedy loophole in state housing law to bypass city zoning requirements in exchange for including low-income homes. The city pushed back. However, a judge’s order to either pay a $14 million bond or back off resulted in the latter by the city.\nLa Cañada Flintridge is the latest example in a rising tension playing out publicly between state and local governments.\nResi’s whopping land listing\nIntrigue abounds around who might buy a\n$175 million, multi-parcel land listing\n.\nThe 33 acres, spread across 15 parcels in Benedict Canyon comes with a controversial past. Developer Gary Safady once aimed to build on site a Bulgari-branded hotel with 59 rooms, plus eight single-family residences ranging in size from 12,000 to 48,000 square feet.\nThe proposed project was axed in 2023 after then-planning director Vincent Bertoni caved to pressure from project critics and wrote a letter to Safady that called out project impacts well beyond what the city originally expected.\nSafady pulled a $30 million loan on the property from Motcomb Estates, the real estate investment arm for the Reuben Brothers. Records show Safady defaulted on the loan in November with Motcomb alleging a nearly $50 million unpaid balance at the time, pushing the parcels to the sales block.\nIt’s unclear whether another developer might have a go at the property and buy it for purposes of another project. Any proposal is likely to face much of the same scrutiny Safady had in moving the Bulgari Resort Los Angeles forward.\nKeeping up with the OC\nCompared to a $175 million listing, the $16.3 million trade of a Laguna Niguel mansion may seem small. However, the closing marked an all-time record for the city.\nThe sale of the Spanish-style mansion in the gated community of Bear Brand Ranch also set a price-per-square-foot record in Laguna Niguel. The home at\n7 Searidge\npenciled out to $1,993 per square foot. That’s well beyond the $625-per-square-foot held by the city’s former residential record: a two-lot deal that closed in 2014 for $15 million.\nAs Orange County sees more unique developments come online, such as Almquist’s River Street Marketplace in San Juan Capistrano, it’s helping lend an air of cool and renewed desirability in the residential communities south of Los Angeles County.\n",
    "related_links": [
      "https://therealdeal.com/la/2025/03/10/prologis-shifts-gears-on-arts-district-plan/",
      "https://therealdeal.com/magazine/january-2025/why-these-retail-players-are-betting-on-malls-for-la-millennials-with-money/",
      "https://therealdeal.com/la/2025/03/12/survey-suggests-swap-more-urban-density-for-restrictions-on-wildfire-zones/",
      "https://therealdeal.com/la/2025/03/13/la-canada-flintridge-ditches-appeal-to-builders-remedy-project/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/la/2025/03/10/oc-manse-trades-for-16m-to-set-laguna-niguel-record/",
      "https://therealdeal.com/la/2025/03/13/la-canada-flintridge-ditches-appeal-to-builders-remedy-project/",
      "https://therealdeal.com/la/2025/03/10/prologis-shifts-gears-on-arts-district-plan/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/"
    ],
    "market": "Los Angeles",
    "published": "Sat, 15 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-15T16:00:00+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/15/texas-republicans-block-las-vegas-sands-legalization-efforts/",
    "title": "Freshman lawmakers blocking Sands’ legalization efforts",
    "subhead": "Coalition opposes “any attempt to expand gambling” this session, which could kill a proposed megadevelopment in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 15, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-15T08:00:00",
    "content": "Will the Las Vegas Sands, owners of the Dallas Mavericks, manage to legalize gambling in Texas this legislative session?\nNot if a coalition of freshmen in the Texas House of Representatives gets its way. Twelve Republican lawmakers who replaced pro-gambling politicians in the last election are holding the line against casinos, the Texas Tribune\nreported\n. They are joined by three others who voted in favor of sports betting last session but have since rescinded their support.\nThey said this week they would oppose “any attempt to expand gambling” this session, which ends in May. After that, the Texas Legislature won’t meet in regular session again until 2027.\nProposals to legalize casinos and sports betting have been introduced, but the GOP coalition aims to stop them in their tracks. Neither proposal has received a committee hearing, the first step to consideration by the full house.\nThat could be bad news for the city of Irving, where Sands is seeking zoning approval for a Mavericks stadium with a resort and entertainment center, including a casino. Sands is spending big on lobbying and advertising campaigns in favor of “destination resort” casinos. If a casino is a no-go, Sands has said it is\nlikely to kill the entire proposal\n.\nMeanwhile in Southern Dallas, developer\nHoque Global\nmet its first deadline in its agreement with the city of Dallas for its University Hills megadevelopment. The firm now has\n60 days to purchase\nthe 270 acres for the development.\nOne of Fort Worth’s biggest development players,\nCrescent Real Estate\n, shifted its C-suite with the appointment of\nConrad Suszynski\nas sole CEO following the retirement of co-CEO Jason Anderson. Fort Worth is undergoing a development boom that is touching a beloved antique mall near the Cultural District, where\nPhoenix Property Company\nis planning a\n12-story hotel\n, plus retail and multifamily.\n\nIn office leasing news, the flight-to-quality trend reeled in some big fish.\nLaw firm Skadden, Arps, Slate, Meagher &amp; Flom leased 52,000 square feet spanning two full floors in\nHines’\nTexas Tower\nin Houston. The lease brings the building, at 845 Texas Avenue to 99 percent leased.\nAnother law firm, Hicks Johson, is spending $4.3 million to build out its lease at\nSkanska’s\nNorton Rose Fullbright tower at 1550 Lamar Street, which is\ndowntown Houston’s newest\noffice building.\nAnd a retail merchandiser is\nmoving its headquarters\nto 5801 Headquarters Drive in Plano, owned by\nMonarch Alternative Capital\nand\nTourmaline Capital Partners\nand built in 2021. The company will exit Granite Properties’ Granite Park III, which was built in 2007.\nAnd in Austin, Facebook and Instagram owner Meta Platforms is spending $3.7 million on an\noffice buildout in downtown Austin\n, although it’s not clear for whom.\n—Rachel Stone\n",
    "related_links": [
      "https://www.texastribune.org/2025/03/12/texas-gambling-sports-betting-casinos-house-republicans/",
      "https://therealdeal.com/texas/dallas/2025/03/13/backlash-rises-over-sands-vision-for-irving-casino-resort/",
      "https://therealdeal.com/texas/dallas/2025/03/12/hoque-global-has-60-days-to-buy-southern-dallas-acreage/",
      "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
      "https://therealdeal.com/texas/fort-worth/2025/03/14/phoenix-property-co-plans-highrise-hotel-amid-fort-worth-boom/",
      "https://therealdeal.com/texas/houston/2025/03/12/houstons-texas-tower-hits-99-leased-with-law-firm-signing/",
      "https://therealdeal.com/texas/houston/2025/03/12/skanskas-houston-tower-lands-law-firm-headquarters-lease/",
      "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/",
      "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
      "https://therealdeal.com/texas/dallas/2025/03/11/heres-what-could-happen-to-dallas-federal-buildings/",
      "https://therealdeal.com/texas/houston/2025/03/12/d-r-hortons-forestar-buys-land-for-home-lots-near-galveston/",
      "https://therealdeal.com/texas/houston/2025/03/14/houstons-largest-landowners-include-high-profile-homebuilders/"
    ],
    "market": "Texas",
    "published": "Sat, 15 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-15T12:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/state-farm-provisionally-can-do-22-insurance-rate-hike/",
    "title": "State Farm “provisionally” approved for 22% insurance rate hike",
    "subhead": "Insurance commissioner approves previously denied increase",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 8:09 PM",
    "pub_date_dt": "2025-03-14T20:09:00",
    "content": "State Farm General got its wish to hike home insurance rates by an average of 22 percent.\nThe news comes weeks after being\nstraight-armed\nby California’s chief insurance regulator for a request to increase rates because of the Los Angeles wildfires.\nCalifornia Insurance Commissioner Ricardo Lara “provisionally” granted the unit of Illinois-based State Farm Mutual Automobile Insurance the emergency rate increase requested after billions in wildfire claims,\nthe Los Angeles Times reported\n.\nBut the increase — which includes a 38 percent rate increase for rental buildings and 15 percent for renters and condo owners — won’t take effect until a hearing slated for April 8.\nLara approved the increase on March 14 after\nturning down the request last month\n, saying the insurer had failed to prove it was warranted.\nHe’d given the insurer an opportunity, however, to provide more evidence to justify the request.\nIn making his decision, Lara called on State Farm to halt any pending nonrenewals of customers statewide and for the insurer’s parent company to provide its California insurer an infusion of $500 million to stabilize its capital position, according to the Times.\n“The role of insurance commissioner involves balancing a stable and sustainable insurance market that serves consumers with effective oversight,” he said in a statement. “To ensure long-term choices for Californians, I had to make an unprecedented decision in the short term.”\n“The facts will be revealed in an open, transparent hearing,” he added.\n\nState Farm has faced years of losses and huge damage claims after the\nJan. 7 fires\nthat raged Pacific Palisades to Altadena, and leveled more than 12,000 homes.\nAs of March 11, State Farm General and its parent have received more than 12,000 fire and auto claims related to the wildfires, and paid\nmore than $2.2 billion to customers\n.\nState Farm General has estimated it will pay out $7.9 billion in the wake of the Palisades, Eaton and other L.A. County fires.\nBut, its net losses from the fires will be closer to $600 million after reinsurance payments, which largely will come from its parent company. Reinsurance is bought by insurers from other insurers to protect themselves from catastrophic events.\nLast March, the company announced it would\nnot renew 72,000 home, apartment and other property policies\nin California, citing wildfire risks and other concerns.\nThat followed a\ndecision in May 2023\nto stop writing insurance for new businesses, homeowners, and other personal property and casualties in the state, with the exception of personal auto policies.\nIn June, State Farm\nrequested a 30 percent rate increase for its homeowners policies\n, as well as other rate hikes, which await a decision. The request took state officials by surprise, with Lara saying it raised “serious questions about its financial condition.”\nState Farm General last month said it’s lost $2.8 billion over the last nine years, including gains from investment income. State Farm Group, led by State Farm General’s parent company, was given a superior financial rating in December by a rating agency.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://www.latimes.com/business/story/2025-03-14/insurance-commissioner-decides-to-provisionally-grant-state-farms-22-rate-hike",
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://www.latimes.com/california/story/2025-02-11/strongest-southern-california-storm-in-a-year-what-to-know",
      "https://newsroom.statefarm.com/state-farm-is-here-to-help-california-customers-impacted-by-wildfires/",
      "https://www.latimes.com/california/story/2024-03-23/state-farm-wont-renew-72-000-insurance-policies-in-california-worsening-the-states-insurance-crisis",
      "https://newsroom.statefarm.com/state-farm-general-insurance-company-california-new-business-update/",
      "https://therealdeal.com/la/2024/06/28/state-farm-seeks-steep-home-insurance-hikes-in-california/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://therealdeal.com/la/2025/02/05/state-farm-seeks-38-rate-hike-on-rental-buildings/",
      "https://therealdeal.com/la/2024/06/28/state-farm-seeks-steep-home-insurance-hikes-in-california/"
    ],
    "market": "Los Angeles",
    "published": "Sat, 15 Mar 2025 00:09:17 +0000",
    "published_dt": "2025-03-15T00:09:17+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/calif-urges-insurers-to-expand-coverage-in-fire-risk-areas/",
    "title": "State pushes insurers to expand coverage in fire-prone areas",
    "subhead": "New maps of high-risk zones outline where insurers must write more policies",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-14T18:30:00",
    "content": "State insurance regulators have unveiled a new plan to stabilize the home insurance market by pushing insurers to expand coverage in fire-prone areas where companies have dropped hundreds of thousands of homeowners in recent years.\nThe plan updates a map of high-risk zip codes where insurers will be required to write more policies, aiming to create a more equitable insurance market despite growing wildfire threats, the\nSan Jose Mercury News reported\n.\nHowever, many high-risk Bay Area neighborhoods, including Oakland, the Berkeley Hills and Gilroy, aren’t included in the updated map.\nState regulators say this is because those areas fall within zip codes where the overall insurance need is deemed lower. Despite this, new rules will still require insurers to offer coverage to homeowners in these areas who have been rejected by traditional providers due to fire risk.\n“Insurance companies have ignored those homes, and we’re trying to put the spotlight on them,” Michael Soller, spokesperson for the California Department of Insurance, told the Mercury News.\nThe plan stems from a deal with the insurance industry, allowing companies to raise rates based on climate-related risks in exchange for expanding coverage in high-risk areas.\nCalifornians currently pay an average of $1,435 annually for homeowners insurance, below the national average. But prices vary widely. And insurers like State Farm and Allstate have stopped issuing new policies in the state, citing strict rate-setting rules and wildfire losses.\nThe new rules require insurers to cover a proportional share of high-risk policies. For example, if a company covers 100 of every 1,000 policies statewide, it must cover 85 of every 1,000 in high-risk areas.\n\nHowever, some consumer groups argue the reforms have loopholes that may allow insurers to delay meeting these targets or only slightly increase coverage.\nHomeowners in fire-prone areas, like Carolyn Grote of the Berkeley Hills, are preparing independently. Grote formed a “Firewise community” with neighbors to improve fire safety, hoping to retain her insurance.\n“If Firewise could help people retain their insurance, that might be the biggest motivator,” she told the newspaper.\nConsumer groups are skeptical.\n“Insurers can use secret models to raise rates right away with unenforceable promises to expand coverage,” Carmen Balber of nonprofit Consumer Watchdog told the Mercury News.\nRegulators, however, insist they will monitor compliance closely and can revoke rate-setting privileges if insurers fail to meet coverage requirements.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/14/wildfire-insurance-homeowners-bay-area/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/25/california-insurance-head-plans-to-fix-home-market-crisis/",
      "https://therealdeal.com/la/2025/02/05/state-farm-seeks-38-rate-hike-on-rental-buildings/",
      "https://therealdeal.com/san-francisco/2024/12/13/farmers-insurance-ups-home-policy-line-in-california/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 22:30:37 +0000",
    "published_dt": "2025-03-14T22:30:37+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/forever-21-closing-these-stores-in-southern-california/",
    "title": "Forever 21 to close more than a dozen stores across SoCal",
    "subhead": "If no buyer is found LA firm could close 350 stores nationwide",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 5:49 PM",
    "pub_date_dt": "2025-03-14T17:49:00",
    "content": "Forever 21 is preparing to potentially close hundreds of stores, including more than a dozen in Southern California, as part of its ongoing bankruptcy.\nThe Los Angeles-based apparel firm, hurt by plunging sales and competition from overseas e-commerce merchants, will make cuts across Los Angeles and Orange counties,\nthe Orange County Register reported.\nThe pending closures come after the 41-year-old company l\nocked the doors of its Downtown L.A. headquarters\nlast month at the California Market Center at 110 East 9th Street, in the Fashion District.\nAfter decades of family ownership, the retail chain was sold in 2020 to investors who now seek a new owner.\nThe company is preparing to close down its remaining 350 stories as part of its bankruptcy filing,\naccording to Bloomberg\n, citing anonymous sources.\nEfforts to find a buyer for the fast-fashion retailer to avoid a liquidation have so far failed, they said. Talks with one potential bidder are ongoing\nForever 21 reported to the state it would be closing eight stores across Southern California — but the closures appear to be more widespread, with hundreds of employees to hit the bricks, according to the Register.\nThe official closures include stores at the The Outlets at Orange, Main Place Mall in Santa Ana, Galleria at Tyler Mall in Riverside, Ontario Mills in Ontario, Victoria Gardens in Rancho Cucamonga, Montclair Place in Montclair, Lakewood Center Mall and at Los Cerritos Mall\nThe company said the layoffs and store closures are permanent, beginning April 25 and continuing through May 9, letters submitted to California’s Employment Development Department.\n\nReaders of the Register also reported stores at Westfield Fashion Square in Sherman Oaks, The Shops at Santa Anita in Arcadia, South Coast Plaza in Costa Mesa, Promenade Temecula and Inland Center in San Bernardino had closing signs on their storefront windows.\nThe company,\nwith 58 stores in California\n, announced in February that it would shutter at least 200 stores nationwide.\nThe retailer was founded in 1984 by husband and wife Do Won and Jin Sook Chang as Fashion 21, in Los Angeles, with its first store on Figueroa Street.\nRenamed Forever 21, the chain grew into a nationwide brand known for its trendy and cheap clothing for teens and 20-somethings. At its peak in 2015, the company reported $4.4 billion in sales and 1,300 stores worldwide.\nBut over the years, the company faced numerous controversies, including accusations of wage theft, the use of cadmium in its jewelry, controversial slogans on T-shirts and the cheap labor used abroad to sew its clothing.\nIn 2020, its assets were sold in bankruptcy for $81 million to a group of investors that included Authentic Brands Group, Simon Properties and Brookfield Properties. That group, known as SPARC, owned retail brands including Lucky, Eddie Bauer, Aeropostale, Brooks Brothers and Nautica.\nIn January, SPARC said\nit was merging with JCPenney\n, creating a new group called Catalyst Brands, which left off Forever 21 from its list of brands. Instead, the company said it was seeking a new operator for the retailer.\nToday, fast fashion in the U.S. has been overrun with competition from Chinese e-commerce companies such as Temu and Shein, which produce and sell items for pennies, according to the Register.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.dailynews.com/2025/03/05/forever-21-closing-at-least-8-more-stores-in-southern-california/",
      "https://therealdeal.com/la/2025/02/25/forever-21-to-close-hq-at-brookfields-cmc/",
      "https://www.mercurynews.com/2025/03/14/forever-21-weighs-closing-all-stores-ahead-of-bankruptcy/",
      "https://locations.forever21.com/us/directory/states/ca",
      "https://www.dailynews.com/2025/01/09/lucky-forever-21-operator-merges-with-jcpenney/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/25/forever-21-to-close-hq-at-brookfields-cmc/",
      "https://therealdeal.com/la/2022/07/25/forever-21-leases-164k-sf-for-new-hq/",
      "https://therealdeal.com/la/2024/02/07/blackstone-and-worthe-list-former-forever-21-hq-for-sale/"
    ],
    "market": "Los Angeles",
    "published": "Fri, 14 Mar 2025 21:49:10 +0000",
    "published_dt": "2025-03-14T21:49:10+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/chris-kennedy-hines-score-610m-loan-for-office-tower/",
    "title": "Kennedy, Hines rake in $610M Salesforce Tower refi",
    "subhead": "Deal comes with appraisal pegging 60-story property at $888M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-14T17:30:00",
    "content": "Hines, Chris Kennedy of a famous American political family and their investment partners in a 60-story skyscraper in Chicago have defied the pandemic-induced downturn for commercial office space.\nThe owners of\nSalesforce Tower\non the bank of the Chicago River are nearing the finalization of a $610 million long-term debt deal, marking a milestone in the aftermath of the pandemic-stricken economy, CoStar News\nreported\n. Should the deal close later this month as expected, the property — developed by Hines and the Kennedy family as well as the AFL-CIO’s real estate investment arm — will stand as a contrarian bet that worked out amid economic uncertainty.\nThe commercial mortgage-backed securities loan reflects the tower’s long-term valuation of $888 million, as appraised by Cushman &amp; Wakefield. Its current valuation of $745 million is expected to rise further following the repayment of tenant-improvement costs and free rent allowances.\nThe refinancing package, with Wells Fargo, JPMorgan Chase and Goldman Sachs serving as the lenders, will replace the property’s $549 million construction debt and is projected to carry an interest rate of 6.525 percent until its maturity in March 2030.\nConceived during the early days of the pandemic, Salesforce Tower has upended market trends by maintaining high occupancy levels, with leases covering over 95 percent of its 1.2 million square feet. Key tenants include Salesforce, which rents more than 477,000 square feet, and Kirkland &amp; Ellis, which is on a 677,000-square-foot lease; those deals run into the 2040s.\n\nMeanwhile, much of the rest of the Chicago office market is depressed, with record-high vacancy rates of more than 25 percent and\nmassive foreclosure lawsuits\nagainst office landlords winding through Cook County court.\nFor the Salesforce Tower developers and Chicago’s broader office market, scoring the loan is a testament to the investment thesis that the world’s largest companies remain interested in ultra-premium workspace and aren’t afraid to invest heavily in it as a method to attract and retain top talent. Kirkland has poured over $207 million beyond its tenant-improvement allowance to create its ideal workspaces, while Salesforce has put up an additional $78 million for its interior buildout, the Moody’s report cited by the outlet shows.\nMoody’s put out a robust outlook on the deal, buoyed by a net operating income projected to reach about $51.2 million by the second year of the loan.\nEastdil Secured arranged the financing package for Salesforce Tower.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2020/04/14/amidst-the-chaos-hines-just-locked-down-one-of-the-fattest-construction-loans-in-chicago-history/",
      "https://www.costar.com/article/1787199735/chicagos-salesforce-tower-nears-610-million-refinancing",
      "https://therealdeal.com/chicago/2024/11/04/beacon-capital-hit-with-372-million-chicago-office-foreclosure/",
      "https://therealdeal.com/chicago/2023/03/24/meta-salesforce-shedding-huge-chunks-of-office-space/",
      "https://therealdeal.com/chicago/2020/04/14/amidst-the-chaos-hines-just-locked-down-one-of-the-fattest-construction-loans-in-chicago-history/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-14T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/la-resi-rent-hikes-double-national-average-after-wildfires/",
    "title": "LA apartment rent hikes double national average in wake of wildfires",
    "subhead": "Rents in LA, OC counties rose 0.7% versus 0.3% in US: ApartmentList",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 4:49 PM",
    "pub_date_dt": "2025-03-14T16:49:00",
    "content": "Landlords in Los Angeles and Orange counties have jacked up rents at more than twice the national rate since a firestorm early this year torched more than 12,000 homes.\nRents in January and February rose 0.7 percent across the region — more than double the 0.3 percent increases for apartments nationwide and locally during the same period,\nthe Orange County Register reported\n, citing a report\nfrom ApartmentList.\nRents rose across Los Angeles as thousands of refugees from fire-scorched neighborhoods scrambled to find places to live.\nMonthly rents in Santa Monica, near the Palisades fire, are up 3 percent year to date, with a typical two-bedroom unit renting for $2,867.\nRents in Glendale, near the Eaton fire, are up 2.1 percent, with a typical two-bedroom home renting for $2,462 a month. At the same time, rents in January and February rose 2 percent in Pasadena to $2,731, and 1.9 percent in Burbank to $2,448.\nDespite government actions to cap rent hikes, “the fires could still have a meaningful impact on rent prices in a market where metro-wide rent growth had previously been essentially flat,” ApartmentList’s report stated.\n“Increases are relatively modest so far and do not indicate evidence of widespread rent gouging but they do seem to indicate that the trajectory of the area’s rent prices has been altered by the fires.”\n\nAn analysis by the Washington Post after the fires found that landlords had illegally gouged renters scrambling to find homes, with rents jumping by\n20 percent across Los Angeles County.\nIn nearly 30 cities and Los Angeles neighborhoods, the median rent for homes listed within two weeks after the fires started spiked well\npast the legal limit of 10 percent\n, compared with those listed within two weeks before the blazes\nAn executive order signed by Gov. Gavin Newsom after the fires began made it illegal to jack up the cost of hotels, housing, gas and other goods by more than 10 percent.\n—\nDana Bartholomew\nKEY POINTS:\n",
    "related_links": [
      "https://www.dailynews.com/2025/03/13/los-angeles-rent-hikes-run-twice-national-increases-report-says/",
      "https://www.apartmentlist.com/ca/los-angeles#rent-report",
      "https://therealdeal.com/la/2025/01/28/la-area-landlords-illegally-hike-rents-20-after-fires/",
      "https://therealdeal.com/la/2025/01/27/socal-agent-hit-with-price-gouging-charge-law-limits-rents/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/01/28/la-area-landlords-illegally-hike-rents-20-after-fires/",
      "https://therealdeal.com/la/2025/03/10/la-to-temporarily-ban-evictions-for-substantial-remodeling/",
      "https://therealdeal.com/new-york/2025/03/04/eviction-moratoriums-pose-risks-for-owners-renters/"
    ],
    "market": "Los Angeles",
    "published": "Fri, 14 Mar 2025 20:49:20 +0000",
    "published_dt": "2025-03-14T20:49:20+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
    "title": "Developer eyes office-to-resi conversion in wake of YIMBY lawsuit in Lafayette",
    "subhead": "SAJ wants to replace three office buildings with 90-unit apartment building",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-14T16:00:00",
    "content": "SAJ Development wants to swing a wrecking ball into three office buildings in Lafayette to erect a 90-unit apartment building in an upscale city long opposed to affordable housing.\nThe locally based developer filed revised plans to replace the offices with a seven-story, 171,400-square-foot complex at 1001 Oak Hill Road,\nthe San Francisco Business Times reported\n. The city will consider the project on March 17.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals. The lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nLafayette’s alleged shell game includes relying on faith-based institutions and longtime businesses with no plans to develop housing as potential building sites for homes, according to the complaint.\nThe lawsuit seeks a court to compel the city to adopt a revised plan with an update to its zoning laws. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031. Within the decade through 2019, the city permitted 115 homes.\nSAJ could help remedy that by its mixed-use project calling for 79 market-rate apartments and 11 affordable apartments, including five for very-low-income households and six for moderate-income households.\nWhat appears to be a U-shaped complex, designed by Berkeley-based Trachtenberg Architects, would be draped in two shades of brown, with tiered roof decks, and floor-to-ceiling corner windows with exterior balconies, according to a rendering.\nThe developer would employ a nearly 23 percent state density bonus in exchange for the affordable housing, plus a state streamlining law for faster approvals. A cost and timeline for construction were not disclosed.\n\nSAJ applied using Senate Bill 330, which effectively freezes zoning that’s in place at the time a project is submitted, limits the number of public hearings to five and suspends or eliminates restrictions on housing development.\nThe law aims to prevent cities from delaying projects unnecessarily over subjective standards, along with several other laws meant to stop cities from blocking affordable housing.\nThe developer had submitted an earlier version of the project in 2022 that called for tearing down just two of the three offices to build\n53 units\n. City officials approved that version in May, before SAJ revised its plans. Jeff Stone, owner of Diamond Construction, was listed as the property owner operating through SAJ Development, according to SFYimby.\nLafayette was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\nMembership in SAJ Development, led by Stone, includes Diamond Swope Holdings, the Steven Kay Trust, the Griggs Community Property Trust and Outdo, based in Lafayette, according to state business records. Another firm, Valley Oak Capital, is based in Texas.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/13/lafayette-office-residential-oak-hill-saj.html",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://sfyimby.com/2024/04/updated-plans-shared-for-1001-oak-hill-road-in-lafayette.html",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/",
      "https://therealdeal.com/san-francisco/2022/05/13/midwest-investor-pays-103m-for-two-shopping-centers-in-lafayette/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-14T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/14/houstons-largest-landowners-include-high-profile-homebuilders/",
    "title": "Which homebuilders own the most land in Houston?",
    "subhead": "These are the seven-county metro area’s biggest landowners",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-14T15:00:00",
    "content": "Houston’s largest landowners include homebuilders carving out new suburbs and public entities managing flood zones and parks.\nThe top 10 landowners control about 2.6 percent of the metro, the Houston Chronicle\nreported\n.\nThe ranking was compiled based on an analysis of Harris, Montgomery, Liberty, Fort Bend, Brazoria, Galveston and Chambers counties, calculating acreage totals from public property records and mapping data and ranking by parcel totals.\nIt offers a snapshot of the region’s most influential landholders shaping development patterns in and around the Houston metro.\nPrivate developers dominate the landscape, with Camillo Companies leading the pack.\nThe Houston-based homebuilder owns 3,650 acres across six counties, supporting the development of 11,222 residential lots under its brands, including SimplyHome and Legend Homes.\nAnother major player, Arlington-based D.R. Horton, holds 3,490 acres. As Houston’s most active homebuilder in 2023, it led the region with 5,570 home starts and continues expanding in suburban communities.\nMeanwhile, Colony Ridge controls nearly 15,000 acres, primarily in Liberty County. The firm, known for developing infrastructure-ready lots, remains a major driver of suburban sprawl despite facing\nscrutiny over its business practices\n.\n\nPublic entities are also prominent landholders. The City of Houston manages 31,530 acres, including major public assets like George Bush Intercontinental Airport, parklands and municipal facilities. The Harris County Flood Control District controls 26,000 acres for its role in flood mitigation efforts.\nThe role of public entities in flood mitigation is particularly crucial, the Bayou City’s low-lying topography and history of major flooding events making infrastructure and water management far more important to long-term development planning relative to most other Texas metros.\nHarris County itself holds 30,130 acres, spanning government buildings, recreational spaces and major event venues like NRG Park.\nHouston’s sprawl is driven by a mix of public investment and private development, with much of the metro’s expansion occurring along major growth corridors like Interstate 45, U.S. Highway 59 and the Grand Parkway.\nLiberty County, where Colony Ridge dominates, is one of the fastest-growing exurban areas, driven by demand for affordable housing. Its population increased 25.5 percent from mid-2020 to last summer, Census data shows.\nMeanwhile, Fort Bend and Montgomery counties continue to attract large-scale master-planned communities, fueled by population growth and proximity to Houston’s employment centers.\n— Judah Duke\n",
    "related_links": [
      "https://www.houstonchronicle.com/projects/2025/houston-largest-top-landowners-map/",
      "https://therealdeal.com/texas/houston/2023/12/20/federal-government-sues-colony-ridge-developer/",
      "https://therealdeal.com/texas/houston/2025/02/24/johnson-development-prepares-another-700-home-lots-near-houston/",
      "https://therealdeal.com/texas/houston/2025/01/22/starwood-starts-another-master-planned-community-near-houston/",
      "https://therealdeal.com/texas/houston/2025/01/09/houston-has-most-top-selling-master-planned-communities-again/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-14T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/zappettini-family-defaults-on-mountain-view-tech-campus/",
    "title": "Zappettini family defaults on Mountain View tech campus",
    "subhead": "Family office defaulted on $120M in CMBS loans, after eyeing redevelopment",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-14T14:00:00",
    "content": "The Zappettini family office has defaulted on $120 million in commercial mortgage-backed security loans tied to a 100,000-square-foot tech campus in Mountain View.\nThe San Francisco-based office led by John Zappettini received a notice of default from an undisclosed lender of loans tied to the Terra Bella Tech Park at 850-900 Shoreline Boulevard,  1212-1305 Terra Bella Avenue and 1330-1350 West Middlefield Road,\nthe Silicon Valley Business Journal reported\n.\nThe family bought and developed the 10-acre office and industrial park with 17 buildings in the 1970s, then turned it into a tech campus. In 1921, it tried to redevelop it into a mixed-use village, with homes and commercial properties, according to its website.\nA default notice filed this week gives the Zappettinis 90 days to pay off the default amount. If they fail, the lender will record a notice of sale, Steven Hoffman, a real estate attorney based in Sunnyvale who is not connected to the situation, told the Business Journal.\nThe Business Journal reported in February that the\nMountain View tech campus had been heading toward foreclosure\nor a loan modification after the owner defaulted on a $120 million mortgage debt.\nLoan servicer reports obtained in January showed Zappettini Investment Company failed to repay the mortgage debt by its June 2024 maturity date. The initial loan default was\nfirst reported by The Real Deal\nthat month.\nCiti Real Estate Funding issued the two loans — one for $65 million and a second for $55 million — and then pooled them into commercial mortgage-backed securities deals.\n\nAs of last summer, leases for 40 percent of the tech park’s office, light-industrial and research and development buildings were set to expire within six months, a key factor in the default.\nThe Zappettini family was originally in the wholesale flower importing business and formerly used some of the Mountain View properties for its wholesale operations, according to its website.\nThe Zappettinis sold multiple parcels in Mountain View to Google in 2011, which the tech giant sold a few years later to the Irvine Company, according to public records. They sold another property to Google in 2016 for its now-abandoned\nGoogle Landings\nproject.\nThe family also owned almost 2 acres in the San Francisco Flower Mart from the 1950s until they sold it to Kilroy Realty in 2016 for $31 million in cash and $56 million in stock.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanjose/news/2025/03/13/default-mountain-view-tech-campus-zappettini.html",
      "https://www.bizjournals.com/sanjose/news/2025/02/05/zappettini-cre-portfolio-loan-default-foreclosure.html",
      "https://therealdeal.com/san-francisco/2024/07/16/sf-based-zappettini-family-defaults-on-loan-tied-to-silicon-valley-commercial/",
      "https://therealdeal.com/sanfrancisco/2023/09/10/google-finally-gets-its-land-as-family-leases-farm-for-companys-expansion/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/16/sf-based-zappettini-family-defaults-on-loan-tied-to-silicon-valley-commercial/",
      "https://therealdeal.com/san-francisco/2024/11/26/essex-property-pays-26-million-for-mountain-view-buildings/",
      "https://therealdeal.com/san-francisco/2024/12/10/amazon-com-leases-217k-sf-office-building-in-mountain-view/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-14T18:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/sf-suspends-empty-homes-tax-in-bid-to-save-it/",
    "title": "SF suspends empty-homes tax in bid to save it",
    "subhead": "Supervisor wants to amend tax to keep it alive, subject to constitutional challenge",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-14T12:00:00",
    "content": "San Francisco officials have delayed suspending a voter-approved “Empty Homes Tax” during a legal challenge because of a push by Supervisor Jackie Fielder to keep the measure alive.\nThe tax, known as Proposition M, was approved in November 2022 with 54 percent of the vote and targets property owners with residential units left vacant for over 182 days a year,\nthe San Francisco Chronicle reported.\nTaxes range from $2,500 to $5,000 based on size, rising to a maximum of $20,000 a year per unit, applying only to buildings with three or more apartments.\nFielder argued that amendments should be explored to prevent the tax from being suspended indefinitely while the city fights a lawsuit from landlords and property owners who say it violates their property rights.\nShe proposed that the tax suspension should only last “until the courts tell us otherwise,” allowing the city to collect if legally permitted. Fielder’s motion to continue the vote passed unanimously, with a hearing set for March 18.\nThe Empty Homes Tax took effect at the beginning of last year, with collections planned for upcoming April.\n\nProponents estimated it would generate more than $20 million a year for housing and unlock about 5,000 units within two years, though critics have questioned the projections.\nThe tax has faced legal challenges since February 2023, when property owner groups filed a lawsuit alleging it was coercive and infringed on their rights.\nIn December 2023, Superior Court Judge Charles Haines\ndeclined to dismiss the lawsuit\narguing in a ruling that property owners don’t need to wait until the tax is due to challenge it in court. In October, Haines\nstruck down the tax\n, saying that it violated the U.S. and California constitutions and was preempted by California law.\nThe court subsequently ordered the city to halt enforcement and collection, and the city treasurer stated that property owners would not be required to pay by the original April 30, 2025 deadline unless the court’s decision is reversed on appeal.\nThe city attorney’s office is now appealing the ruling and has expressed disappointment with the trial court’s decision.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/sf/article/sf-empty-homes-tax-suspension-in-limbo-20215573.php",
      "https://www.sfchronicle.com/politics/article/sf-empty-tax-18577248.php",
      "https://www.sfchronicle.com/politics/article/judge-strikes-san-francisco-s-vacant-home-tax-19881408.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/01/04/judge-oks-challenge-to-san-franciscos-empty-homes-tax/",
      "https://therealdeal.com/san-francisco/2022/07/05/vacant-home-tax-poised-for-november-ballot-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2022/11/15/apartment-vacancy-tax-passes-in-san-francisco-and-berkeley/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-14T16:00:00+00:00",
    "author": "TRD Staff"
  }
]