[
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/watermark-capital-lands-financing-for-office-to-resi-play/",
    "title": "Watermark Capital lands $125M for office-to-resi play in Dumbo",
    "subhead": "Integritas Capital, Bravo Property Trust provide financing for conversion",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 18, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-18T08:00:00",
    "content": "Watermark Capital Group secured financing for one of Brooklyn’s notable office-to-residential conversions.\nWolfe Landau’s firm scored $125 million in construction financing for the conversion of 175 Pearl Street in Dumbo, the Commercial Observer\nreported\n. Bravo Property Trust — an affiliate of Bravo Capital — and Integritas Capital provided the debt, which closed a year after BridgeCity Capital originated a $50.6 million acquisition loan.\nWatermark\nacquired\nthe eight-story, 185,000-square-foot office property last summer from Cannon Hill Capital Partners for $66.5 million. Landau immediately embarked on plans to convert the 1918-built property into a 19-story complex.\nOriginally, the plans reportedly called for a 14-story, 230,000-square-foot building with 238 rental units. Those plans have since shifted, with Watermark eyeing multifamily units on the eight converted floors and an 11-story condo property atop the rentals.\nCritically, the rental portion of the building will qualify for the city’s 467m program, giving Landau a tax abatement for 35 years in exchange for 25 percent of apartments being earmarked for affordable housing. The abatement provides a 65 percent exemption for the first 30 years before falling to 10 percent annually for the last five years of the abatement.\n\nOccupants at the building included Constangy, Brooks, Smith &amp; Prophete, Thelab and coworking company Spaces. But a BridgeCity analyst said at the time of acquisition that all tenants had either departed or were soon to do so.\nAmenities are expected to include tenant lounges and a fitness center. Watermark expects to complete the conversion in 2027.\nLast summer, Williamsburg-based Watermark\nsubmitted a proposal\nfor a residential project on the site of a shuttered church in Greenwood Heights. The 218-unit project requires a zoning change from the district’s light manufacturing zoning status to residential.\nIn June, the firm paid $15 million for Brooklyn’s Hanson Place Central United Methodist Church in Fort Greene, while in late 2023, Watermark paid $12.3 million for St. Lucy’s-St. Patrick Roman Catholic Church in Bedford-Stuyvesant and demolished it to make room for housing.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://commercialobserver.com/2025/03/125m-brooklyn-office-to-resi-conversion/",
      "https://therealdeal.com/new-york/2024/06/06/watermark-capital-plots-office-to-resi-play-in-dumbo/",
      "https://therealdeal.com/new-york/2024/08/16/watermark-eyes-third-church-property-for-redevelopment-in-under-a-year/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/06/06/watermark-capital-plots-office-to-resi-play-in-dumbo/",
      "https://therealdeal.com/new-york/2024/08/16/watermark-eyes-third-church-property-for-redevelopment-in-under-a-year/",
      "https://therealdeal.com/new-york/2025/01/23/sunlight-lands-99m-loan-for-nomad-office-to-resi-conversion/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-18T12:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/18/nyc-begins-public-review-of-350-park-avenue/",
    "title": "The Daily Dirt: City kicks off review of 350 Park Avenue",
    "subhead": "Project is first office tower presented to City Planning in 5 years",
    "authors": "ByKathryn Brenzel",
    "pub_date": "Mar 18, 2025, 7:30 AM",
    "pub_date_dt": "2025-03-18T07:30:00",
    "content": "The 1.8 million-square-foot office tower planned for 350 Park Avenue is a special case.\nDuring an earnings call last month, Vornado Realty Trust’s Steve Roth said the project was  “isolated, different,” than other ground-up office projects in part because billionaire Ken Griffin is involved. (Griffin’s Citadel is anchoring the tenant and is a partner on the project.)\nAt the time, Roth said the environment for ground-up development is otherwise so inhospitable that he doesn’t think any other project will get off the ground anytime soon. Of course, RXR, TF Cornerstone and BXP might have something to say about that, given that they plan to break ground on their own\ntrophy office towers\nthis year.\nBut on Monday the Park Avenue project became the first office tower to be presented to the City Planning Commission in five years. The Department of City Planning certified the project on Monday, kickstarting the monthslong public review of the project.\nThe project is made possible, in part, by the\n2017 rezoning\nof Midtown East, which allowed air rights from landmarked properties to be transferred to non-adjacent sites throughout the district. The development team is buying more than 480,000 square feet of air rights from St. Patrick’s Cathedral and St. Bartholomew’s Church. As part of those deals, the developers are paying more than $30 million to a public Realm improvement fund created as part of the rezoning.\nThe developers are also seeking special permits to add space for a public concourse and to make other design adjustments, hence why the project has to go through the Uniform Land Use Review Procedure.\nWhat we’re thinking about\n: What City Council races are you watching closely? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned\n: The Department of City Planning will begin public review of the Jamaica Neighborhood Plan, a rezoning that is expected to pave the way for the construction of more than 12,000 housing units in the Queens neighborhood over the next 15 years.\nElsewhere in New York…\n\n— U.S. Senate Minority Leader Chuck Schumer postponed several stops on his book tour this week, citing “security reasons” as he faces criticism for voting in favor of GOP-drafted stopgap spending bill,\nPolitico reports\n. Schumer was expected to make stops in Baltimore, Washington, New York City and Philadelphia this week to promote his new book, “Antisemitism in America: A Warning.”\n— A professor is accusing William Paterson University in New Jersey of losing his 380 million-year-old fossils,\nGothamist reports\n. Paleontologist Martin Baker is suing the school, alleging that it botched sending the fossils to a colleague in Florida, resulting in the collection being sent to a landfill in Tennessee.\n— The city plans to build a new NYPD training facility and indoor shooting range on City Island,\nthe City reports\n. Residents of City Island have complained over the years about the noise from the shooting range. NYPD representatives say the new facility will result in “almost zero to no noise at all.”\nClosing Time\nResidential:\nThe priciest residential sale Monday was\n$33.9 million\nfor a condo unit at 15 Central Park West. The Zeckendorf-developed unit’s last on-market sale was $22.7 million in 2008, though the condo is selling less than its initial listing price of over $60 million.\nCommercial:\nThe most expensive commercial closing of the day was\n$150 million\nfor 333 West 34th Street. Brookfield was the seller of the Garment District office property, which is 287,000 square feet. Brookfield faces a significant loss on the asset after paying $255 million for the property seven years ago,\nper reports\n.\nNew to the Market:\nThe highest price for a residential property hitting the market was $45 million at\n10 East 67th Street\n. The Lenox Hill townhouse is 13,100 square feet and is listed by Serhant.\nBreaking Ground:\nThe largest new building application filed was for a 48,902-square-foot, six-story, mixed-use building at 10-39 49th Avenue in Queens. The plans also feature 35 class-A units. Anthony Ng of Angelo Ng &amp; Anthony Ng Architects was the applicant on the file.\n— Joseph Jungermann",
    "related_links": [
      "https://therealdeal.com/magazine/march-2025/suddenly-developers-want-to-build-trophy-offices-again/",
      "https://therealdeal.com/new-york/2017/08/09/get-ready-for-a-ton-of-new-office-space-maybe-city-council-approves-midtown-east-rezoning/",
      "mailto:kathryn@therealdeal.com",
      "https://www.politico.com/news/2025/03/17/schumer-postpones-book-tour-over-security-concerns-00232634",
      "https://gothamist.com/news/paleontologist-says-nj-school-lost-his-380m-year-old-fossils-and-now-theyre-in-a-landfill",
      "https://www.thecity.nyc/2025/03/17/nypd-shooting-range-rodmans-neck/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031300509001",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031300353001",
      "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
      "https://www.compass.com/listing/10-east-67th-street-manhattan-ny-10065/1798656594379907745/"
    ],
    "market": "New York",
    "published": "Tue, 18 Mar 2025 11:30:00 +0000",
    "published_dt": "2025-03-18T11:30:00+00:00",
    "author": "Kathryn Brenzel"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/18/beltway-capital-seizes-west-loop-offices-with-r2-still-aboard/",
    "title": "R2’s loft office debt workout cuts Heitman out of the picture",
    "subhead": "Nonperforming loan purchaser Beltway Capital kept Matt Garrison’s firm on board",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 18, 2025, 7:15 AM",
    "pub_date_dt": "2025-03-18T07:15:00",
    "content": "Office properties hit hard by the pandemic often end up in the hands of their lenders or bargain-hunting buyers before they get a chance at a revival.\nYet for a West Loop office portfolio that plunged from 90 to 50 percent occupied, co-owner R2 has managed to remain in the drivers’ seat and go debt-free through a new partnership. Its joint venture with Beltway Capital Management — finalized last month with a deed-in-lieu of foreclosure that took its former co-owner Heitman out of the picture — also adds a fifth building to the 350,000-square-foot portfolio.\nR2 bought six West Loop loft office buildings in 2016 for $86 million in a joint venture with Chicago-based Walton Street Capital. R2 later recapitalized a four-building portion of the portfolio in a joint venture with Chicago-based Heitman in 2019. The Heitman venture paid $65 million for the portfolio with a $42 million loan from Truist Financial. It’s unclear how much R2 paid to maintain its stake in the properties.\nThe joint venture struggled to hold onto the four assets, located at 641 West Lake Street, 901 West Jackson Boulevard and 130 South Jefferson Street, after the pandemic hit.\nMaryland-based Beltway, which specializes in buying distressed debt, bought the loan note from Truist last May, when the properties and their owners faced a murky path forward. The loan was labeled nonperforming at the time of its sale, meaning it likely traded for less than its face value.\nIt’s not uncommon for distressed debt buyers to file foreclosure actions shortly after acquiring a struggling loan.\nWhen Truist put the $42 million debt on the market, R2 and Heitman hadn’t technically defaulted on the loan, but it was in cash management, people familiar with the offering said. That means its excess cash flow was being used to cover debt service costs.\nIn this case, Beltway tapped R2 as its partner in managing the assets. R2 CEO Matt Garrison declined to share how much the firm invested into the portfolio to maintain its stake or what terms dictated Heitman’s departure from the joint venture.\nRepresentatives of Heitman did not respond to requests for comment.\nGarrison said R2 will be investing in “aggressive retention efforts for existing tenants,” and upgrades to common areas.\n\nIt was worth it for R2 to hang onto the assets because loft offices are often the type of buildings targeted for residential conversions, he said, meaning the number of competing properties could dwindle. Others aren’t in a position to fund the costs of competing for tenants.\n“Many of the (loft office) owners are undercapitalized or lack a rationale to invest capital in new leases, because their properties are worth less than the debt,” Garrison said. “This makes the effective inventory even smaller. We think there will always be demand for well executed loft buildings in the West Loop, and supply and demand looks better today for the right buildings than it has in a long time.”\nA few months before it bought the distressed note from Truist, Beltway also pounced on another struggling loan issued by Sun Life Assurance Company of Canada to the Feil Organization for a loft office building at 730 North Franklin Street. Beltway also partnered with R2 to take over that asset.\nNow the firms co-own all five properties outright. Debt-free buildings\nhave emerged as an appealing strategy\nfor office investors seeking flexibility in making significant building upgrades and attracting tenants with competitive lease terms.\n“Debt is just financial engineering. It isn’t required from this entry basis to generate great returns,” Garrison said. “One of the first questions tenant reps ask is about debt. Is the building in trouble, etc. Owning a property in all cash is the best answer to this question.”\nWhether the new approach will kickstart a turnaround for the full portfolio remains to be seen.\nThe office at 901 West Jackson is 90 percent occupied but the offices at 641 West  Lake and 130 South Jefferson are 50 percent occupied. Garrison said the firm is negotiating several leases across the properties.\n“In the office business, it is hard to stay flat,” he said. “You are either growing or you are declining. The Chicago office market is really two markets today, with almost half of the buildings effectively offline.”\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/03/04/debt-free-office-buildings-can-give-chicago-landlords-an-edge/",
      "https://therealdeal.com/chicago/2023/06/23/r2-buying-michigan-avenue-office-tower-for-70m-as-cbre-takes-loss/",
      "https://therealdeal.com/chicago/2024/02/16/feil-facing-beltways-foreclosure-on-river-north-office/",
      "https://therealdeal.com/chicago/2024/07/26/beltway-capital-seizes-chicago-office-building-from-feil/"
    ],
    "market": "Chicago",
    "published": "Tue, 18 Mar 2025 11:15:00 +0000",
    "published_dt": "2025-03-18T11:15:00+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/18/fannie-mae-gets-receiver-for-mendel-steiners-rentals/",
    "title": "Fannie Mae secures receiver for Mendel Steiner’s properties",
    "subhead": "Judge granted emergency motion over late investor’s rentals in Cleveland",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 18, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-18T07:00:00",
    "content": "The receivers are coming for the late Mendel Steiner’s rental properties.\nA federal judge recently granted Fannie Mae’s request to appoint a receiver to take control of Steiner’s 308-unit portfolio around Cleveland.\nThe Borough Park investor had amassed thousands of multifamily units across the U.S. But in January, Steiner died by suicide at the age of 33, sending\nshockwaves\nthrough Brooklyn’s close-knit commercial real estate community.\nFannie Mae’s lawsuit, which sought to foreclose and appoint a receiver for Steiner’s properties in Cleveland, offers new details about the financial pressure Steiner faced prior to his death.\nFannie\nsued Steiner and his affiliated entities in 2024, alleging he defaulted on a $22.7 million loan originated by Greystone. Fannie alleges Steiner’s companies failed to pay taxes, falsified rent rolls and failed to provide information during an inspection. Steiner guaranteed the loan, making him personally liable, according to the lawsuit.\nThe lawsuit alleges Steiner neglected the properties, failing to service any of the fire extinguishers at the properties for two years. Gas was shut off for months and trash piled up at some of his properties, according to Fannie’s lawsuit.\nDuring two years of Steiner’s ownership, occupancy fell from 99 percent to 25 percent.\n\nBy September 2024, Fannie sought to appoint a receiver for the properties in Cleveland and Shaker Heights spanning 15 parcels and totaling 333,580 square feet.\nBut Steiner’s lawyers contested the receivership. They argued a receiver would add an extra layer of cost and Steiner was working hard to address the issues with the properties. Steiner’s father Lieb Steiner filed a declaration supporting the motion to oppose the receiver.\nOn February 10, Steiner’s counsel filed a “Notice of Suggestion of Death,” which stated that Steiner died a month prior. In late February, Fannie sought an immediate appointment of a receiver for the properties.\nThe judge ruled in favor of Fannie and appointed Michael Guggenheim as the receiver.\n“The evidence submitted by Fannie Mae reveals significant and ongoing damage to the properties due to mismanagement,” Judge Bridget Meehan Brennan said in the order.\nIn late February, a judge approved Bank of Montreal’s request to appoint a\nreceiver\nfor Steiner’s 800-unit rental properties in Baltimore. Steiner secured a $160 million refinancing from BMO for the properties in early 2024.\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/",
      "https://therealdeal.com/tag/fannie-mae/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/02/04/bank-of-montreal-seeks-receiver-for-mendel-steiners-properties/",
      "https://therealdeal.com/new-york/2025/01/10/mendel-steiner-dead-at-33/",
      "https://therealdeal.com/new-york/tristate/2025/01/15/mark-nussbaum-shuts-down-law-firm/"
    ],
    "market": "National",
    "published": "Tue, 18 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-18T11:00:00+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/east-bay-architect-eyes-15-homes-next-to-war-memorial-in-lafayette/",
    "title": "East Bay architect wants to build 15 homes next to war memorial in Lafayette",
    "subhead": "Lara Dutto to preserve Lafayette Hillside Memorial from development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 8:22 PM",
    "pub_date_dt": "2025-03-17T20:22:00",
    "content": "Architect-turned-builder Lara Dutto plans to build 15 homes next to a war memorial of thousands of white wooden crosses in Lafayette.\nDutto, principal of Orinda-based Laraarchitecture, bought the\nLafayette Hillside Memorial\nat 3600 Deer Hill Road two years ago to save the 3.1-acre parcel from development,\nthe San Francisco Chronicle reported\n.\nNow Dutto, a professor of architecture at Diablo Valley College, has pitched a plan to develop 15 homes on the northern two-thirds of the site.\nShe wants to split off the southern portion to preserve the memorial conceived in 2006 by contractor Jeff Heaton as a “place to recognize, honor, and commemorate individual national service contribution” of those dying in the Iraq and Afghanistan wars.\nNonprofit Lafayette Hillside Memorial would continue to maintain the crosses.\n“Its scale and rawness and simplicity somehow makes me stop, forces me to take a deep breath, and in that moment I am so grateful for my freedoms,” she told the Chronicle.\nDutto, who has worked since 2010 to support the memorial and once sat on its board, grew concerned when the family that owned it put it up for sale, fearful that whoever bought it would remove the crosses. So she bought it in 2023 for an undisclosed price.\nPlans now call for preserving the memorial and half the property as open space, while building a subdivision of 15 single-family homes around a “village green,” with an outdoor cooking and dining area, according to the Chronicle.\nFive of the homes would have accessory dwelling units, or granny flats. The development would climb up the slope along Oak Hill Road, below a ridgeline of preserved open space.\n\nDutto has employed a state density bonus and Senate Bill 330 for streamlined approvals. On Monday, the Lafayette Planning Commission was slated to hold an informational hearing.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals.\nThe lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nMayor Susan Candell took issue with the lawsuit, according to the Chronicle, saying the City Council has approved all housing projects that have come before it. She said the city will have no choice but to approve the Deer Hill Road project.\nLafayette, a wealthy city with $2 million homes, was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nWithin a 10-year span, 115 homes were built in the city of 25,000 residents, including 10 in 2010, 76 in 2018 and 29 in 2019. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.lafayettehillsidememorial.org/",
      "https://www.sfchronicle.com/bayarea/article/housing-war-memorial-lafayette-20217913.php",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/"
    ],
    "market": "San Francisco",
    "published": "Tue, 18 Mar 2025 00:22:50 +0000",
    "published_dt": "2025-03-18T00:22:50+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/tampa/2025/03/17/developer-offers-260-million-for-tropicana-field/",
    "title": "$260M cash offer for Tropicana Field plays off Rays exit",
    "subhead": "Blake Investment Partners, unnamed firm offered $60M upfront to repair damage from Hurricane Milton ahead of MLB team’s 2028 lease expiration",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 7:12 PM",
    "pub_date_dt": "2025-03-17T19:12:00",
    "content": "A developer’s $260 million cash offer for the hurricane-beaten Tropicana Field is about $70 million less than what the city of St. Petersburg says it’s worth.\nBlake Investment Partners, a prominent local private equity firm, has teamed up with an unnamed “household” New York investment firm for the offer, setting the stage for a potential redevelopment of the Rays’ stadium, the Tampa Bay Business Journal\nreported\n.\nThe unsolicited offer comes after the Major League Baseball team exited a\nprevious $1.3 billion redevelopment deal\nwith Hines. The offer includes a $60 million upfront payment for urgent stadium repairs from damage caused by Hurricane Milton and a second installment following the expiration of the Rays’ lease in 2028.\nThe city previously valued the 86-acre site at $331 million ($3.8 million per acre), but Blake argued that hurricanes, rising interest rates and development constraints have lowered its market potential, estimating it could take a decade to maximize its value.\nBlake has also committed to having at least $500 million in vertical construction permitted and ready to start by the time the lease concludes.\n\nThe developer would parcel out the land and sell it to various developers, targeting high-end hotels, restaurants and architects to shape a “varied” mixed-use district, Blake said.\nThe offer is likely to trigger an open bid process, inviting competing proposals, with any final agreement requiring approval from the St. Petersburg City Council.\nBlake is also working with the city on preserving up to 15 acres for a park around Booker Creek and another 2 acres for an African American museum. He suggested Pinellas County could use tourist tax dollars to fund a future convention center.\nMeanwhile, the Rays are playing this season’s home games at Steinbrenner Field, the New York Yankees’ spring training stadium.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/tampabay/news/2025/03/13/tropicana-field-land-purchase-proposal.html",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/03/06/400-central-developer-talks-next-projects-rays-future/",
      "https://therealdeal.com/national/tampa/2024/06/14/tampa-bay-rays-1-3b-stadium-development-moves-forward/",
      "https://therealdeal.com/national/tampa/2025/02/11/bank-ozk-loans-182-million-for-tampas-gasworx-development/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 23:12:01 +0000",
    "published_dt": "2025-03-17T23:12:01+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/kb-home-pays-58m-for-office-to-resi-plan-in-san-ramon/",
    "title": "KB Home pays $58M to get into office-to-resi redevelopment in San Ramon",
    "subhead": "Developer plans to raze 276,000 sq building to make way for 190 townhomes, single-family homes in Bishop Ranch",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:32 PM",
    "pub_date_dt": "2025-03-17T18:32:00",
    "content": "KB Home has paid $57.8 million for a 276,000-square-foot building it wants to replace with 190 homes in San Ramon’s Bishop Ranch.\nAn affiliate of the Los Angeles-based developer paid cash for the three-story office building at 2527-2545 Camino Ramon,\nthe San Jose Mercury News reported\n.\nThe seller of the Bishop Ranch 7 building was locally based Sunset Development, the principal owner and developer of Bishop Ranch.\nThe deal works out to $209 per square foot.\nPlans by the developer include bulldozing the offices at Camino Ramon and Executive Parkway to clear the way for 190 homes.\nKB Home wants to develop\nBartlett\n, a walkable neighborhood on the north side of Bishop Ranch, according to the Mercury News.\nThe project would have 396,100 square feet of housing, including 118 townhomes and 72 single-family homes, according to a planning document. The detached homes would range from 1,800 to 2,400 square feet with three to four bedrooms and two and a half to three bathrooms, with two-car garages.\nRenderings by SDG Architects show gray and white townhouses surrounding green courtyards with jacaranda trees. The project would be built next to City Village, a\n404-unit project\nnow being built by SummerHill Homes, a local unit of Calabasas-based Marcus &amp; Millichap.\n\nCost and timeline for the KB Home development were not disclosed.\nSunset, owned by the Mehran family, wants to redevelop the\n585-acre office campus at Bishop Ranch into a retail village\nwith up to\n10,000 homes\n.\nThe developer’s CityWalk Master Plan, approved in 2020, would redevelop 135 acres with thousands of homes, a hotel, shops and restaurants in three distinct neighborhoods.\nThe master developer, led by Alex Mehran Jr., also plans to build another\n2,600 homes at the former Chevron headquarters\nat 6001 Bollinger Canyon Road, along with 125,000 square feet of open-air shops and restaurants and a 2.5-acre park. Sunset, which sold Chevron the land for its headquarters in 1981, bought it back in 2022 for $174.5 million.\nMehran told\nThe Real Deal\nthis month that Sunset had made random selections as to which offices would be torn down for homes.\n“I threw a dart at the wall,” he joked, explaining how he decided which of his family’s office properties should be razed to create 300,000 square feet of retail and entertainment options at Bishop Ranch’s CityCenter, which opened in 2018, and 8,000 planned homes.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/11/san-ramon-home-build-property-east-bay-office-economy-real-estate-jobs/",
      "https://sanramonca.iqm2.com/Citizens/FileOpen.aspx?Type=1&ID=3748&Inline=True",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/?firstLevel=sanfrancisco&secondLevel=2022&thirdLevel=01&fourthLevel=13&fifthLevel=summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon",
      "https://therealdeal.com/san-francisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://www.bishopranch.com/press/bishop-ranchs-first-batch-of-homeowners-move-in/",
      "https://therealdeal.com/sanfrancisco/2024/01/25/former-chevron-hq-to-become-housing-and-retail-in-east-bay/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/10/bishop-ranchs-transformation-with-sunset-development-ceo/",
      "https://therealdeal.com/san-francisco/2025/02/10/eden-housing-sunset-plan-200-affordable-units-in-san-ramon/",
      "https://therealdeal.com/san-francisco/2022/01/13/summerhill-homes-spends-108m-on-31-office-park-acres-in-san-ramon/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 22:32:51 +0000",
    "published_dt": "2025-03-17T22:32:51+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/mesirow-lists-apartment-complex-in-hot-suburban-chicago/",
    "title": "Tax stability, retail galore grease Mesirow’s multifamily listing",
    "subhead": "294-unit apartment complex hits market in Vernon Hills",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 6:24 PM",
    "pub_date_dt": "2025-03-17T18:24:00",
    "content": "Mesirow is betting on strong rental demand, tax certainty and proximity to redeveloping retail with the listing of a Vernon Hills apartment complex.\nThe Chicago financial services firm is selling its 294-unit apartment complex at 1155 Museum Boulevard in Vernon Hills, Crain’s\nreported\n. The asking price wasn’t disclosed. Mesirow purchased the complex in 2018 for $87.1 million, or $296,000 per unit, according to CoStar Group.\nThe seven-story complex, the Mil’Ton, is 94 percent occupied, with an average unit size of 1,117 square feet and average rents of $2,546 per month, or $2.28 per square foot. The rents range from about $2,500 to $3,800, according to listing sites.\nMesirow tapped CBRE brokers John Jaeger, Justin Puppi and Jason Zyck to market the property.\nThe apartments benefit from proximity to the Hawthorn Mall, which is undergoing a\n$252 million redevelopment\n, along with Mellody Farm, a 270,000-square-foot retail and residential center completed in 2019.\n\nRegency Centers’ Mellody Farm development has been so successful that Vernon Hills officials are\nlooking at early retirement for the tax increment financing district\ncreated for the area.\nSuburban rental demand is strong,\noutpacing the city core\neven as elevated interest rates have made commercial deals more challenging. Suburban Chicago rents rose 4.4 percent year over year in the fourth quarter to $2.09 per square foot, according to Integra Realty Resources.\nAnother potential draw for buyers is the complex’s “Non-Cook County tax certainty.” Mesirow secured an agreement with the local assessor that stabilizes the property’s assessed value at $77.3 million, with tax increases capped at 3 percent annually for the next three years.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/vernon-hills-apartment-complex-sale",
      "https://therealdeal.com/chicago/2022/09/14/vernon-hills-approves-second-phase-of-hawthorn-mall-plan/",
      "https://therealdeal.com/chicago/2024/04/04/tif-revenue-for-regency-centers-vernon-hills-project-skyrockets/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2024/01/21/mesirow-downsizes-chicago-hq-in-lease-extension/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 22:24:18 +0000",
    "published_dt": "2025-03-17T22:24:18+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/gehry-designed-office-building-proceeds-in-playa-vista/",
    "title": "Gehry-designed office building proceeds in Playa Vista",
    "subhead": "NSB’s plan for 196K sf project suffered 2020 legal setback",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:39 PM",
    "pub_date_dt": "2025-03-17T17:39:00",
    "content": "NSB Associates is back on track for an approved 196,000-square-foot office building designed by Frank Gehry in Playa Vista, which stalled four years ago because of a lawsuit.\nThe Beverly Hills-based developer was reapproved by the Los Angeles City Planning Commission to build the eight-story building at 12575 West Beatrice Street,\nUrbanize Los Angeles reported\n.\nThe offices, approved in 2017, were forced by a court to undergo further environmental review. This month, the Planning Commission approved the revised environmental impact report for the project known as New Beatrice West.\nPlans include 3,400 square feet of shops and restaurants. An existing office building, home to Gehry Partners, would be retained.\nThe U-shaped, 135-foot-tall project, designed by Gehry, will have upper level setbacks to create terrace decks.\nConstruction is expected to take 18 months. A project cost and when NSB is expected to break ground were not disclosed.\n\nKarney Management, a property owner nearby, had repeatedly appealed the office building to attempt to force the project to undergo further environmental review, without success.\nThe company led by Aliza Karney Guren\nsued the City of Los Angeles\nto block the project. In January 2020, a Los Angeles judge ruled that the mitigated negative declaration conducted for the project had not sufficiently considered impacts to aesthetics, noise and traffic congestion.\nAs a result, the Planning Department was forced to redo the environmental review process, although project entitlements were not overturned by the decision, according to Urbanize.\nNew Beatrice West is the second collaboration between Larry Field, founder of NSB Associates, and his longtime friend Frank Gehry. In 2023, NSB completed its two-building,\n80,000-square-foot offices\n, designed by Gehry,\nin El Segundo\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/city-planning-commission-signs-eir-gehry-designed-offices-12575-beatrice-street-playa-vista",
      "https://casetext.com/case/karney-mgmt-v-city-of-los-angeles",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://urbanize.city/la/post/gehry-designed-office-building-completed-el-segundo",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2017/03/20/jll-to-lease-nsbs-gehry-designed-creative-office-in-el-segundo/",
      "https://therealdeal.com/la/2016/04/13/playa-vista-is-getting-a-new-campus/",
      "https://therealdeal.com/la/2023/01/18/frank-gehry-project-with-approvals-for-sale-in-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:39:33 +0000",
    "published_dt": "2025-03-17T21:39:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/accesso-faces-dilution-in-69-million-chicagoland-debt-trouble/",
    "title": "Hamilton seeks workout for big office debt as Accesso bleeds equity",
    "subhead": "Minority owner of Esplanade building in Downers Grove is putting up capital to hang onto property as $69M debt transfers to special servicer",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 17, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-17T17:30:00",
    "content": "Hamilton Partners is maneuvering to save a struggling suburban Chicago office deal without getting much help from its distressed ownership companion, Accesso Partners, which faces foreclosures at a handful of properties in the area.\nItasca-based Hamilton is a minority owner of the Esplanade I, a 609,000-square-foot office complex at 2001 Butterfield Road in Downers Grove, a property that had its $69 million loan transferred last month to special servicer CW Capital, a sign of financial trouble for the landlord.\nAccesso, based in the Miami suburb of Hallandale Beach, has the larger ownership stake in the 19-story property of the two firms, but it’s either unable or unwilling to commit the capital necessary to work out the debt trouble alongside Hamilton, said Hamilton partner Ron Lunt.\nAs a result, Hamilton is seeking to delay the maturity of the property’s loan, which comes due in July of next year, and is starting debt workout talks with CW Capital around how to fund the costs of turning the property around, such as tenant allowances for workspace buildouts and leasing broker commissions, Lunt said.\n“We have some lease talks going, but if we’re going to spend a ton of money, we would like to work out an extension of some sort,” Lunt said. “Offices are low priority for lenders today, which is why you need to start the discussion early.”\nCW Capital declared the loan is headed toward “imminent monetary default,” although Lunt said the loan terms were only breached on a technicality because its previous loan servicer, Iowa-based Principal, was allowing rents to be collected and debt costs to be paid later in the month than the special servicer.\nCW is reviewing Hamilton’s request for a modification to the deal terms, and it’s unclear when it will come to a resolution. Accesso, meanwhile, will have its equity in the property diluted further with each dollar Hamilton kicks into the deal as it attempts to rescue the loan from the brink of distress, Lunt said.\nAccesso didn’t return requests for comment. It surrendered its office tower at 20 North Clark Street in the Chicago Loop to its lender earlier this year, and it is also facing a\n$75 million foreclosure at 200 West Monroe Street\n, which is next door to a property the firm previously sold at a major loss from its previous purchase price. Accesso made other\nsuburban office investments that recently ended up in foreclosure\n, too. The firm bought several of those properties from Hamilton, and entered the Esplanade deal in a 2015 joint venture.\nAccesso also lost a\nHouston office portfolio\nto financial distress last year.\n\nThe suburban Chicago property was appraised at $105 million ($172 per square foot) in 2016, when the joint venture’s commercial mortgage-backed securities loan was originated. That’s far more than what it’s likely worth today as interest rates and subdued demand from tenants have eaten into property values. The loan’s $57.3 million balance pencils out to $94 per square foot.\nThe property’s financial trouble was triggered in part by the 2023 exit of Hillshire Brands, an affiliate of Tyson Foods, that previously leased a 72,000-square-foot annex building that serves as a research and development facility on the Downers Grove campus.\nThat space hasn’t been refilled, and the asset is only 72 percent leased, about average for suburban Chicago office buildings amid one of the worst downturns of all time for the sector. The lackluster occupancy has sunk the property’s revenue to well below the level required to meet debt service obligations, public loan data shows.\nThe property’s debt-service coverage ratio was just 0.43 for 2024 through the end of September, loan data compiled by Morningstar Credit shows — anything less than 1.0 is below breakeven, meaning the Esplanade property was bringing in less than half the rent needed to cover its costs.\nStill, Hamilton is working with a brokerage team focused on food processing companies to help lease the space Hillshire vacated, with the hope it can get the deal back on track in time to dodge penalties with its lender.\nYet it’ll be vying for tenants with other office properties in the suburbs that have already been through foreclosure or deeply discounted sales in\nnearby suburban markets\n, allowing their buyers to offer lower rents in some cases, Lunt noted.\n“Major projects in\nSchaumburg\nhave gone through ownership changes and the bases are all reset, and it makes it tougher competition,” Lunt said.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/11/27/deutsche-files-75m-loop-foreclosure-against-accesso/",
      "https://therealdeal.com/chicago/2023/06/20/accesso-juggling-loan-deadlines-in-rough-suburban-office-market/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/",
      "https://therealdeal.com/chicago/2024/03/29/alfred-teo-buys-distressed-schaumburg-towers-near-chicago/",
      "https://therealdeal.com/chicago/2023/08/29/lender-slams-gluck-with-83m-schaumburg-office-foreclosure-suit/",
      "https://therealdeal.com/chicago/2025/01/10/accesso-partners-surrenders-chicago-office-tower-to-lender/",
      "https://therealdeal.com/chicago/2024/07/03/downers-grove-office-building-saddled-with-45m-delinquency/",
      "https://therealdeal.com/texas/houston/2024/12/13/accesso-partners-loses-devalued-houston-office-portfolio/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-17T21:30:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/former-kb-home-ceo-bruce-karatz-sells-flats-home-for-27m/",
    "title": "Former KB Home CEO lands $27M for Beverly Hills Flats manse",
    "subhead": "Deal marks yet another trade for city’s Flats neighborhood",
    "authors": "ByKari HamanakaResearch byAbigail Nehring",
    "pub_date": "Mar 17, 2025, 5:25 PM",
    "pub_date_dt": "2025-03-17T17:25:00",
    "content": "Former KB Home CEO Bruce Karatz inked a deal to sell his Beverly Hills mansion for $27 million as activity continues in the Flats.\nKaratz and his wife, socialite and philanthropist Lilly Tartikoff, sold 620 North Beverly Drive for about 17 percent less than the $32.5 million ask the home had when it went on the market in mid-October.\nA limited liability company registered with a Westlake Village address is the buyer, according to property and state records.\nThe nine-bedroom, eight-bathroom home totals 10,554 square feet. Built in the 1920s, the traditional-style home sits on nearly an acre.\nIt has a screening room, library, pool house, tennis court, two-bedroom guest house and was renovated by acclaimed architect Paul Williams.\nCarolwood Estates’\nDrew Fenton\nlisted the property, while The Beverly Hills Estates’\nJack Harris and Michael Fahimian\nrepresented the buyer.\n\nThe Beverly Drive estate is the latest move in a steady flow of activity in Beverly Hills’ Flats neighborhood.\nLast month, the home at\n622 North Elm Drive\nsold for $19.9 million. It was a quick trade with the home on the market for less than a month and purchased by a trust tied to accountant Marc Sniderman and Michael Karlin, a business manager for celebrities and other high-profile clients.\nIn January TV executive\nDavid Salzman\nsold his former home at 702 North Sierra Drive for $17 million.\nInventory in the Flats has also seen a boost.\nCompass’ Josh Flagg listed the\nGloria Vanderbilt estate\nat 719 North Maple Drive for $16.5 million in late January. About two weeks later the home went into contract.\nFormer supermodel\nChristina Estrada\nlisted her home at 722 North Maple Drive earlier this month, with an asking price currently at $24 million — $2 million less than the original ask.\nHasbro CEO\nBrian Goldner and his wife Barbara Goldner lopped some off the asking price at 610 North Canon Drive. The couple placed the home on the market for $27 million in December and last month reduced it to $23.5 million.\n",
    "related_links": [
      "https://therealdeal.com/magazine/august-2024/how-las-boutique-brokerages-juggle-closing-deals-with-managing-the-business/",
      "https://therealdeal.com/la/2024/10/21/meet-las-youngest-team-of-luxury-home-mega-brokers/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/fresh-prince-producers-beverly-hills-home-sells-for-17m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/01/06/beverly-hills-manse-owned-by-late-hasbro-ceo-lists-for-27m/",
      "https://therealdeal.com/la/2025/03/03/model-christina-estrada-lists-beverly-hills-villa-for-26m/",
      "https://therealdeal.com/la/2025/02/14/beverly-hills-flats-manse-on-elm-drive-sells-for-20m/",
      "https://therealdeal.com/la/2025/01/30/gloria-vanderbilt-estate-asks-16m-in-beverly-hills/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 21:25:20 +0000",
    "published_dt": "2025-03-17T21:25:20+00:00",
    "author": "Kari Hamanaka, Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/jim-halperin-pitches-tower-to-replace-dallas-strip-mall/",
    "title": "Jim Halperin pitches resi tower to replace Oak Lawn strip mall",
    "subhead": "Local stakeholders support rezoning for development plan, which includes retail",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 5:11 PM",
    "pub_date_dt": "2025-03-17T17:11:00",
    "content": "A Dallas developer’s plans to transform an Oak Lawn strip mall into a mixed-use development received a warm welcome from local stakeholders.\nJim Halperin, co-founder of Irving-based Heritage Auctions, envisions a 24-story residential tower and upscale restaurants at 2615 Oak Lawn Avenue, which the Oak Lawn Committee gave unanimous support, the Dallas Business Journal\nreported\n.\nThe proposal aims to reshape a corner that could be a key gateway into the neighborhood. The 1.93-acre property has been owned by the Halperin family for the past 19 years.\nThe development would feature 310 residential units covering about 40 percent of the site, while the remainder will focus on open space, pedestrian-friendly amenities and two or three restaurants, some spanning multiple levels with roof terraces. GFF Design is attached to the project.\nTenants of the strip mall include Open Sesame Lebanese Grill, whose owners have been in discussions with Halperin about remaining in the neighborhood, though whether it stays on-site or relocates is still undecided.\n\nThe project’s design takes a cue from the Old Parkland campus redevelopment by Crow Holdings at 3819 Maple Avenue, which GFF CEO Evan Beattie called “transformational” for the neighborhood.\nThe redevelopment requires rezoning, which could take up to two years to finalize.\nThe project is set to add to the wave of redevelopment reshaping Oak Lawn, a neighborhood known for its nightlife and identity as the heart of Dallas’ LGBTQ+ community.\nSeveral office and residential developments are underway nearby, like McCourt Partners and HN Capital Partners’ 40-acre mixed-use development at\n1650 Oak Lawn Avenue\nas well as\nThe Oak Lawn Design Plaza\n, covering nine acres at 1444 Oak Lawn Avenue from Charlotte, North Carolina–based investor Asana Partners.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/oak-lawn-avenue-strip-mall-redevelopment-plans.html",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/",
      "https://therealdeal.com/texas/dallas/2025/02/13/henry-s-miller-clears-hurdle-for-controversial-mixed-use-plans/",
      "https://therealdeal.com/texas/dallas/2024/12/12/mccourt-hn-capitals-mixed-use-vision-for-design-district/",
      "https://therealdeal.com/texas/dallas/2024/07/18/asana-partners-spending-27m-on-dallas-retail-redevelopment/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 21:11:33 +0000",
    "published_dt": "2025-03-17T21:11:33+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/trust-buys-estates-at-acqualina-condo-for-25m/",
    "title": "Trust buys Estates at Acqualina condo for $25M, adding to slew of pricey deals",
    "subhead": "Unit spans 9,100 sf with six bedrooms, hit market for nearly $28M in November",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 17, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-17T17:00:00",
    "content": "A trust bought a 9,100-square-foot Estates at Acqualina condo for $25 million, marking the latest pricey closing in the oceanfront luxury complex.\nRecords show Casa Numa Land Trust bought unit 4701/4702 in the north tower at 17975 Collins Avenue from an affiliate of Jules and Eddie Trump’s development firm, Trump Group. The Trumps have no relation to President Donald Trump.\nMichael Goldstein with Acqualina Realty had the listing, and Liz Hogan and Ben Moss with Compass brought the buyer.\nThe condo has six bedrooms and seven bathrooms and sold fully furnished, according to the listing.\n\nEstates at Acqualina\nis an oceanfront luxury condo complex that includes a 52-story, 94-unit north tower and a 49-story, 154-unit south tower. The towers have lobbies designed by the late Karl Lagerfeld, 45,000 square feet of amenities that include a bowling alley, ice skating rink and a movie theater, and the restaurant Avra Miami Estiatorio.\nThe Trump brothers started construction on the $1.8 billion project in 2018. Years of construction delays culminated in litigation between the Trumps and their general contractor, Suffolk Construction, that resulted in\nthe developer firing Suffolk\nfrom the project in 2023.\nClosings began in 2022, with some notable buyers like\nLeBron James\n,\nKimber gunmaker Leslie Edelman\nand\nEuropean Wax Center co-founder Joshua Coba\ndropping millions on Estates at Acqualina condos.\nMore recently, a trio of pricey deals closed in September. A trust linked to Iranian-Canadian billionaire Michael Latifi bought\na penthouse for $26 million\n. The heads of Mexico’s largest real estate investment trust, Fibra Uno, bought a unit for\n$20 million\n. A different trust bought a condo for\n$16.9 million\n.",
    "related_links": [
      "https://therealdeal.com/tag/estates-at-acqualina/",
      "https://therealdeal.com/miami/2023/07/07/estates-at-acqualina-developer-fires-general-contractor/",
      "https://therealdeal.com/miami/2022/10/19/lebron-james-buys-oceanfront-sunny-isles-condo/",
      "https://therealdeal.com/miami/2022/12/08/kimber-gunmaker-buys-estates-at-acqualina-condo-for-21m/",
      "https://therealdeal.com/miami/2024/05/16/european-wax-center-co-founder-buys-sunny-isles-beach-condo/",
      "https://therealdeal.com/miami/2024/09/26/trust-tied-to-michael-latifi-buys-26m-estates-at-acqualina-ph/",
      "https://therealdeal.com/miami/2024/09/10/mexican-reit-bosses-buy-20m-estates-at-acqualina-condo/",
      "https://therealdeal.com/miami/2024/09/30/trust-buys-estates-at-acqualina-condo-for-17m/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-17T21:00:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/new-york/tristate/2025/03/17/beechwood-bogs-down-plans-in-kings-park/",
    "title": "Beechwood slims down Kings Park plans",
    "subhead": "Developer cuts more than 100 units from planned condo community",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:36 PM",
    "pub_date_dt": "2025-03-17T16:36:00",
    "content": "The Beechwood Organization is not abandoning its plans for Kings Park, but it is cutting them down significantly.\nThe Long Island-based developer is pitching a 288-unit community for Country Pointe Estates at Kings Park in Suffolk County, Newsday\nreported\n. That’s a significant retrenchment from the\n391-unit project proposed\ntwo years ago.\nMichael Dubb’s firm capsized the unit count amid concerns from the community, which Dubb said was a voluntary decision. The $220 million project now comprises 53 single-family homes, 153 townhomes and 82 villas, 29 of which would be set aside for affordable housing.\nThe development is still set to unfold on a property at the corner of Old Northport and Lawrence roads, previously home to a concrete manufacturing and sand mining operation. It also complies with Smithtown’s Comprehensive Plan.\nBut opposition remains. The president of the Kings Park Community Association says the group remains concerned the development is too large and that the reduction in size will simply open the door for other developers to increase the size of their own adjacent projects. He added the project “provides no discernible benefits to the community.” Concerns also include the area’s environment, drinking water, traffic and schools.\n\nBeechwood is building a wastewater sewage treatment plant in conjunction with the Country Pointe Estates. The development is still a long way off; Dubb is hoping to secure all approvals by 2027 and complete work on the development by 2030.\nKings Park is home to several sizable projects, creating concerns for some community members about overdevelopment. Smithtown is creating a comprehensive master plan for Kings Park’s downtown development.\nDespite concerns about overdevelopment, there’s also a need to update the housing stock in the hamlet; the Country Pointe Estates project could increase the number of units in the hamlet by 4.4 percent alone, according to project consultants.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.newsday.com/long-island/towns/country-pointe-kings-park-iw8ttud6",
      "https://therealdeal.com/new-york/tristate/2023/03/13/beechwood-planning-391-unit-condo-community-in-kings-park/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/tristate/2023/03/13/beechwood-planning-391-unit-condo-community-in-kings-park/",
      "https://therealdeal.com/new-york/tristate/2024/11/18/beechwood-pitches-400m-plan-to-revive-mastic-beach/",
      "https://therealdeal.com/new-york/tristate/2023/09/21/court-shoots-down-southamptons-fee-imposed-on-beechwood/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 20:36:17 +0000",
    "published_dt": "2025-03-17T20:36:17+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/drw-holdings-founder-sells-lakefront-mansion-for-7-million/",
    "title": "DRW Holdings founder banks profit in $7M sale of lakefront mansion",
    "subhead": "Beachfront home in Michigan’s Harbor Country scored while sellers often take price cuts in Chicago’s luxury market",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Real estate heavyweight Don Wilson Jr. turned a tidy profit on a lakefront property he bought five years ago.\nThe founder and CEO of DRW Holdings sold his mansion at 16096 Lake Avenue in Union Pier, Michigan, for $7 million in one of the region’s biggest deals of last year, the Chicago Tribune\nreported\n.\nThe 10,750-square-foot home sold for $651 per square foot; Wilson bought it for $4.05 million ($377 per square foot) in 2020.\nHarbor Country has become a sought-after vacation and second-home destination for Chicagoans.\nAt least one off-market deal in nearby New Buffalo topped $8.5 million last year, but Wilson’s sale is believed to be one of the highest publicly listed sales in the area recently.\nThe region has long been a favored retreat for Chicagoans due to its proximity — just over an hour’s drive from the city. But\ndemand for vacation homes in the area\nhas surged in recent years, with limited inventory and rising prices proving its value as a second-home market.\nThe median listing home price in Union Pier, for example, jumped 50.6 percent year over year in February to $1.3 million,\naccording to Realtor.com\n.\n\nThe 28,000-square-foot property has 99 feet of Lake Michigan frontage. Built in 2007, the home has eight bedrooms, six full bathrooms, a wine cellar, a 12-seat theater, a gym and a lake-facing deck with a pool.\nElizabeth Roch and Toni Philander Morris of @properties Christie’s International Real Estate had the listing. The buyer was represented by @properties Christie’s agent Janice Smith.\nWilson listed the home for $9.2 million in 2023 before cutting the asking price to $8.5 million later that year. The buyer’s identity is hidden by a Delaware LLC that owns homes in Chicago suburb Oak Park and Palm Beach, Florida.\nWilson owns a Lincoln Park mansion and is\nstill marketing\nhis Wicker Park residence at 1407 North Hoyne Avenue for $6 million after extensive renovations that combined the historic property with an adjacent coach house. He listed the Wicker Park mansion for almost $7 million in 2023.\nWilson manages broad real estate interests, including projects led by Convexity Properties, DRW’s real estate arm. Convexity is known for redeveloping Chicago landmarks like the\nRobey Hotel\nand the Three Arts Club.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagotribune.com/2025/03/14/drw-holdings-michigan/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://www.realtor.com/realestateandhomes-search/Union-Pier_MI/overview",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2018/09/12/new-union-station-plan-ditches-apartments-adds-retail-and-park/",
      "https://therealdeal.com/chicago/2023/07/17/historic-wicker-park-mansion-listed-for-7m/",
      "https://therealdeal.com/chicago/2024/08/16/luxury-agents-explain-second-home-market-in-chicagoland/",
      "https://therealdeal.com/chicago/2024/05/02/goodman-scores-17m-to-replace-don-wilson-development-site-debt/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/17/figure-ai-leases-99k-sf-for-new-san-jose-headquarters-plant/",
    "title": "Figure AI leases 99K sf for new headquarters plant in San Jose",
    "subhead": "Humanoid robotics firm nearly quadruples base in move from Sunnyvale",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-17T16:00:00",
    "content": "Figure AI has moved its headquarters to San Jose from Sunnyvale, nearly quadrupling the size of its office and manufacturing hub.\nThe artificial intelligence robotics firm now occupies a 98,700-square-foot industrial flex building at the Assembly at North First tech campus at 3960 North First Street,\nthe SiliconValley.com reported\n.\nTerms of the lease with landlord EQT Exeter, based outside of Philadelphia, were not disclosed.\nFigure AI’s former Sunnyvale office totaled 27,900 square feet, according to LoopNet.\nIts new “robot campus” in San Jose will support “manufacturing, fleet operations and overall engineering/design build-out,” Brett Adcock, founder and CEO Figure AI, said on his LinkedIn page.\nThe headquarters sits next to the\nhub for Logitech\nwithin the six-building Assembly at North First complex once occupied by Lam Research, a semiconductor firm.\n\nIn 2021, EQT Exeter bought the 27-acre, 489,100-square-foot  campus for\n$192 million\n, or $393 per square foot, according to\nThe Real Deal\n. The campus, built in 1984, was renovated in 2018, according to Loopnet.\nFigure AI is working to “bring humanoid robots into commercial operations,” according to Adcock.\nIn February last year,\nFigure AI landed $675 million through a capital raise\nfrom Microsoft, OpenAI Startup Fund, Nvidia, Amazon founder Jeff Bezos, Parkway Venture Capital, Intel Capital and others.\nEQT Exeter, founded in 2006 as Exeter Property Group, has more than $30 billion in assets under management, including more than 2,000 properties and 375 million square feet of warehouses, office and life sciences buildings and homes, according to its website.\nIn early 2021, Swedish private equity manager EQT AB acquired Exeter Property Group and renamed it EQT Exeter, which serves as its real estate arm.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.siliconvalley.com/2025/03/11/san-jose-ai-artificial-intelligence-robot-jobs-work-tech-build-property/",
      "https://www.mercurynews.com/2025/03/07/san-jose-logitech-bay-area-tech-jobs-economy-silicon-valley-computer/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://www.prnewswire.com/news-releases/figure-raises-675m-at-2-6b-valuation-and-signs-collaboration-agreement-with-openai-302074897.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2021/10/01/eqt-exeter-buys-north-san-jose-office-and-research-campus-for-192m/",
      "https://therealdeal.com/san-francisco/2025/03/07/super-micro-to-forge-ahead-with-north-san-jose-tech-campus/",
      "https://therealdeal.com/national/phoenix/2025/03/12/kenco-takes-up-642k-sf-warehouse-outside-phoenix/"
    ],
    "market": "San Francisco",
    "published": "Mon, 17 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-17T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/habitus-capital-nabs-approval-for-61-key-edgewater-hotel/",
    "title": "Habitus scores approval for 61-key hotel in Miami’s Edgewater, ramping up its South Florida hospitality investment",
    "subhead": "Renderings show the planned eight-story project to be branded by Sonder",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 17, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-17T15:30:00",
    "content": "Habitus Capital scored approval for a 61-key boutique hotel in Miami’s Edgewater, marking the firm’s continued investment in South Florida’s hospitality market.\nBrickell-based Habitus plans the eight-story building on a 0.2-acre lot at 459 Northeast 25th Street with 20 on-site parking spaces and two street parking spaces, according to a Miami City Commission agenda item. Renderings show the Sonder hospitality firm branding the project.\nCommissioners unanimously voted for the project at their meeting on Thursday. The resolution grants exceptions to Miami’s zoning code, allowing Habitus to develop half the required parking spaces and 10 percent less than mandated open space. Also, the vote allows a 10 percent reduction in the façade’s length.\nThe development firm paid $2 million for the 0.2-acre site in 2022, according to property records. The property now has a two-story, three-unit apartment building.\nHabitus –– led by Mauricio Magaña, Daniel del Rio and Pablo Ramos –– has developed more than 20 projects in Mexico City and now is focused on South Florida, its website shows.\n\nIt has at least two other hotel investments in the tri-county region.\nIn Miami’s Brickell, it plans an\neight-story, 40-key hotel\nat 511 Southwest Second Avenue. In August, Habitus paid\n$16.2 million\nfor the six-story, 110-key B&amp;B Hotel Miami Airport at 5125 Northwest 36th Street in Miami Springs.\nElsewhere in\nEdgewater\n, a\nhotel\ncould be in the works for the site at 2501 Biscayne Boulevard. Last year, New York hotel developer Harry Gross’ G Holdings bought the property for\n$28.5 million\n. Also last year. Peruvian developer William Ticona paid\n$15.1 million\nfor a 0.8-acre vacant property at 404- 436 Northeast 35th Street in Edgewater, which could be developed with 248 hotel keys under current zoning.\nIn other recent hotel proposals, Stephen Palmese’s Integritas Capital proposes a 57-story tower with 550 apartments and a\n253-key hotel\nat 111 Southwest Third Avenue in Fort Lauderdale.\n",
    "related_links": [
      "https://therealdeal.com/miami/2023/10/24/habitus-capital-scores-approval-for-40-key-brickell-hotel/",
      "https://therealdeal.com/miami/2024/08/09/bb-hotels-mhg-hotels-buy-separate-south-florida-properties/",
      "https://therealdeal.com/tag/edgewater/",
      "https://therealdeal.com/tag/hotels/",
      "https://therealdeal.com/miami/2024/01/19/infinity-sells-miami-dev-site-to-harry-gross-g-holdings/",
      "https://therealdeal.com/miami/2024/11/01/peruvian-developer-william-ticona-buys-edgewater-dev-site/",
      "https://therealdeal.com/miami/2025/03/04/integritas-capital-plans-fort-lauderdale-hotel-rentals-tower/",
      "https://therealdeal.com/miami/2025/02/19/wills-partners-launch-sales-for-islamorada-resort-villas/",
      "https://therealdeal.com/miami/2025/02/18/keyah-real-estate-group-gains-approval-for-new-miami-beach-hotel/",
      "https://therealdeal.com/miami/2025/02/12/wynwoods-moxy-hotel-secures-new-partner-and-36m-loan/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-17T19:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/17/dallas-mushroom-house-at-risk-under-car-dealers-ownership/",
    "title": "Highland Park “Mushroom House” at risk under Clay Cooley ownership",
    "subhead": "Car dealer and wife bought iconic property, two adjacent historic homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:20 PM",
    "pub_date_dt": "2025-03-17T15:20:00",
    "content": "The future of Dallas’ iconic “Mushroom House” is uncertain after car dealer Clay Cooley acquired the home along with two adjacent Highland Park properties, sparking speculation about potential teardowns.\nThe house at 4200 Armstrong Parkway, known for its curved design and green-blue copper roof, is one of three multimillion-dollar mansions Cooley and his wife, Lisa, own at Armstrong Parkway and Bordeaux Avenue, The Dallas Morning News\nreported\n. The other two are at 4208 Armstrong Parkway and 4209 Bordeaux Avenue.\nThe couple’s plans for their 2.5 acres of prime properties are a mystery. They haven’t commented, but it’s led to questions about whether the unique home, and the historic residences next to it, will survive or be cleared to make way for new construction.\nThe Cooleys haven’t filed any demolition or major renovation permits, though plumbing and mechanical permits were submitted for two of the properties. Preservationists are hopeful that at least the 1920s Tudor-style home on Bordeaux, designed by famed architect Hal Thomson, will be spared.\nThe group Preservation Park Cities recently toured two of the homes but wasn’t allowed inside 4208 Armstrong Parkway due to structural concerns.\nClay Cooley attended a Preservation Park Cities meeting in February, where he expressed a desire to avoid community conflict. Preservationists suggested a design that would retain the Bordeaux home as a guesthouse while allowing for a new build on the Armstrong lots.\n\nThe couple bought the home at 4208 Armstrong Parkway first, in 2020, county records show. They then purchased 4209 Bordeaux Avenue and the Mushroom House in a five-month period, transferring them into their name by December 2024.\nThe Mushroom House, completed in 1997 by Dallas architect Tom Workman, has long divided opinion for its whimsical, storybook-like design. Its price history is unavailable, but its market value is estimated at over $7.5 million, according to Zillow.\nPreservationists admit that while the house is architecturally significant, it may be less defensible due to its modern construction and location on a highly visible lot.\nLocal ordinances also complicate the equation. Highland Park rules prohibit combining all three parcels into a single lot, which could influence Cooley’s final decision.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/real-estate/2025/03/13/dallas-car-man-snaps-up-three-highland-park-mansions-but-his-plans-remain-unclear/",
      "https://therealdeal.com/",
      "https://therealdeal.com/texas/dallas/2025/02/21/home-in-dallas-preston-hollow-listed-for-13-7-million/",
      "https://therealdeal.com/texas/dallas/2025/01/06/dallas-most-expensive-home-listings-of-2024/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 19:20:34 +0000",
    "published_dt": "2025-03-17T19:20:34+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/whats-smaller-than-a-bungalow-small-lot-homes-on-melrose/",
    "title": "What’s smaller than a bungalow in East Hollywood?",
    "subhead": "Aaron Belliston-led affiliate plans to convert century-old apartments into small-lot homes on Melrose",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-17T15:00:00",
    "content": "Melrose Ten wants to turn century-old bungalow apartments in East Hollywood into single-family homes and a duplex.\nThe North Hollywood-based limited liability company led by Aaron Belliston has filed plans to convert the 1920s bungalow court at 4061-4069 West Melrose Avenue,\nUrbanize Los Angeles reported\n. No demolition or new construction are in the works.\nInstead, the owner of the property wants to convert the historic bungalows into single-family homes through a Los Angeles small lot subdivision ordinance.\nThe application said the Belliston affiliate wants to create nine single-family homes and one duplex, not far from Vermont Avenue and Los Angeles City College.\nThe potential increase in value to the property was not disclosed. It’s also not clear when the Belliston affiliate bought the property, and for how much.\n\nThe bungalow court, built in 1923 on a third of an acre in Virgil Village, was once listed for $211,500 per unit, or $2.1 million, according to a 2023 Marcus &amp; Millichap\nmarketing brochure\n.\nAnother small lot subdivision has been\nproposed nearby at 627 North Juanita Avenue\n, where Scott Barth of Barth Partners plans to build 10 townhomes on a vacant lot, according to Urbanize.\nBelliston is president of BMR Enterprises, a vertically integrated real estate firm based at the same North Hollywood address as Melrose Ten, according to state business records.\nMembers of the Melrose Ten LLC include Encino-based Bow Hunter Development, Prosper Fund, based in North Hollywood and Mark Priceman of Valley Village.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/bungalow-court-4061-w-melrose-ave-be-converted-small-lot-homes",
      "https://app.box.com/s/v556o0mu5bfqzzwof8us2dqjzdzgi7qy",
      "https://la.urbanize.city/post/10-townhomes-planned-627-n-juanita-avenue-east-hollywood",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/11/14/advanced-properties-eyes-51-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/12/20/category-plans-145-affordable-apartments-in-east-hollywood/",
      "https://therealdeal.com/la/2024/10/07/nba-stars-pitch-affordable-housing-in-east-hollywood/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-17T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/17/brookfield-takes-100m-hit-on-garment-district-office/",
    "title": "Brookfield takes $100M hit on Garment District office",
    "subhead": "Firm sells 333 West 34th Street for only $150M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:45 PM",
    "pub_date_dt": "2025-03-17T14:45:00",
    "content": "Brookfield chief executive officer Bruce Flatt once\nreferred to the office market\nas a “tale of two cities.” Today, that city is looking awfully unforgiving to the asset manager.\nBrookfield sold the office property at 333 West 34th Street in the Garment District for $150 million, PincusCo\nreported\n, using an affiliate in the transaction. The deal was signed at the start of the year and closed a week ago.\nThe buyer used a limited liability company of its own to obscure its identity, but the entity appears to share an address with another well-known landlord, Taconic Partners, which also owns the neighboring property to the west of the asset. A representative for Taconic, however, denied the firm’s involvement to\nThe Real Deal\n.\nA representative for Brookfield also did not immediately respond to a request for comment from\nThe Real Deal\n.\nThe sale of the 287,000-square-foot office property works out to $523 per square foot. That’s a small gain on the price per buildable square foot Brookfield paid New York REIT for the property in 2018, but not on the price per built square foot: Brookfield sold the property for more than $100 million less than\nthe $255 million\nit paid for the property seven years ago.\nTenants at the 10-story building include the Metropolitan Transportation Authority, Sam Ash Music and Godiva Chocolatier. The MTA leases at least 100,000 square feet, according to\nCompStak\n, and is on a lease that isn’t set to expire until 2035.\n\nIt’s unclear who brokered the transaction for either side.\nThe Garment District has been trimming the spirits of office landlords lately. A couple of weeks ago, Bahrain-based Investcorp took a hit on a pair of buildings in the neighborhood, selling them to Josh Rahmani’s Empire Capital Holdings\nfor at least 68 percent below\nwhat it paid for them less than a decade ago.\nBrookfield’s office luck has been a mixed bag of late, landing big leases but also facing serious distress. This month, the investor positioned itself to\nbuy a $93 million delinquent loan\non a distressed office building in San Francisco, which would allow the firm to ultimately take control of Vanbarton Group’s 22-story property.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://therealdeal.com/national/2023/02/24/cre-market-is-in-a-tale-of-two-cities-brookfield-ceo/",
      "https://www.pincusco.com/brookfield-sells-286k-sf-office-building-in-garment-district-for-150m/",
      "https://therealdeal.com/new-york/2017/11/09/brookfield-buying-new-york-reits-333-west-34th-for-255m/",
      "https://property.compstak.com/333-West-34th-Street-New-York/p/81",
      "https://therealdeal.com/new-york/2025/03/03/investcorp-takes-bath-in-garment-district-office-short-sale/",
      "https://therealdeal.com/san-francisco/2025/03/06/brookfield-doubles-down-on-troubled-office-building-in-sf/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2023/02/24/cre-market-is-in-a-tale-of-two-cities-brookfield-ceo/",
      "https://therealdeal.com/new-york/2025/03/03/investcorp-takes-bath-in-garment-district-office-short-sale/",
      "https://therealdeal.com/san-francisco/2025/03/06/brookfield-doubles-down-on-troubled-office-building-in-sf/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 18:45:00 +0000",
    "published_dt": "2025-03-17T18:45:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/17/chicagos-tax-assessor-corrects-massive-undervaluation/",
    "title": "Cook County corrects tax roll error after $444M undervaluation",
    "subhead": "Assessor reclassified hundreds of properties, owners hit with steep back taxes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:33 PM",
    "pub_date_dt": "2025-03-17T14:33:00",
    "content": "Cook County Assessor Fritz Kaegi has fixed hundreds of property misclassifications after a months-long audit, but questions remain over how many errors are still unresolved.\nAt least 620 properties were\nmisclassified or undervalued\nduring the 2023 tax year, resulting in an estimated $444 million in missed taxable value.\nThe assessor’s office has since corrected 491 of those errors, adding nearly $489 million in taxable value to county rolls — about 17 percent of the new construction value added countywide in 2023, the Chicago Tribune\nreported\n. An investigation by Illinois Answers and the outlet reported the misclassified properties last year.\nStill, 129 properties identified in the investigation remain incorrectly classified, with fixes delayed due to a backlog at the Cook County Board of Review and what Kaegi’s office described as “quirks in the tax calendar.”\nThe office also blamed inconsistent permit data from local municipalities as a key factor behind delayed corrections.\nThe misclassifications carried major financial consequences.\nSome homeowners, like those in suburban Lynwood, have already received back tax bills as high as $23,000 after belated reassessments. State law allows for up to three years of back taxes, though Kaegi’s office maintains that it won’t issue back taxes in cases where it failed to act on construction permits it had on file.\nIn 46 out of 55 back-taxed cases, Kaegi’s office did have relevant permit information, but missed it.\n\nMany affected properties were either new construction or had undergone significant renovations, but the assessor’s records failed to reflect those changes. In some cases, properties were still being taxed based on outdated classifications.\nFor instance, a home in Gilmore Park built in 2021 and sold for $843,000 continued to be assessed as a vacant lot, with its value listed at less than $45,000.\nKaegi’s office has since hired a dozen more staffers, including two permit specialists and 10 field inspectors, and promoted a veteran staffer to oversee data integrity. The office also plans to launch a sales validation team this year to help catch discrepancies, such as multimillion-dollar sales on properties incorrectly recorded as vacant.\nKaegi is pushing for broader systemic changes.\nLast week, he\ncalled on the Federal Housing Finance Agency\nto release appraisal data from Fannie Mae and Freddie Mac to local assessors. Kaegi argued that access to this data —\ncurrently restricted\n— would help improve the accuracy of property assessments, particularly in addressing long-standing issues like regressivity, where lower-value homes are often over-assessed relative to their market value. His office released a public dataset on Monday morning with building permits submitted to the office by municipalities, another bid to bring transparency to the process.\nCritics argue the long delays and lingering errors undermine confidence in Cook County’s property tax system — especially when homeowners can be hit with massive, unexpected tax bills for mistakes they had no hand in.\nKaegi’s office is reviewing the 46 back tax bills for errors, as delays in delivering the permits to the assessor’s office can slow its ability to make corrections, a spokesperson said.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://www.chicagotribune.com/2025/03/16/cook-county-assessor-fixing-mistakes-misclassified-properties/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/",
      "https://therealdeal.com/chicago/2024/08/05/chicago-property-tax-assessors-mistakes-left-444m-undervalued/",
      "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
      "https://therealdeal.com/national/2025/03/05/new-names-on-fannie-maes-blacklist/"
    ],
    "market": "Chicago",
    "published": "Mon, 17 Mar 2025 18:33:56 +0000",
    "published_dt": "2025-03-17T18:33:56+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/17/dallas-officials-make-another-pitch-to-keep-neiman-marcus/",
    "title": "Dallas makes last-ditch pitch to keep Neiman Marcus downtown",
    "subhead": "City manager tells parent company that “financially beneficial” offer is on the table",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:26 PM",
    "pub_date_dt": "2025-03-17T14:26:00",
    "content": "Dallas officials are mounting a last-ditch effort to stop the clock on Neiman Marcus’ closure of its downtown flagship store at 1618 Main Street.\nCity Manager Kimberly Bizor Tolbert and the Dallas Consortium, a coalition of city and business leaders, requested a meeting with executives from the brand’s parent company, Saks Global, within the next week to pitch their plan, The Dallas Morning News\nreported\n.\nThe letter, addressed to Saks Executive Chairman Richard Baker, said the city has crafted a “financially beneficial” offer that would support both Neiman Marcus’ brand and its ties with Texas clientele.\nSaks, which acquired Neiman Marcus last year for $2.7 billion, previously\nannounced the store’s closure\nby March 31, citing a dispute with landlord Slaughter Partners as a barrier to remaining open. But earlier this month, Dallas officials resolved that problem by securing the deed for the disputed portion of the property.\nThe company, however, has held firm, stating the\ndecision to close is “final”\nand that the situation is “far more complicated than what the public is being led to believe.” Saks has also said its attempts to meet with city officials have been rejected.\n\nIt remains uncertain whether the city’s proposed deal is enough to prompt reconsideration, or even a temporary extension of operations. Tolbert’s letter asked for a response to “the collective group,” and said Neiman Marcus would have time to “capture the opportunity we wish to discuss” if the company keeps the store open for a few months longer.\nAlong with the store, Neiman Marcus also plans to vacate its 82,000-square-foot headquarters in NexPoint’s 42-story Cityplace Tower at 2711 North Haskell Avenue.\nThe looming closure threatens to leave a major gap in the city’s downtown retail landscape and in the historic character of Dallas. Neiman Marcus has operated its flagship store for more than a century, serving as an anchor for the district’s identity and economic activity.\nThe consortium is holding out hope of avoiding the significant loss to the city’s downtown core, while Saks is investing $100 million into its Neiman Marcus store at NorthPark Center.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/retail/2025/03/14/dallas-dangles-financially-beneficial-opportunity-to-keep-neiman-marcus-downtown/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/2025/03/05/saks-to-close-historic-neiman-marcus-store/",
      "https://therealdeal.com/texas/dallas/2025/02/18/hudson-bay-company-slashes-neiman-marcus-dallas-presence/",
      "https://therealdeal.com/texas/dallas/2022/07/29/neiman-marcus-corporate-hub-project-lands-at-cityplace-tower/"
    ],
    "market": "Texas",
    "published": "Mon, 17 Mar 2025 18:26:41 +0000",
    "published_dt": "2025-03-17T18:26:41+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/17/government-reverses-hundreds-of-lease-terminations/",
    "title": "You’re (not) fired: Government reverses hundreds of lease terminations",
    "subhead": "Why the Trump admin is tweaking its office downsizing plan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 2:09 PM",
    "pub_date_dt": "2025-03-17T14:09:00",
    "content": "At first, the federal government met resistance in\ncutting\nits real estate footprint. In more than 100 cases, it’s reversing its planned terminations.\nThe General Services Administration, which manages the government’s real estate holdings, is backtracking on the cancellation of 117 leases, the New York Times\nreported\n. Among the spaces getting a reprieve are an Energy Department office in New Mexico that manages a nuclear waste repository and an office used by the U.S. Army Corps of Engineers for hurricane response in Florida.\nLawmakers and agency officials have worked to slow or stop lease terminations, expressing worry about vital functions and the government’s own return-to-office mandate. One lawmaker in Oklahoma worked directly with Donald Trump’s administration and Elon Musk’s Department of Government Efficiency to salvage several agency offices in the Sooner State.\nMore leases are still being canceled than saved from the scrap heap. The GSA has sent out 827 termination notices since the start of Trump’s second term and only the 100-plus letters rescinding said notices, according to the agency.\n\nThe reversals are adding more confusion to the post-inauguration chaos in federal government-related real estate. For instance, Musk’s team has already claimed that it cut 793 leases and is saving the country approximately $500 million annually. But those lease cancelations don’t match the GSA’s termination notices, and officials aren’t providing updated lists on what deals are canceled and where. Three leases in Oklahoma supposedly saved from the chopping block still appear on the DOGE website of canceled leases.\nThere’s also the “non-core” asset inventory posted by the GSA two weeks ago. The agency documented 443 properties seemingly “designed for disposal” by the federal government, only for the inventory to disappear the following day; it has yet to reappear.\nThe inventory spanned nearly 80 million square feet of rentable space across the country. The GSA forecasted more than $430 million of annual operating cost savings if the entire inventory were to be offloaded.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://www.nytimes.com/2025/03/17/us/politics/musk-doge-lease-terminations.html",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/philadelphia/2025/03/06/philadelphia-buildings-on-gsa-disposal-list/",
      "https://therealdeal.com/national/2025/03/02/real-estate-effect-of-trump-musks-federal-office-downsize/",
      "https://therealdeal.com/national/2025/01/21/federal-government-could-sell-two-thirds-of-office-portfolio/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 18:09:26 +0000",
    "published_dt": "2025-03-17T18:09:26+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/canada-global-flow-nab-51m-loan-for-el-portal-dev-site/",
    "title": "Adam Neumann’s Flow nabs $51M loan for $71M El Portal site purchase, partners with Canada Global on mixed-use development",
    "subhead": "After winning court auction for 16 acres, Adam Neumann’s firm formed JV to develop project with 2,380-plus apartments",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 17, 2025, 1:46 PM",
    "pub_date_dt": "2025-03-17T13:46:00",
    "content": "Adam Neumann’s Flow nabbed a $51 million acquisition loan and is partnering with Canada Global for a planned mixed-use project on an El Portal development site.\nNew York-based Ladder Capital provided the mortgage to a Delaware entity with ties to Flow that paid\n$71.5 million\nfor a 16-acre former trailer park at 8500 Biscayne Boulevard, records show.\nCanada Global\n, an Israeli real estate firm led by Assaf Tuchmair and Barak Rosen, came on board as a majority partner shortly after Miami-based Flow won a January court auction for the vacant property, a source familiar with the joint venture told\nThe Real Deal\n. In November, the two firms also partnered to purchase an Aventura office complex for\n$116.2 million\n.\nOn the El Portal site, the joint venture is planning to build 2,380-plus apartments with commercial space and a school, the source said. Approved for a 3 million-square-foot mixed-use project with 150 units per acre, a developer can build up to roughly 2,400 apartments.\n\nThe site, previously known as the Little Farm trailer park, has sat empty since 2016 when 45 residents settled a lawsuit with the village of El Portal and the previous ownership entity, led by Fu Jing “Leo” Wu. The Village and Wu’s entity agreed to pay the residents $8,000 each for relocation costs. Wu also managed an entity that owned a former federal immigration building at 7880 Biscayne Boulevard in Miami.\nThe trailer park site and the immigration building landed in court receivership as a result of a 2020 Miami-Dade civil lawsuit alleging Wu’s entities misappropriated funds from\nEB-5 visa investors\n. The federal program grants permanent residency to foreign investors who finance business and real estate development projects in the U.S., as well as their immediate family members.\nIn 2023, receiver Michael Goldberg entered into a settlement agreement with Wu that allowed the sale of the properties to move forward without Wu’s objections. Upon both deals closing, Wu will receive $5 million from the sale proceeds. In 2023, Miami-based B Group Capital Management bought the immigration building for\n$23 million\n, but abandoned plans to also buy Little Farm.\nIn October, Miami-based Melo Group submitted a\n$35 million\nstalking horse bid for the 16-acre trailer park. During the court auction two months ago, Melo lost a bidding war to Flow by $400,000.",
    "related_links": [
      "https://therealdeal.com/miami/2025/01/21/adam-neumanns-flow-wins-el-portal-dev-site-with-71m-offer/",
      "https://therealdeal.com/company/canada-global/",
      "https://therealdeal.com/miami/2024/11/25/adam-neumanns-flow-canada-global-buy-aventura-offices/",
      "https://therealdeal.com/miami/2020/11/17/questions-surround-50m-in-eb-5-investments-tied-to-former-ins-building-lawsuit/",
      "https://therealdeal.com/miami/2023/05/16/b-capital-pays-23m-for-miamis-former-immigration-building/",
      "https://therealdeal.com/miami/2024/10/23/melo-group-bids-35m-for-el-portal-dev-site/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 17:46:15 +0000",
    "published_dt": "2025-03-17T17:46:15+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/jct-management-sells-dania-beach-offices-to-triarch-for-18m/",
    "title": "Triarch, partners buy Dania Beach’s Airport Commerce Park for $18M, amid a South Florida office market paradox",
    "subhead": "Purchasing entity also ties to Sarah and Sergio Selcer",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 17, 2025, 1:38 PM",
    "pub_date_dt": "2025-03-17T13:38:00",
    "content": "A group of investors bought Airport Commerce Park near Fort Lauderdale-Hollywood International Airport for $18.3 million.\nThe deal comes amid a paradox for South Florida’s office market. While aging suburban buildings have traded at discounts and\nforeclosures\nhave popped up, Broward County recently scored two office deals for over $200 million each.\nAn entity managed by Jorge Linkewer, principal at Aventura-based Triarch Capital Group, as well as Sarah and Sergio Selcer bought the complex at 4101 Ravenswood Road in Dania Beach from ACP Partners, according to records and real estate database Vizzda.\nSergio Selcer is associated with Step by Step Management in Coconut Creek. ACP is managed by Mario Henriquez and affiliated with Brickell-based JCT Management, according to Vizzda and state corporate records.\nThe buyers borrowed $10.3 million from Popular Bank.\nCompleted in 1987, Airport Commerce Park consists of four one-story buildings on a 6.6-acre site, property records show. ACP Partners paid $13.3 million for the property in 2007.\nTenants include computer repair service Rescuecom of Fort Lauderdale, Ocean Exotic Car Rental, Precision Air Conditioning, Digital Marketing Service Pro and the Consulate of Sweden.\n\nTriarch, founded in 1996 by Linkewer, Daniel Halberstein and Mario Grosfeld, has a portfolio of about 3.5 million square feet of commercial real estate, according to its website. Linkewer also is founder of brokerage Axiom Capital Advisors, which lists the same Aventura office as Triarch.\nTriarch is a frequent South Florida investor. In 2023, it bought the Shoppes at 41st Street plaza at 10355 and 10405 Northwest 41st Street in Doral for\n$18 million\n. That came on the heels of Triarch’s\n$7.2 million\npurchase of an industrial outdoor storage site at 12601 West Okeechobee Road in Hialeah Gardens.\nIn 2020, the firm scored a\n$35 million\nrefinancing for the One Turnberry Place office building at 19495 Biscayne Boulevard in Aventura, which Triarch bought in 2011 for $53 million.\nIn the fourth quarter, South Florida\noffice\nvacancies and asking rents\nremained flat or slightly increased\n, year-over-year, according to an Avison Young report. Broward County’s average asking rent hit $40.18 per square foot, up from $38.34 a square foot during the same period of 2023. The vacancy rate fell to 14.5 percent from 16.8 percent. But in all of last year,\nBroward’s\ntotal leasing was 2.4 million square feet, a 27 percent decline from 2023, the Avison report shows.\nGenerally, real estate has felt the sting from higher interest rates, skyrocketing insurance and a slowdown of the influx of out-of-state companies, experts have said.\nSome properties have traded at a discount. In September, Galium Capital bought the Lake Shore Plaza II office building at 1300 Concord Terrace in Sunrise for\n$17 million\n, a nearly 47 percent discount from its price in 2013. In January, Accesso Partners bought the six-story Sawgrass Lake Center at 13450 West Sunrise Boulevard in Sunrise for\n$36.5 million\n, a 36.4 percent discount from its price in 2018.\nStill, downtown Fort Lauderdale scored two mammoth deals. Last month, DWS Group sold the  Las Olas Centre I &amp; II at 350 and 450 East Las Olas Boulevard for\n$208 million\n, and the  Bank of America Plaza at Las Olas City Centre at 401 East Las Olas Boulevard for\n$220 million\n.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/11/18/fred-karlton-wins-foreclosure-judgment-for-miami-building/",
      "https://therealdeal.com/miami/2023/03/22/triarch-capital-picks-up-doral-retail-plaza-for-18m/",
      "https://therealdeal.com/miami/2023/02/03/hialeah-gardens-industrial-site-trades-at-1m-acre-as-market-softens/",
      "https://therealdeal.com/miami/2020/05/13/triarch-capital-scores-35m-refinancing-for-one-turnberry-place/",
      "https://therealdeal.com/tag/south-florida-office-market/",
      "https://therealdeal.com/miami/2025/01/22/south-florida-office-market-holding-steady/",
      "https://therealdeal.com/tag/broward-county/",
      "https://therealdeal.com/miami/2024/09/26/galium-capital-pays-17m-for-sunrise-office-building/",
      "https://therealdeal.com/miami/2025/01/14/foundry-sells-sunrise-offices-at-discount-to-accesso/",
      "https://therealdeal.com/miami/2025/02/13/dws-sells-las-olas-centre-i-ii-to-bradford-allen-for-208m/",
      "https://therealdeal.com/miami/2025/02/14/lone-star-funds-highline-square2-buy-fort-lauderdale-tower/",
      "https://therealdeal.com/miami/2025/01/13/terranova-gildenson-triarch-capital-apollo-score-tenants/",
      "https://therealdeal.com/miami/2025/02/14/avison-young-panel-dishes-on-south-florida-office-market/",
      "https://therealdeal.com/miami/2024/10/10/varde-files-foreclosure-against-coral-gables-office-owner/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 17:38:48 +0000",
    "published_dt": "2025-03-17T17:38:48+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/national/las-vegas/2025/03/17/oikos-advances-22-unit-affordable-apartment-complex-in-vegas/",
    "title": "Oikos advances 22-unit affordable apartment complex in Las Vegas",
    "subhead": "Planning Commission gives thumbs up despite strong pushback from Historic Westside neighbors",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-17T13:30:00",
    "content": "Oikos Development Nevada has moved forward with plans to build a 22-unit affordable housing complex in west Las Vegas, despite strong pushback from neighbors.\nThe Henderson-based affordable housing developer was unanimously approved by the Las Vegas Planning Commission to build the four-story building at the northwest corner of Van Buren Avenue and F Street, in the Historic Westside,\nthe Las Vegas Review-Journal reported\n.\nNeighbors had turned out to oppose the 51-foot-tall project, raising concerns over lack of parking, increased traffic, lower property values and overcrowding. One woman who lives directly behind the project said it would “result in a loss of privacy.”\nDespite the opposition, the project known as Westside Flats was approved and will be heard by the City Council on April 16. It will replace a one-third acre vacant lot owned by the city.\nPlans call for 22 one- to three-bedroom apartments from 622 square feet to 1,055 square feet, with a rooftop deck with barbecues, a children’s playground and picnic tables.\n\nThe apartments would be for households earning between 30 percent and 50 percent of area median income. Monthly rents would range from $442 to $1,051.\nThe $6.5 million gray, charcoal and periwinkle project, designed by Nadel Architects, aligns with the city’s Hundred Plan by boosting the number of homes, housing density, affordability and availability, according to the nonprofit developer.\nOikos Development Nevada is a unit of Kansas City-based Oikos Development, founded in 2018 by Michael Snodgrass, according to its website and\nClark County meeting records\n. The firm has developed more than 500 affordable apartments in Nebraska, Missouri, Kansas, Florida and Nevada.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.reviewjournal.com/business/proposed-historic-westside-apartment-project-receives-opposition-from-neighbors-3319140/?utm_campaign=widget&utm_medium=latest&utm_source=homepage&utm_term=Proposed%20Historic%20Westside%20apartment%20project%20receives%20opposition%20from%20neighbors",
      "https://webfiles.clarkcountynv.gov//CDAC%20minutes%201.17.23%20FINAL.pdf",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/las-vegas/2025/03/11/southern-land-cedar-street-bridge-go-big-in-las-vegas/",
      "https://therealdeal.com/national/las-vegas/2025/02/27/musks-boring-company-pitches-apartments-by-las-vegas-loop/",
      "https://therealdeal.com/national/las-vegas/2025/02/05/las-vegas-enters-top-10-luxury-market-list-beating-out-la/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-17T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/17/can-mayor-karen-bass-suspend-measure-ula-to-help-la-rebuild/",
    "title": "Bass says she wants to pause Measure ULA. Is she allowed?",
    "subhead": "City’s “Mansion Tax” could make it harder for fire victims to rebuild",
    "authors": "ByAbigail Nehring",
    "pub_date": "Mar 17, 2025, 1:02 PM",
    "pub_date_dt": "2025-03-17T13:02:00",
    "content": "Los Angeles Mayor Karen Bass has apparently grown cool toward Measure ULA.\nThe mayor said there’s cause to temporarily suspend the city’s two-year-old “Mansion Tax” and might try to do so herself, if she can find a way.\n“Maybe temporarily — we’re looking into that,” Bass told a\nBreitbart\nreporter\nin a press conference last Tuesday\n. “There’s two schools of thought. One is, that can’t happen. It has to go back to voters. And the other is that it might be able to happen with action from the council and the mayor’s office.\n“We’re having that investigated through our attorneys right now,” Bass said.\nShe hasn’t spoken further about the topic since.\nZach Seidl, the mayor’s communications deputy, didn’t answer specific questions from\nThe Real Deal\nabout Bass’ plans, but said in a statement to\nThe Real Deal\nFriday, “we are going to look at every possible option to support fire survivors and accelerate recovery.”\nIt’s unclear how the mayor or City Council could defy the results of the local ballot measure, which went into effect in 2023 and imposes a 4 percent tax on property sales above $5 million and a 5.5 percent tax on sales over $10 million.\n\nThe\nCity Charter states\nthat ballot measures can be overturned by voters in a subsequent election or by amending the City Charter to supersede the ballot measure.\nA spokesperson for L.A. City Attorney Hydee Feldstein Soto did not immediately respond to a request for comment.\nMeasure ULA aimed to raise up to $1.1 billion in tax revenue to fight homelessness and build affordable housing. It has so far fallen far short of that goal, raising\nabout $300 million in its first year on the books\n.\nFewer than 5 percent of deals meet the threshold to be subject to the tax, but historically they account for about 40 percent the city’s total property tax revenue, according to an analysis by Mott Smith, a founding member of the Council of Infill Builders and adjunct professor at the USC Price School of Public Policy.\nDuring her 2022 campaign for mayor, Bass\nnever took a stance supporting\nthe ballot measure, but she\napplauded a court ruling\ndismissing a lawsuit against it the following year.\nAnd later that year the former deputy mayor for housing took some heat saying real estate investors were having “\na bit of a temper tantrum\n” about the transfer tax, as\nTRD\npreviously reported.\n",
    "related_links": [
      "https://www.breitbart.com/politics/2025/03/11/l-a-mayor-karen-bass-says-city-considering-suspending-measure-ula-tax-to-help-rebuilding/",
      "https://youtu.be/EVJzGokdfAY?si=yUi6lLdDNsTb5z0p&t=746",
      "https://codelibrary.amlegal.com/codes/los_angeles/latest/laac/0-0-0-1863",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://www.latimes.com/california/story/2022-09-30/mansion-tax-la-ballot-measure",
      "https://mayor.lacity.gov/news/mayor-bass-city-attorney-hydee-feldstein-soto-and-la-housing-department-applaud-decision",
      "https://therealdeal.com/la/2023/11/01/la-deputy-mayor-recalls-temper-tantrum-on-measure-ula/",
      "https://therealdeal.com/la/2024/10/18/las-luxury-home-market-generates-most-measure-ula-funds/",
      "https://therealdeal.com/la/2024/04/16/las-mayor-bass-asks-the-wealthy-to-pay-for-homeless-housing/",
      "https://therealdeal.com/la/2024/06/20/ballot-measure-to-overturn-ula-struck-down-by-court/"
    ],
    "market": "Los Angeles",
    "published": "Mon, 17 Mar 2025 17:02:13 +0000",
    "published_dt": "2025-03-17T17:02:13+00:00",
    "author": "Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/days-on-market-rises-for-luxe-miami-dade-resi-properties/",
    "title": "Luxury homes spend more time on the market in Miami-Dade, as signed contracts fall",
    "subhead": "Waterfront Cocoplum home asking $12M topped last week’s report",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 17, 2025, 12:39 PM",
    "pub_date_dt": "2025-03-17T12:39:00",
    "content": "Signed contracts of luxury residential properties in Miami-Dade County dropped for the second consecutive week.\nBuyers signed 11 contracts between March 10 and March 16, according to last week’s\nEklund-Gomes\nreport, which tracks listings of homes and condos asking $4 million and up in Miami-Dade County that are included in the Multiple Listing Service. The properties spent about 175 days on the market, on average.\nFifty-three luxury listings were added to the market, for a total of 1,356 listings.\nThe asking dollar volume for the six single-family homes and five condos under contract totals $83.3 million, according to the report, which is authored by the Douglas Elliman team led by Fredrik Eklund and John Gomes.\nThe single-family homes that entered into contract last week had an average asking price of $7.7 million and spent an average of 117 days on the market. They totaled $46.5 million in asking dollar volume.\n\nAt the top of the report is the waterfront home at 136 Paloma Drive in Coral Gables. The\nCocoplum\nproperty, asking nearly $12 million, is on the market with Douglas Elliman’s Darin Tansey and William Seltzer. The 7,113-square-foot, six-bedroom and seven-and-a-half-bathroom house sits on a 0.4-acre lot.\nThe condos that secured buyers last week had an average asking price of $7.4 million and spent 244 days on the market, on average. They totaled $36.9 million in asking dollar volume, or $1,733 per square foot.\nA 6,122-square-foot unit at the planned Indian Creek Residences and Yacht Club in Bay Harbor Islands led new pending condo sales. The five-bedroom, six-bathroom unit #5 is on the market for $11.3 million with One Sotheby’s International Realty agents Vanessa Frank and David Pullman. The\nnine-unit project\nis being developed by Jonathan Landau’s Landau Properties.\nThe\nprevious week\n, buyers signed contracts for a dozen properties in Miami-Dade, asking a combined $137.4 million.\nLast week in New York, buyers signed contracts for 36 homes, according to the latest\nOlshan\nreport. Their combined asking price was $323 million, and the typical home spent 1,026 days on the market.\n",
    "related_links": [
      "https://therealdeal.com/tag/eklund-gomes/",
      "https://therealdeal.com/tag/cocoplum/",
      "https://therealdeal.com/miami/2024/11/25/movers-shakers-landau-taps-one-sothebys/",
      "https://therealdeal.com/miami/2025/03/10/zudy-founders-49m-miami-beach-home-tops-signed-contracts/",
      "https://therealdeal.com/company/olshan-realty/",
      "https://therealdeal.com/miami/2025/03/10/zudy-founders-49m-miami-beach-home-tops-signed-contracts/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 16:39:59 +0000",
    "published_dt": "2025-03-17T16:39:59+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/17/audemars-piguet-clocks-12k-sf-lease-at-785-fifth-avenue/",
    "title": "Audemars Piguet clocks 12K sf lease on Fifth Avenue",
    "subhead": "Luxury watchmaker is first retail tenant at Parc Cinq corner site after bank’s exit",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 12:37 PM",
    "pub_date_dt": "2025-03-17T12:37:00",
    "content": "It was time for a retail tenant to shack up at one of Fifth Avenue’s remaining vacant retail spaces.\nLuxury watchmaker Audemars Piguet signed a lease for 12,000 square feet at 785 Fifth Avenue in Manhattan’s Lenox Hill neighborhood, the New York Post\nreported\n. The lease spans the entire corner site at East 60th Street.\nAt one time, a Citibank branch occupied a portion of the ground-floor corner space of the property, which is also home to the Parc Cinq luxury building. In 2023, the building’s co-op board — which controls the retail space — retained Newmark to market the site on Fifth Avenue’s famed retail corridor.\nThe asking rent for the two-floor space was $4.8 million per year. The duration of the lease was not disclosed.\nA Newmark team including Jeffrey Roseman, Caleb Petersen and Drew Weiss represented the co-op board. CBRE’s Jonathan Schley and GoodSpace’s Chris DeCrosta represented the tenant.\n\nThe retail space used to have narrow windows befitting a bank, which have since been expanded. The alterations needed to go through the Landmarks Preservation Commission because the property is in a historic district.\nThis will be the global watchmaker’s third spot in Manhattan. The Swiss company also has a sales boutique at 66 East 57th Street and a service center at 52-58 Gansevoort Street.\nIt’s upping the ante with space on Fifth Avenue, long considered international shopping destination. It’s set to undergo a seismic change after the city reached a deal with the merchants to redesign the street, Gothamist\nreported\nin the fall, which will see more space opened for pedestrians by doubling the width of the sidewalks between Bryant Park and Central Park.\nCity officials have estimated the redesign would cost $350 million, excluding the price of relocating underground utilities and sewers.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://nypost.com/2025/03/14/business/audemars-piguet-becomes-first-nyc-retail-tenant-at-785-fifth-ave/",
      "https://gothamist.com/news/nyc-reaches-deal-with-fifth-avenue-merchants-to-redesign-busy-shopping-corridor",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2018/05/08/david-geffen-quietly-sells-785-fifth-pad-to-roman-abramovichs-bff-for-25m/",
      "https://therealdeal.com/new-york/2024/09/17/brookfield-weighing-sale-of-fifth-ave-retail-asset/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 16:37:08 +0000",
    "published_dt": "2025-03-17T16:37:08+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/17/rxr-cedes-digital-midtown-office-building-to-lender/",
    "title": "RXR cedes “digital” Midtown office building to lender",
    "subhead": "Barings purchased property at auction for $161M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 17, 2025, 12:06 PM",
    "pub_date_dt": "2025-03-17T12:06:00",
    "content": "Just because it’s\n“digital,”\ndoesn’t mean it’s viable.\nThe developer lost control of 340 Madison Avenue, an office building in Midtown Manhattan, Crain’s\nreported\n. Massachusetts Mutual Life Insurance subsidiary Barings purchased the property at auction on Thursday for $161 million.\nAt least three prospective bidders appeared interested in the property prior to the auction, according to court records. Barings, however, was the only qualified bidder to actually attend the event last week.\nIn May, MassMutual\nfiled a complaint\nagainst Rechler’s firm after it defaulted on a $315 million mortgage, which matured earlier in the year. A spokesperson for the company said at the time that the property was high quality, but had a “broken capital structure.” RXR had identified the building as “digital” as opposed to “film,” meaning it was part of the company’s portfolio that was deemed worth keeping.\nA loan modification was still a possibility at the time. As of May, there were about 300,000 square feet available, representing 40 percent of the building’s total rentable area.\n\nRXR in April leased about 7,000 square feet to investment firm Yaupon Capital Management and 5,500 to Northampton Capital Partners, an infrastructure and energy-transition investment firm led by a former Apollo Global Management executive. RXR also signed renewals with SRS Real Estate Partners and Edelman Financial Engines and new leases with investment firm Tide Rock and Boundary Creek Advisors.\nThe 22-story, 760,000-square-foot building has estimated asking rents between $68 and $83 per square foot, according to CoStar.\nAn RXR representative declined to comment to Crain’s on the auction.\nIn better news for Rechler, RXR and SL Green\nworked out a deal\non the $940 million mortgage backed by Worldwide Plaza on Eighth Avenue. The borrowers, which also include a subsidiary of the liquidating company for New York REIT, will use loan reserves to fund operating expenses and debt service shortfalls, according to Morningstar; the loan is still set to come due in November 2027.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://therealdeal.com/new-york/2023/02/06/rechler-responds-rxr-boss-on-health-of-his-office-portfolio/",
      "https://www.crainsnewyork.com/real-estate/barings-takes-control-340-madison-ave-rxr",
      "https://therealdeal.com/new-york/2024/05/20/scott-rechlers-rxr-faces-foreclosure-on-madison-ave-office/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/05/20/scott-rechlers-rxr-faces-foreclosure-on-madison-ave-office/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/new-york/2023/05/04/its-dangerous-to-say-this-is-the-end-scott-rechler-discusses-real-estates-crises-at-trd-forum/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 16:06:31 +0000",
    "published_dt": "2025-03-17T16:06:31+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/17/pet-entrepreneurs-ues-condo-lands-a-buyer/",
    "title": "Pet entrepreneur’s UES condo snags a signed contract after 7 years",
    "subhead": "Allen Simon’s sixth-floor apartment at 838 Fifth Avenue last asked $25M",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 17, 2025, 11:08 AM",
    "pub_date_dt": "2025-03-17T11:08:00",
    "content": "After seven years of searching, a pet product investor finally found a buyer for his Upper East Side condo.\nThe sixth-floor apartment at 838 Fifth Avenue, asking just under $25 million, was the priciest home to snag a signed contract in Manhattan last week, according to Olshan Realty’s weekly report.\nAllen Simon, the inventor of the Wee Wee Pad, and his wife, Cynthia Simon, bought the apartment from the sponsor for just under $11 million in 2000. The couple sought to offload the condo nearly 20 years later with a $42 million asking price.\nThe 5,400-square-foot pad drifted\non and off the market\nfor several years and cycled through three brokerages before landing an inked deal. The contract includes two storage bins and a studio apartment.\nThe unit, which is due for renovation, has three bedrooms, five bathrooms and three fireplaces. It also features views overlooking Central Park and a private elevator. Amenities in the building, one of few condos lining the east side of the park, include a doorman and gym.\nCompass’ Kyle Blackmon, Samantha Shuman and Ethan Mahgerefteh had the listing.\n\nThe condo was one of 36 homes in Manhattan asking $4 million or more to find buyers between March 10 and March 16. The total — just one pending deal higher than the\nprevious period\n— included 11 contracts signed for homes asking $10 million or more, the largest number of contracts for trophy properties since December.\nThe second and third most expensive homes to enter contract were two condos at 111 West 57th Street, both asking roughly $21 million, down $10 million from their asking prices when the developers started marketing them from floorplans in 2016.\nUnits 69 and 70, which were sold to different buyers, each span 3,900 square feet and have three bedrooms and three bathrooms. They also feature 14-foot ceilings and views of Central Park.\nThe Nikki Field Team with Sotheby’s International is heading sales at the Billionaires’ Row building, developed by JDS Development, Property Markets Group and Apollo. Amenities include a fitness center, pool, terrace and private dining room.\nOf the 36 properties, 27 were condos, five were co-ops and four were townhouses.\nThe homes’ combined asking price was $323 million, for an average price of $9 million and a median of $6.5 million. The typical home spent more than 1,000 days on the market and was discounted 14 percent from the original listing price.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2019/04/10/wee-wee-pad-inventor-not-taking-the-piss-with-price-of-fifth-avenue-condo/",
      "https://therealdeal.com/new-york/2025/03/10/billionaires-row-condo-tops-manhattans-luxury-contracts/",
      "https://therealdeal.com/new-york/2025/03/10/billionaires-row-condo-tops-manhattans-luxury-contracts/",
      "https://therealdeal.com/new-york/2025/03/14/gracie-abrams-buys-greenwich-village-co-op/",
      "https://therealdeal.com/new-york/2025/03/12/woolworth-mansion-asking-price-drops-to-50m/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 15:08:43 +0000",
    "published_dt": "2025-03-17T15:08:43+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/17/ryan-serhant-expands-out-west/",
    "title": "Ryan Serhant expands west",
    "subhead": "Founder’s eponymous brokerage opens first outpost in Arizona with 50 agents",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 17, 2025, 10:33 AM",
    "pub_date_dt": "2025-03-17T10:33:00",
    "content": "Ryan Serhant is heading out West.\nThe celebrity agent’s eponymous brokerage is setting up shop in Arizona with more than 50 agents in Phoenix. The move marks the firm’s first foray away from the East Coast, where it’s been steadily expanding since 2023.\nThe expansion “has been an organic journey, not a race to be the biggest or the fastest for the sake of being big, or fast,” the firm’s founder and CEO wrote in a statement. “Our focus is on aligning with people who share our vision, and are committed to pushing boundaries.”\nAmong the new brokers are six founding agents and Todd Lee, designated broker for the region. Together, the agents notched more than half a billion in sales last year. The firm’s Western operation is launching with about 100 listings, including a five-bedroom home in the Scottsdale desert asking $4.9 million.\n“I wanted to try something different,” said Linda Salkow, one of the agents joining the firm.\nSalkow, whose listings include a $2.8 million home in Scottsdale, pointed to Serhant’s technology platform known as S.MPLE and the founder’s eye for social media and marketing as the reason for her move from a local Berkshire Hathaway HomeServices, where she spent nearly a decade as a top producer.\n“The real estate industry is changing. Everything in life is changing,” Salkow said. “We have to stay on top of it, and Serhant has a great feel for that.”\n\nWith the Arizona teams now in the fold, Serhant has more than 1,000 agents across nine states, including the Carolinas, Florida, New Jersey and Connecticut. The brokerage’s latest additions include a\n10-person team\noperating in the Hudson Valley, Westchester and Connecticut’s Fairfield and Lichfield counties.\nThe firm’s competitors have pushed back against Serhant’s moves along the East Coast, with some brokerages filing lawsuits against the firm for allegedly poaching their agents and stealing confidential information.\nSerhant notched a win in his legal battle for more territory in November, when\na judge dismissed\na $10 million lawsuit tied to its spread into Pennsylvania.\nKeller Williams Black Label and its parent company, Condo Shop, sued the brokerage and its founder in April 2023, alleging Serhant tried to “loot” the firm. A Philadelphia judge rejected the companies’ arguments, citing its inability to prove it sustained damages following its agents’ departure.\nSerhant, once a mainstay on Bravo’s “Million Dollar Listing New York,” launched his brokerage in 2020 and quickly established it as one of the top-producing firms in New York City. Last year, the company placed sixth among brokerages in Manhattan with $580 million in sales, according to\nThe Real Deal’s\n2023 ranking\n.\nSince its founding, the brokerage, bolstered by revenue from Serhant’s coaching business, Sell It, starred in a\nreality TV show\ncalled “Owning Manhattan,” which aired its first season on Netflix last summer. The firm also notched $45 million in\nventure capital funding\ngeared toward developing its artificial intelligence-powered technology.\nNetflix greenlit Season 2 of the series focused on the brokerage, according to Serhant. Filming last week and new episodes will air in the summer\n",
    "related_links": [
      "https://therealdeal.com/new-york/tristate/2024/10/11/serhant-expands-to-hudson-valley/",
      "https://therealdeal.com/national/2024/11/04/serhant-wins-lawsuit-over-pennsylvania-expansion/",
      "https://therealdeal.com/magazine/march-2024/ranking-nycs-top-brokerages-of-2023/",
      "https://therealdeal.com/national/2024/08/27/netflix-renews-owning-manhattan-for-season-two/",
      "https://therealdeal.com/magazine/january-2025/with-commission-revenue-in-question-brokerages-seek-side-hustles/",
      "https://therealdeal.com/magazine/august-2024/can-ryan-serhant-scale-a-brokerage-built-on-his-personality/",
      "https://therealdeal.com/national/2024/11/04/serhant-wins-lawsuit-over-pennsylvania-expansion/",
      "https://therealdeal.com/national/2024/08/27/netflix-renews-owning-manhattan-for-season-two/"
    ],
    "market": "National",
    "published": "Mon, 17 Mar 2025 14:33:52 +0000",
    "published_dt": "2025-03-17T14:33:52+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/miamicentral-greystar-dacra-score-tenants/",
    "title": "Lease roundup: Call Me Gaby on tap on Miami River, Brightline’s MiamiCentral lands Brooklyn Dumpling Shop and five other tenants",
    "subhead": "Also, Ella Café plans first outposts in Palm Beach County",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 17, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-17T10:30:00",
    "content": "Call Me Gaby | Miami\nCall Me Gaby, the Italian restaurant in Miami Beach’s South of Fifth neighborhood, will expand to the\nMiami River\n.\nCall Me Gaby owners Cathy and Anthony Arrighi, in partnership with restaurateur Roman Jones, will open the restaurant in a two-story, 8,500-square-foot building at 5 Southwest South River Drive in Miami, according to a news release from Call Me Gaby and Jones. The outpost is expected to open next year.\nRecords show the currently vacant site is owned by an entity managed by Brickell-based attorney Arturo Ortega. Ortega is developing the Call Me Gaby building. The tenants leased the site under a 25-year term.\nJones’\nrestaurants include Kiki on The River, Habibi, and Casablanca Seafood.\nBrooklyn Dumpling Shop, Face. Brow &amp; Beauty Bar, more | Miami\nBrightline’s\nMiamiCentral\nstation scored six new tenants.\nRosetta Bakery opened in a 621-square-foot space and AT&amp;T opened in a 1,500-square-foot space at the mixed-use complex at Northwest First Avenue between Northwest Third and Seventh streets, in\ndowntown Miami\n, according to a MiamiCentral news release.\nNext on tap by month’s end is Brooklyn Dumpling Shop’s 741-square-foot store, marking the restaurant’s first Florida outpost, according to a Brightline news release. Brooklyn Dumplin Shop’s menu includes Wagyu beef potstickers, rib-eye dumplings and Korean barbecue. The Miami outpost also will have Cuban sandwich dumplings.\nOther tenants opening this year are Face. Brow &amp; Beauty Bar, which leased 2,000 square feet; The Green Chicken Miami restaurant, which leased 2,400 square feet; and Verizon, which leased 1,500 square feet, according to the release.\nMichael Silverman and Jeff Evans of Comras Company represented MiamiCentral.\nIn 2018, Miami-based Florida East Coast Industries developed MiamiCentral, which includes retail, 816 apartments in a pair of towers above the station and two office buildings with about 300,000 square feet.\nFECI, which also is the parent of the\nBrightline\nrail company, has sold the\napartment\nand\noffice\nbuildings over the past couple of years. Patrick Goddard is president of Brightline.\nElla Café | Palm Beach County\nItalian coffeehouse Ella Café is expanding to\nPalm Beach County\n.\nThe café leased 2,000 square feet at the Shoppes at Woolbright at 10935 Jog Road in an unincorporated area of the county, where it will open in the third quarter, according to a news release from the tenant’s broker. Ella Café also leased 1,700 square feet at Westlake Palms at 4931 Seminole Pratt Whitney Road in Westlake, where it will open early next year.\nLiz Metott of Native Realty represented the tenant.\nThe coffeehouse’s existing outposts are at 9743 West Broward Boulevard in Plantation, 3890 Davie Road in Davie and 4691 North University Drive in Coral Springs, according to its website.\n\nRecords show New York-based Georgetown Company owns Shoppes at Woolbright, and\nWestlake\nmaster developer\nMinto Communities\nowns Westlake Palms.\nParlor Doughnuts | Boca Raton\nA coffeehouse and craft doughnuts shop will open in\nBoca Raton\n.\nParlor Doughnuts leased 1,500 square feet at 11 Plaza Real at The Mark at Cityscape apartment development in Boca Raton, according to a news release from the tenant’s broker. It will open in the second quarter.\nLiz Metott and Kaley Tuning of Native Realty represented Parlor Doughnuts.\nMonogram Residential Trust bought The Mark in 2015 for $81.7 million, records show. The property owner now is an affiliate of Greystar, which through its funds bought Monogram in 2017, according to a Greystar news release at the time. APG Asset Management, Singaporean sovereign wealth fund GIC and Ivanhoé Cambridge were capital partners on the purchase.\nCesar | Miami\nA showroom for kitchen furniture opened in the\nMiami Design District\n.\nLinea Studio’s Cesar brand opened a 4,000-square-foot flagship store at 4141 Northeast Second Avenue in Miami, according to a Cesar news release. In the same building, Linea also opened a 2,500-square-foot showroom for its Lema brand.\nCraig Robins’\nDacra\n, which developed the Miami Design District, owns the building, records show.\nThom Browne, La DoubleJ and Loewe | Palm Beach\nThree luxury retail boutiques are on tap at Royal Poinciana Plaza in\nPalm Beach\n.\nThom Browne is already open at 340 Royal Poinciana Way, according to a Royal Poinciana Plaza news release. Next month, Milan-based women’s fashion boutique La DoubleJ will open, marking its first U.S. outpost. Also next month, Spanish luxury fashion store Loewe will open.\nThe tenants will be at Royal Poinciana Playhouse, with Loewe and Thom Browne moving into permanent spaces at the playhouse from their seasonal boutiques at the plaza, the release says.\nChestnut Hill, Massachusetts-based WS Development has been renovating the playhouse, which has been closed since 2004 and is expected to reopen this year. It will have a 400-seat theater and 12,000 square feet of retail space, the release says.\nOther tenants on tap at the playhouse are the 200-seat waterfront Tutto Mare restaurant, and The Innovate, a nonprofit led by Avie and Jill Glazer that will open a cultural arts space.\nThe square footage La DoubleJ and Loewe leased wasn’t immediately provided. Thom Browne leased 1,500 square feet, Palm Beach Daily News reported.\n",
    "related_links": [
      "https://therealdeal.com/tag/miami-river/",
      "https://therealdeal.com/miami/2023/07/31/lease-roundup-roman-jones-opening-restaurants-on-miami-river-sweat440-coming-to-miramar/",
      "https://therealdeal.com/tag/miamicentral/",
      "https://therealdeal.com/tag/downtown-miami/",
      "https://therealdeal.com/tag/brightline/",
      "https://therealdeal.com/miami/2022/03/16/harbor-pays-over-400m-for-miamicentral-apartments-in-record-deal/",
      "https://therealdeal.com/miami/2021/03/19/blackstone-buys-miamicentral-office-buildings-for-230m/",
      "https://therealdeal.com/tag/palm-beach-county/",
      "https://therealdeal.com/tag/westlake/",
      "https://therealdeal.com/tag/minto-communities/",
      "https://therealdeal.com/tag/boca-raton/",
      "https://therealdeal.com/tag/miami-design-district/",
      "https://therealdeal.com/tag/dacra/",
      "https://therealdeal.com/tag/palm-beach/",
      "https://therealdeal.com/miami/2025/03/10/go-grocer-leases-at-fort-lauderdales-flagler-village/",
      "https://therealdeal.com/miami/2025/03/03/dws-group-kimco-realty-las-olas-co-nab-tenants/",
      "https://therealdeal.com/miami/2025/02/25/verizon-leases-at-nuveen-pimcos-waterford-office-campus/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-17T14:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/17/movers-shakers-nikki-beach-co-founder-joins-elliman/",
    "title": "Movers & Shakers: Nikki Beach co-founder joins Elliman",
    "subhead": "Plus: Real estate-focused Shubin Law names two partners",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 17, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-17T09:45:00",
    "content": "In the latest roundup of South Florida real estate hiring news, a South Beach club scene icon is getting in the real estate game.\nDouglas Elliman\nis bringing in some new blood to its South Florida offices, according to a press release. Tommy Puccio, better known as Tommy Pooch, was the co-founder of Nikki Beach, the iconic beach club described in its heyday as “South Beach’s sandy version of, say, the Playboy Mansion minus the grottos but full of models and old men who love them,” by the\nMiami Herald\n. He will be based in Elliman’s MiMo District office, the release shows.\nIn 2023,\nthe Boucher Brothers and Major Food Group\nwon the bid to take over the Nikki Beach site when its lease expires in 2026.\nBarbie Estela is leaving One Sotheby’s International Realty to join Elliman’s Coral Gables office and work on sales for\nCora\n, a 13-story, 74-unit wellness-focused condo project that Constellation Group and Boschetti Group launched in Coral Gables last month.\n\nThe move coincides with longtime Elliman agent\nPablo Alfaro\n, who has closed $1 billion in career sales volume, departing for Compass.\nMiami-based real estate law firm Shubin Law promoted two attorneys, Denise Haire and Jamie Katz, to partners in the practice, a press release shows. Prior to joining Shubin, Haire served as assistant city attorney for West Palm Beach and as land use and development counsel with the Euclid Group, according to LinkedIn. She has been with Shubin for two years. Katz has been with Shubin for almost four years, and was previously an associate attorney with Young Berman Karpf Gonzalez in Fort Lauderdale, LinkedIn shows.\nIn West Palm Beach, Shannon Bona left her position as a first vice president with Graystone Capital Advisors to launch CrownPoint Partners with Newport Beach-based Julius Swolsky and Don Bingham, according to a press release. The commercial brokerage has a national focus and $75 million worth of listings in Florida, the release shows.\nMiami-based commercial brokerage Apex Capital Realty is launching an insurance division, according to a release. Apex Capital Insurance will provide commercial property, commercial umbrella, professional liability, and wind, hazard and flood insurance, the release shows.\n",
    "related_links": [
      "https://therealdeal.com/company/douglas-elliman/",
      "https://www.miamiherald.com/miami-com/nightlife/article225908675.html",
      "https://therealdeal.com/miami/2023/09/28/boucher-brothers-nikki-beach-proposal-approved/",
      "https://therealdeal.com/miami/2025/02/25/developers-launch-sales-for-coral-gables-wellness-condos/",
      "https://therealdeal.com/miami/2025/03/14/longtime-douglas-elliman-agent-pablo-alfaro-joins-compass/",
      "https://therealdeal.com/miami/2025/03/10/movers-shakers-codina-partners-taps-svps/",
      "https://therealdeal.com/miami/2025/03/03/movers-shakers-turnberry-taps-hospitality-evp/",
      "https://therealdeal.com/miami/2025/02/24/movers-shakers-elliman-taps-new-development-marketing-vp/"
    ],
    "market": "South Florida",
    "published": "Mon, 17 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-17T13:45:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/17/can-city-solve-housing-crisis-and-keep-vacancy-under-5-no/",
    "title": "Candidates pledge to raise vacancy rate, but they’re hiding something",
    "subhead": "Landlord group slams Democrats’ 4% solution to the housing crisis",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 17, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-17T07:00:00",
    "content": "As the many candidates for mayor call for huge numbers of new homes — from\n200,000\n(Zohran Mamdani) to\n500,000\n(Brad Lander) to\n700,000\n(Zellnor Myrie) — Kenny Burgos is calling them out.\nThe CEO of the New York Apartment Association claims that most candidates are not truly pushing “abundance” as a housing goal, because none has identified a target vacancy rate.\nAbundance in housing means having far more units than is needed — that is, high vacancy — so renters and buyers negotiate prices down instead of bidding them up.\n“A 5 to 10 percent vacancy rate should be the goal for a healthy housing market,” Burgos said on his\nlatest podcast\n, reflecting the consensus view of economists.\nBut few city politicians take that position, for one simple reason: A vacancy rate of 5 percent would legally end the city’s “\nhousing emergency\n” and thus rent stabilization.\n“Over the past 50 years, elected officials have attempted to keep the housing stock as close to a 4 percent vacancy rate as possible,” Burgos said.\nIt’s a classic case of the tail wagging the dog.\nBefore\nThe Real Deal\n’s publisher, Amir Korangy, chides me for using an esoteric expression that confuses readers, I will explain. “\nThe tail wagging the dog\n” means something important or powerful is being controlled by something that isn’t.\n\nIn this case, housing policy should determine the vacancy rate, not the other way around. But that isn’t what happens in New York.\nBeginning with the citywide rezoning of 1961, elected officials have limited development, which along with strong demand to live in the city has kept the vacancy rate below the all-important 5 percent mark. When the rate surged after Covid, politicians\ndelayed\nthe Housing and Vacancy Survey until it went back down.\nThen it kept falling, all the way to a 56-year low of\n1.4 percent\n. That was a\nturning point\nin New York City politics. It’s the reason all the candidates are talking about\nadding supply\n.\nBut, as Burgos alluded to, they don’t want to add enough to solve the problem, because rent-stabilization would disappear and about 2 million tenants would storm City Hall like the January 6 mob did on Capitol Hill.\nBurgos represents owners of rent-stabilized housing, who obviously would rejoice at being able to charge market-rate rent. That doesn’t mean he’s wrong about\nrent control\nbeing a\nfailed policy\n.\nOn his podcast, the lobby group CEO challenged reporters to demand mayoral candidates reveal their desired vacancy rate. Tempting as that might be for journalists, it would serve no purpose because no Democrat could advocate for ending rent stabilization and expect to win the primary.\nBetter to cheer the plans that have a chance to break the 5 percent threshold, such as\nMyrie’s\nand\nLander’s\n, even if the candidates will never admit that is possible.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/02/10/nyc-mayoral-candidate-zohran-mamdanis-housing-plan/",
      "https://therealdeal.com/new-york/2025/03/07/brad-lander-releases-mayoral-housing-plan/",
      "https://therealdeal.com/new-york/2024/12/04/mayoral-candidate-zellnor-myrie-pitches-nyc-housing-plan/",
      "https://podcasts.apple.com/us/podcast/new-york-politicians-government-brain-on-housing-and/id1734995016?i=1000698748739",
      "https://therealdeal.com/new-york/2024/03/07/city-council-considers-housing-emergency/",
      "https://www.merriam-webster.com/wordplay/wag-the-dog-idiom-meaning",
      "https://www.cssny.org/news/entry/testimony-new-york-citys-housing-emergency",
      "https://therealdeal.com/new-york/2024/02/08/survey-shows-nyc-housing-vacancy-rate-at-1-4-percent/",
      "https://therealdeal.com/new-york/2024/02/13/new-york-city-officials-launch-pro-housing-group/",
      "https://therealdeal.com/new-york/2025/02/08/nyc-debates-its-growing-housing-crisis/",
      "https://therealdeal.com/new-york/2024/09/27/the-daily-dirt-argentina-ditched-rent-control-what-if-nyc-did-too/",
      "https://reason.org/commentary/unintended-consequences-of-rent-control/",
      "https://static1.squarespace.com/static/661d72f5fdcd48687fb80031/t/674e6591e53c4b51f570df29/1733191070468/Zellnor+For+NYC+-+Rebuild+NYC+-+One+Million+Homes.pdf",
      "https://static1.squarespace.com/static/5b2052b12487fd3fa17f00a6/t/67c9104eaeb4d1348ee66894/1741230159290/State+of+Emergency+-+Addressing+NYC%E2%80%99s+Housing+Crisis.pdf",
      "https://therealdeal.com/new-york/2024/12/04/mayoral-candidate-zellnor-myrie-pitches-nyc-housing-plan/",
      "https://therealdeal.com/new-york/2025/03/07/brad-lander-releases-mayoral-housing-plan/",
      "https://therealdeal.com/new-york/2024/09/27/the-daily-dirt-argentina-ditched-rent-control-what-if-nyc-did-too/"
    ],
    "market": "New York",
    "published": "Mon, 17 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-17T11:00:00+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/16/analyzing-dimonds-strategy-to-revive-north-bay-village-condo/",
    "title": "The Weekly Dirt: A condo developer’s strategy backfired. Will the project’s revival succeed?",
    "subhead": "Vivian Dimond to complete 54-unit waterfront tower in North Bay Village that’s been stalled for more than a year",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 16, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-16T13:00:00",
    "content": "A partially built luxury condo project in North Bay Village, the city’s first in more than a decade, may be back on track.\nNever one to shy away from a challenge, Vivian Dimond\nstepped in\nto take over development and construction of what is now called Tula Residences, a 54-unit, 21-story (once it’s finished) building on the waterfront.\nConstruction workers disappeared from the site in late 2023.\nDimond’s Bayshore Grove Capital took over the LLC that owns the property last year. Malaysian developer Pacific &amp; Orient, led by CEO Thye Seng Chan, will remain a partner in the project.\nIn Miami, most condo developers use the following strategy: buy land, hire a public relations firm to tease a project launch, begin sales, open a sales center, publicize that opening — maybe with a splashy party — etc.\nChan didn’t really follow that approach. His firm waited to launch sales of the project, didn’t make much of a splash when he did, and self-funded construction. The unit layouts weren’t ideal, brokers and developers told me.\nLiens began to pile up, including nearly $7 million sought by the former general contractor. One vendor sued. That’s when everything went dark. Residents on the island were not happy.\nI don’t know exactly when Dimond’s Bayshore Grove finalized its deal, but it made sense when I learned that she would be reviving the project. She made changes to the layout and floor plans, moved the lobby from the sixth floor (unusual choice by the original developer) to the ground floor, and plans to install larger windows for better views.\nOnce the building is completed in 2026, it will mark eight years since Pacific &amp; Orient secured its approvals.\nDimond’s sales team, led by Brown Harris Stevens’ Ellis Bachman, is tasked with selling nearly all of the units. Pacific &amp; Orient only had two buyers with contracts at the North Bay Village project. One was refunded, and another is staying in the deal, Dimond told me.\nWhile many developers seemed to shy away from the project, she saw it as an opportunity to be the first one out of the gate.\nNorth Bay Village has attracted tens of millions of dollars of investment, if not more, in recent years. But no one has gotten this far. Even though others (Eichner, Shoma, Sunbeam, Riviera Horizons, etc.) have launched sales of their projects, garnering much more attention than what is now called Tula ever did, Dimond’s project is the furthest along, construction-wise.\nWhile there are downsides to picking up a project midway through construction, the upsides may outweigh them.\n\nIt will become harder and more expensive to complete a building from scratch today, given the situation with tariffs, concerns over construction labor as a result of immigration policies, inflation and more.\nBuyers are also less enthusiastic about waiting four, five, six years for a project to be completed. This is at a time when dozens of new condo developments are in the pipeline. Despite developer and broker talk of strong presales, we’re hearing that a small number of projects are stalled.\nWhat we’re thinking about:\nSo many Live Local Act project applications have been filed in South Florida. Are these developments getting built? Send me a note at\nkk@therealdeal.com\n.\nCLOSING TIME\nResidential:\nDeveloper James Curnin and his wife Jennifer sold their waterfront 9,640-square-foot home at 66 La Gorce Circle in Miami Beach\nfor $60 million\n. A land trust named after the address purchased the property.\nCommercial loan:\nPPG Development and BH3 Management secured a\n$225 million refinancing\nof the loan backing Slate Hallandale Beach, a 250-unit apartment tower next to the Shell Bay Club. J.P. Morgan and Monroe Capital provided the latest financing for the building, which was completed in 2022. The lenders have both worked closely with Witkoff, which is partnering with PPG on the adjacent Shell Bay project.\nNEW TO THE MARKET\nA new oceanfront estate in Palm Beach hit the market\nfor $45 million\n. The six-bedroom, seven-bathroom and one-half-bath mansion at 1742 South Ocean Boulevard was completed last year on a 0.6-acre lot. Christian Angle of Christian Angle Real Estate has the listing for the 8,170-square-foot house. Property records show a company managed by recycling mogul Anthony Lomangino paid $10 million for the lot in 2020 — a steal in Palm Beach.\nA thing we’ve learned\nThe Great Elephant Migration, an art installation of 100 life-size elephant sculptures, is actually\nstill in South Florida\n. You may remember it as one of the most photographed Art Basel exhibits last year. Three elephants are on display at Four Seasons Hotel and Residences Fort Lauderdale, available to the public, while another four are at Four Seasons Resort Palm Beach. They’ll be there until Tuesday.\nElsewhere in Florida\nSwerdlow Group agreed to implement a voluntary heat safety program for construction workers at its $3 billion project in Little River and Little Haiti,\nPrism\nreports. The Miami-Dade Housing Committee recently reviewed the development agreement for the 63-acre mixed-use development. Swerdlow is the first to make such a voluntary move after state lawmakers passed House Bill 433, which bans local governments from mandating heat protections.\nDevelopers are increasingly building homes on former orange groves, marking another threat to Florida’s orange industry, according to the\nAssociated Press\n. Consumers are also drinking less orange juice, and citrus greening disease has hit the industry hard in recent decades.\nRepublican and Democratic lawmakers grilled state insurance regulators about a report that showed insurers funneled billions of dollars to affiliates between 2017 and 2019 while they claimed to lose money. The regulators told lawmakers that the report was never given to the legislature because it was unfinished, the\nTampa Bay Times\nreports. Former Insurance Commissioner David Altmaier commissioned the report, but after he abruptly left his post to become a lobbyist, it was left in draft form.",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/13/vivian-dimond-reviving-stalled-north-bay-village-condos/",
      "mailto:kk@therealdeal.com",
      "https://therealdeal.com/miami/2025/03/11/james-curnin-sells-waterfront-miami-beach-mansion-for-60m/",
      "https://therealdeal.com/miami/2025/03/14/ppg-development-bh3-nab-refi-for-slate-hallandale-beach/",
      "https://www.realtor.com/realestateandhomes-detail/1742-S-Ocean-Blvd_Palm-Beach_FL_33480_M51515-95078?from=srp-list-card",
      "https://www.miaminewtimes.com/arts/last-chance-to-see-the-great-elephant-migration-in-south-florida-22603374",
      "https://prismreports.org/2025/03/12/construction-worker-safety-miami/",
      "https://apnews.com/article/florida-citrus-oranges-hurricanes-agriculture-1b15f4d51cd6df41188a1884aa38dd8e",
      "https://www.tampabay.com/news/florida-politics/2025/03/14/florida-insurance-profits-premiums-report-billions/"
    ],
    "market": "South Florida",
    "published": "Sun, 16 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-16T17:00:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/16/relateds-jackson-square-development-moves-forward/",
    "title": "Related California goes from “contrarian” to conviction on Jackson Square hotel-office tower",
    "subhead": "Plus Ralph Lauren, Blue Bottle, Sweetgreen to open new SF locations, $32 million Jackson Square buy and more San Francisco real estate news",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 16, 2025, 1:00 PM",
    "pub_date_dt": "2025-03-16T13:00:00",
    "content": "Jackson Square was the market to watch this week, as Related California explained how its one-time “contrarian bet” on developing a\n41-story office-hotel tower\nin the neighborhood has turned to firm conviction about the future of the enclave.\nRalph Lauren got in the mood, too, opening a Polo store there after shuttering two previous locations in the city, and\nBrick and Timber Collective\nclosed a $32 million deal with a Michelin-starred chef as a partner.\nRelated’s plans call for a 544-foot tower with 360,000 square feet of offices atop a five-star, 200-room hotel at 530 Sansome, plus a new firehouse at 447 Battery Street to replace a station overtaken by the project. A previous 19-story hotel and fitness club project, approved in 2021, stalled.\n“This started out as a contrarian bet but as we dug in deeper and looked at the market, how it is evolving and maturing out of Covid, it doesn’t seem so contrarian any more,” Gino Canori, president of Related California, told the San Francisco Chronicle.\nRelated hopes to secure approvals to build the tower this fall, allowing the firm to break ground by late next year. If all goes well, it could be completed by 2030.\nMichelin-starred chef, Ralph Lauren come to Jackson Square\nRestaurateur Peter Hemsley of Michelin-starred Aphotic\njoined forces\nwith developer Brick &amp; Timber, which keeps its headquarters in the neighborhood, to buy a 15,600-square-foot store and building at 530 Jackson Street for $32.4 million, or over $2,000 a square foot.\n\nHemsley announced last year he would shut Aphotic, blaming the SoMa location. It’s not clear whether the chef intends to revive the sustainable seafood restaurant or launch a new concept in the ground-floor space that was home to Kells Irish Restaurant and Pub for decades. Paul McAleese is the owner of Kells Irish Restaurant and Bar as well as the seller of 530 Jackson.\nJust down the street from 530 Jackson, Ralph Lauren opened its first new store in the city in years.\n“The opening of Polo Ralph Lauren in Jackson Square is a testament to the neighborhood’s growing appeal as a premier destination for retail,” Robbie Silver, CEO of the Downtown SF Partnership, said in a statement.\nSweetgreen, Blue Bottle sign long-term Mission Rock leases\nIn further retail news, Mission Rock developers Tishman Speyer and the San Francisco Giants announced\ntwo new long-term deals\nat their Mission Bay development. Blue Bottle Coffee and Sweetgreen have signed 10-year leases at Mission Rock and Arsicault bakery finally opened its doors in the development.\nOakland-founded Blue Bottle will occupy 2,069 square feet at the base of the building occupied by Visa at 300 Toni Stone Crossing. Salad-and-grain bowl shop Sweetgreen will take just under 2,400 square feet at the base of The Canyon, a residential tower at the intersection of Dr. Maya Angelou Lane and Toni Strone Crossing.\nAlex Sagues and Madeline Mandanis represented the landlords in the deal. Sagues called Mission Bay “the most vibrant neighborhood in San Francisco”. He said retailers are drawn to the transit-friendly area because “it is a true seven-day neighborhood,” with office, life sciences, residential, and the UCSF hospital, as well as events at Chase Center and Oracle Park.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/02/11/brick-timber-bullish-on-sf-office-despite-citys-policies/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/",
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2025/03/10/star-chef-brick-timber-join-up-on-sf-jackson-square-buy/",
      "https://therealdeal.com/san-francisco/2025/03/11/blue-bottle-sweetgreen-sign-leases-in-sfs-mission-rock/"
    ],
    "market": "San Francisco",
    "published": "Sun, 16 Mar 2025 17:00:00 +0000",
    "published_dt": "2025-03-16T17:00:00+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/16/trump-tariffs-drive-up-housing-costs/",
    "title": "How Trump’s tariffs are reshaping real estate’s future",
    "subhead": "Administration’s trade policies add fuel to surging rents, stalled construction projects",
    "authors": "ByMike Romano",
    "pub_date": "Mar 16, 2025, 9:30 AM",
    "pub_date_dt": "2025-03-16T09:30:00",
    "content": "President Donald Trump’s second-term trade policies are shaking up the market in ways that landlords, developers and homebuyers can’t afford to ignore. From surging rents to stalled construction projects, the impact of tariffs is rippling through the industry.\nThe uncertainty surrounding Trump’s tariffs and economic policies is pushing potential homebuyers to the sidelines, and that hesitation is driving\nrental prices to record highs\n.\nIn New York City, Manhattan’s median rent hit a fresh high of $4,500 in February — its highest level since 2023. Brooklyn and Queens are feeling the pressure too, with Brooklyn rents averaging over $4,000 and Northwest Queens surpassing $3,400.\nChicago isn’t far behind. Downtown apartment rents just broke the $3,000 threshold for the first time ever, and with\nsupply cratering\ndue to high construction costs, developers are holding back — meaning rents are only expected to spike further in 2025.\nTenants are afraid to take the plunge into homeownership amid fluctuating mortgage rates and economic instability. The result is lower vacancy rates, more bidding wars and landlords with the upper hand. With summer around the corner, expect even higher rents in the months ahead.\nWhile mortgage rates have\ndipped\nsince Trump’s return to the White House, experts say the unpredictability surrounding his tariffs is outweighing any potential savings — causing some renters who once considered buying to think again.\nThe outlook for new homes isn’t any rosier, and homebuilders are\nscrambling\n.\nTrump’s tariffs on steel, aluminum and lumber imports are\ndriving up costs\n, forcing builders to get creative. Some are stockpiling materials, gambling that today’s prices are better than what’s to come. Others are shrinking floorplans or pivoting to modular construction. The National Association of Home Builders estimates these tariffs could add $7,500 to $10,000 to the\ncost of a new home\n.\nAnd in places like California, where developers are already dealing with fire recovery costs, the\nadded expense\ncould mean the difference between rebuilding and walking away from projects altogether.\nPoliticians and pundits are pointing fingers at Commerce Secretary Howard Lutnick as the\narchitect of Trump’s tariff strategy\n. While Trump’s unpredictability has long been a hallmark of his economic policy, the former Cantor Fitzgerald head’s mixed messaging is keeping investors and industry players on edge.\nIn Texas, where industrial development has been booming, big players like Ross Perot Jr. are considering baking “\ntariff clauses\n” into contracts to prepare for rising costs. Meanwhile, Citadel founder Ken Griffin isn’t\nmincing words\n— calling Trump’s trade policies a “huge mistake” that could cripple the economy.\nHuge mistake or not, the uncertainty and chaos surrounding Trump’s tariffs is certainly making it difficult to stay ahead of the curve.\nOutside of Trump’s tariffs, there was plenty of news this week. Mark Nussbaum is in the spotlight after allegations of missing funds, HomeServices of America denied reports that its subsidiaries are being acquired by Compass, and RXR and SL Green nabbed a modification on a $940 million loan.\n\nHow Mark Nussbaum went from transactional lawyer to escrow-funded dealmaker\nHigh-profile real estate attorney Mark Nussbaum is at the center of a\ngrowing scandal\nafter multiple lawsuits alleged millions of dollars went missing from his escrow accounts. Nussbaum’s web of connections includes real estate investors already entangled in federal mortgage fraud investigations, including indicted investors Moshe Silber and Boruch Drillman.\nHomeServices CEO denies Compass deal talks\nThe head of Berkshire Hathaway HomeServices called bull on a Wall Street Journal report claiming Compass was in “advanced talks” to\nacquire the firm\n. The move would have been a major step in what has become a 12-month period of rapid consolidation for Compass, the nation’s largest brokerage by deal volume.\nRXR, SL Green save $940M Worldwide Plaza loan from special servicing\nRXR and SL Green have secured a loan modification for the $940 million mortgage on\nWorldwide Plaza\nafter the departure of a major tenant sent the property into distress. The 825 Eighth Avenue office tower landed in special servicing last year after law firm Cravath, Swaine &amp; Moore vacated, wiping out nearly half of the building’s rent roll.\nElliman closes bumpy 2024 with $76M loss\nDouglas Elliman ended 2024 with a\n$76 million loss\n, up from $43 million in 2023, as it faced leadership changes, lawsuits and scrutiny. Despite the losses, the firm grew revenue to nearly $1 billion, while cutting expenses by $20 million as part of an ongoing cost-reduction strategy.\nFlorida bills aim to boost HOA and condo association oversight, ease structural integrity requirements\nThe Florida Legislature is considering bills that target two of the thorniest issues at condo and homeowners associations:\nalleged fraud and structural requirements\n. To combat fraud, this legislative session’s bills seek to introduce an investigations pilot program and expand the powers of state oversight agencies. Other bills deal with structural safety requirements imposed on condo associations following the deadly Champlain Towers South collapse in Surfside in 2021.\nBenedict Canyon site once set for Bulgari hotel hits market for $175M\nA megalisting priced at $175 million has hit the market in what’s been a\ndrawn-out saga\nfor a piece of Benedict Canyon once slated for a Bulgari-branded hotel. The 15-parcel listing located in Beverly Hills Post Office now ranks as the third-priciest property on the market within Los Angeles County.\n“Land speculation becomes problematic”: Chicago cracks down on more debtors\nThe city of Chicago is going after its\nmost problematic landowners\n. Goldmine Investments and QCD Financial follow a pattern of owners being pursued by a city task force that’s designed to pin down Chicago’s most indebted landowners. The two firms face millions in fines after buying up distressed properties, often vacant lots in disadvantaged neighborhoods, and allegedly letting them decay.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/13/nyc-rents-smash-new-record-in-february/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/national/2025/03/05/mortgage-rates-fall-to-three-month-low-mba/",
      "https://therealdeal.com/national/2025/02/19/homebuilders-post-election-confidence-wilts/",
      "https://therealdeal.com/national/2025/02/11/trumps-steel-aluminum-tariffs-to-hammer-homebuilders/",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/la/2025/01/31/trump-tariffs-could-jack-up-costs-for-building-materials/",
      "https://therealdeal.com/national/2025/03/12/howard-lutnick-blamed-for-trumps-tariff-chaos/",
      "https://therealdeal.com/texas/2025/02/21/ross-perot-jr-s-firm-bracing-for-trumps-tariffs-deportations/",
      "https://therealdeal.com/new-york/2025/02/12/ken-griffin-takes-donald-trump-to-task-on-tariffs/",
      "https://therealdeal.com/new-york/tristate/2025/03/10/mark-nussbaums-escrow-mess-explained/",
      "https://therealdeal.com/new-york/tristate/2025/03/10/mark-nussbaums-escrow-mess-explained/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/new-york/2025/03/13/sl-green-rxr-nab-mod-on-940m-worldwide-plaza-loan/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/miami/2025/03/12/roundup-of-2025-florida-condo-association-hoas-bills/",
      "https://therealdeal.com/miami/2025/03/12/roundup-of-2025-florida-condo-association-hoas-bills/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/new-york/2025/03/13/nyc-rents-smash-new-record-in-february/",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/national/2025/03/12/howard-lutnick-blamed-for-trumps-tariff-chaos/"
    ],
    "market": "National",
    "published": "Sun, 16 Mar 2025 13:30:00 +0000",
    "published_dt": "2025-03-16T13:30:00+00:00",
    "author": "Mike Romano"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/16/how-chicago-landlords-raised-rents-past-new-milestone/",
    "title": "How Chicago landlords raised rents past new milestone",
    "subhead": "Plus, Salesforce Tower lands massive CMBS loan, the city cracks down on more negligent real estate debtors and more Chicagoland real estate news",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 16, 2025, 9:00 AM",
    "pub_date_dt": "2025-03-16T09:00:00",
    "content": "Chicago landlords are set up to strongarm rent hikes this year and beyond.\nLeases struck within a group of 84 downtown buildings tracked by brokerage Luxury Living\nsurpassed an average of $3,000 per month\nlast year for the first time ever. With new supply limited by developers grappling with higher interest rates and construction costs, landlords are projected to have the upper hand until 2027, the earliest that a significant wave of rental deliveries is expected.\nChicago’s top city lawyers are taking aim at the\nmost negligent property owners\n, and\nThe Real Deal\nis taking a look inside their plights.\nSuzie Wilson, dubbed the city’s “worst landowner” by public officials, is nearing a $11.5 million settlement that could also include\na ban from investing in Chicago property\n.\nThe settlement would resolve the nearly $50 million in debts and legal claims she’s estimated to owe the city, and she’s not alone. The city is ramping its pursuit of two more firms,\nGoldmine Investments and QCD Financial\n, that similarly assembled large portfolios of properties on the South and West sides through delinquent tax sales and racked up a combined $9 million in unpaid fines and interest owed to the city through allegedly neglecting their real estate.\n\nIn the office market, the recently stubborn CMBS spigot loosed up to\nrain down $610 million on the owners of the newly built Salesforce Tower\n, which includes Hines and Chicago-based Chris Kennedy’s famous political family. The deal replaces $549 million in construction debt.\nOn the other side of the financial spectrum,\nBeacon Capital Partners’ 190 North LaSalle Street\nwas listed for sale with Cushman &amp; Wakefield, and, like several of its fellow office buildings in the central Loop, has potential to fall short of its debt with its ultimate sale price.\nThe\nFarpoint-led team redeveloping the former Michael Reese Hospital site\nin Bronzeville released its vision for the Chicago Bears’ new stadium to be built on the land. While the NFL team hasn’t expressed any interest in the site as of yet, the developer is hoping to sway the team away from its previously announced plans to either build a new stadium just south of Soldier Field or outside of the city in Arlington Heights.\nOut in the suburbs, developer\nAdvent Properties scrapped a 278-unit Des Plaines\napartments project, investor\nZell Kravinsky paid $19.3 million\nto FPA Multifamily for a 63-unit Algonquin apartment complex and FPA Multifamily turned around and bought a\nbig Naperville apartment complex for $68 million\n.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/01/22/infamous-chicago-landlord-lists-bankruptcy-sale-of-over-800-lots/",
      "https://therealdeal.com/chicago/2025/03/10/chicago-plots-next-moves-against-suzie-wilson-more-negligent-landowners/",
      "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/03/14/farpoint-visualizes-chicago-bears-stadium-in-bronzeville/",
      "https://therealdeal.com/chicago/2025/03/14/advent-properties-withdraws-suburban-chicago-multifamily-plans/",
      "https://therealdeal.com/chicago/2025/03/14/zell-kravinsky-buys-suburban-chicago-apartments/",
      "https://therealdeal.com/chicago/2025/03/10/fpa-multifamily-buys-suburban-chicago-asset-via-assumable-debt/",
      "https://therealdeal.com/chicago/2025/03/08/digging-into-chicagos-biggest-brokers-and-builders/",
      "https://therealdeal.com/magazine/december-2024/back-at-it/"
    ],
    "market": "Chicago",
    "published": "Sun, 16 Mar 2025 13:00:00 +0000",
    "published_dt": "2025-03-16T13:00:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/15/prologis-mixed-use-play-could-add-new-life-to-arts-district/",
    "title": "Prologis project could breathe new life into DTLA’s Arts District",
    "subhead": "Plus, locals say they’re OK with restricting building in fire-prone areas, La Cañada Flintridge retreats on builder’s remedy pushback and more LA real estate news",
    "authors": "ByKari Hamanaka",
    "pub_date": "Mar 15, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-15T12:00:00",
    "content": "Talk around downtown Los Angeles’ Art District isn’t as buzzy as it once was.\nA\nredevelopment project from Prologis\nthat’s expected to break ground in 2027 could help breathe new life into the conversation around the most directional of downtown’s neighborhoods, which is sandwiched between Skid Row and Boyle Heights.\nA new planning study by Prologis calls for a 9-acre entertainment campus at a former Greyhound bus station. The campus at 1716 East 7th Street includes 364,000 square feet of studio space, offices, production support facilities and parking.\nIf all goes as planned, the project will break ground in 2027 and be completed two years later.\nOnce done, it could help to create a critical mass of residential, office and retail uses at the intersection of Alameda and 7th streets. Prologis’ project is less than a half-mile walk to the\nRow DTLA retail and office complex\nor the recently opened Ava Arts District apartments, both located on Alameda Street.\nPoll finds support for building restrictions in fire-torn areas\nResults from a poll conducted by the Berkley Institute of Governmental Studies, co-sponsored by the Los Angeles Times, showed L.A. County residents were open to\nrestricting home building in fire-prone areas\n— to the tune of 70 percent of the nearly 5,200 registered voters surveyed between Feb. 17 and Feb. 26.\nMeanwhile, those same poll participants were a little more than halfway split down the middle on building higher-density projects, with 55 percent in support of said developments in urban areas.\nThe poll results call into question whether other cities in the county would be open to offsetting any housing shortage created should there be restrictions on building in fire-ravaged areas. In such a case, more time would no doubt be tacked onto efforts to quickly rehouse those who wish to return to homes damaged or destroyed by the fires.\nBuilder’s remedy claims another win, this time in foothills\nSticking with the subject of building, this week brought more news for housing proponents by way of builder’s remedy.\nA legal battle between a proposed mixed-use development and the\ncity of La Cañada Flintridge\nis over. City officials gave up fighting the project, which would have consisted of apartments, hotel rooms and over 7,300 square feet of office space at 600 Foothill Boulevard.\n\nDeveloper Cedar Street used the builder’s remedy loophole in state housing law to bypass city zoning requirements in exchange for including low-income homes. The city pushed back. However, a judge’s order to either pay a $14 million bond or back off resulted in the latter by the city.\nLa Cañada Flintridge is the latest example in a rising tension playing out publicly between state and local governments.\nResi’s whopping land listing\nIntrigue abounds around who might buy a\n$175 million, multi-parcel land listing\n.\nThe 33 acres, spread across 15 parcels in Benedict Canyon comes with a controversial past. Developer Gary Safady once aimed to build on site a Bulgari-branded hotel with 59 rooms, plus eight single-family residences ranging in size from 12,000 to 48,000 square feet.\nThe proposed project was axed in 2023 after then-planning director Vincent Bertoni caved to pressure from project critics and wrote a letter to Safady that called out project impacts well beyond what the city originally expected.\nSafady pulled a $30 million loan on the property from Motcomb Estates, the real estate investment arm for the Reuben Brothers. Records show Safady defaulted on the loan in November with Motcomb alleging a nearly $50 million unpaid balance at the time, pushing the parcels to the sales block.\nIt’s unclear whether another developer might have a go at the property and buy it for purposes of another project. Any proposal is likely to face much of the same scrutiny Safady had in moving the Bulgari Resort Los Angeles forward.\nKeeping up with the OC\nCompared to a $175 million listing, the $16.3 million trade of a Laguna Niguel mansion may seem small. However, the closing marked an all-time record for the city.\nThe sale of the Spanish-style mansion in the gated community of Bear Brand Ranch also set a price-per-square-foot record in Laguna Niguel. The home at\n7 Searidge\npenciled out to $1,993 per square foot. That’s well beyond the $625-per-square-foot held by the city’s former residential record: a two-lot deal that closed in 2014 for $15 million.\nAs Orange County sees more unique developments come online, such as Almquist’s River Street Marketplace in San Juan Capistrano, it’s helping lend an air of cool and renewed desirability in the residential communities south of Los Angeles County.\n",
    "related_links": [
      "https://therealdeal.com/la/2025/03/10/prologis-shifts-gears-on-arts-district-plan/",
      "https://therealdeal.com/magazine/january-2025/why-these-retail-players-are-betting-on-malls-for-la-millennials-with-money/",
      "https://therealdeal.com/la/2025/03/12/survey-suggests-swap-more-urban-density-for-restrictions-on-wildfire-zones/",
      "https://therealdeal.com/la/2025/03/13/la-canada-flintridge-ditches-appeal-to-builders-remedy-project/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
      "https://therealdeal.com/la/2025/03/10/oc-manse-trades-for-16m-to-set-laguna-niguel-record/",
      "https://therealdeal.com/la/2025/03/13/la-canada-flintridge-ditches-appeal-to-builders-remedy-project/",
      "https://therealdeal.com/la/2025/03/10/prologis-shifts-gears-on-arts-district-plan/",
      "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/"
    ],
    "market": "Los Angeles",
    "published": "Sat, 15 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-15T16:00:00+00:00",
    "author": "Kari Hamanaka"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/15/west-village-record-smashed-and-financial-district-flop/",
    "title": "West Village record smashed and Financial District flop?",
    "subhead": "A tale of two cities, the tiniest townhouse, a Brooklyn rental tower takeover, the ongoing debate over NIMBYism and the housing crisis and more New York real estate news",
    "authors": "ByHolden Walter-Warner",
    "pub_date": "Mar 15, 2025, 11:00 AM",
    "pub_date_dt": "2025-03-15T11:00:00",
    "content": "For years, the most new development inventory has been concentrated in the Financial District. But an analysis of public records found unsold buildings in the area accounted for\nmore than 20 percent\nof Manhattan’s unsold units. An ill-timed development influx has left overpriced units piling up in Lower Manhattan.\nOne unit\nthat was sold\nin Downtown Manhattan was a West Village condo owned by Harsh Padia, CEO of HAP Capital. The sale of the unit for $60 million in an off-market deal represented a record for the most expensive condo in the area.\nThe Real Deal\nexplored the story\nof the tiny townhouse at 19 West 46th Street, a Midtown Manhattan relic that may be the third-narrowest in the entire borough. Glance down at your phone — maybe to look at a\nTRD\nalert — and you might miss it!\nIt stands in sharp contrast to the Hub, a 55-story rental tower in Brooklyn. Steiner NYC\ntook full control\nof the property back after buying out JPMorgan Chase in a $420 million recapitalization of the 750-unit mixed-use building at 333 Schermerhorn Street.\n\nThis week brought\nthe reveal\nof one of Manhattan’s newest “It” buildings. Zeckendorf Development and Atlas Capital Group’s luxury project at 80 Clarkson Street in the West Village is expected to quietly start sales this month. The most expensive unit with pricing available is a $63 million five-bedroom condo on the 31st floor.\nAs for more development? The concentration of projects in select neighborhoods is driving an important conversation: the\nrhetoric of the NIMBY movement\nmay be fueling the city’s housing crisis in a real way.\nThis week, Senate and Assembly Democrats released responses to Gov. Kathy Hochul’s executive budget, with both proposing more restrictions on institutional investors of single-family homes and higher tax rates for the state’s top earners.\nThe state budget is due in less than three weeks.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/13/fidi-condo-development-boom-sales-nyc-supply/",
      "https://therealdeal.com/new-york/2025/03/13/witkoffs-150-charles-sets-new-downtown-record/",
      "https://therealdeal.com/new-york/2025/03/12/the-story-behind-the-teeny-tiny-townhouse-at-19-west-46th-street/",
      "https://therealdeal.com/new-york/2025/03/13/steiner-takes-sole-ownership-of-dobro-rental-tower/",
      "https://therealdeal.com/new-york/2025/03/11/details-emerge-on-pricing-at-80-clarkson/",
      "https://therealdeal.com/new-york/2025/03/12/nyc-housing-disparity-unfair-but-projects-arent-a-burden/",
      "https://therealdeal.com/new-york/2025/03/13/fidi-condo-development-boom-sales-nyc-supply/",
      "https://therealdeal.com/new-york/2025/03/13/witkoffs-150-charles-sets-new-downtown-record/",
      "https://therealdeal.com/new-york/2025/03/12/the-story-behind-the-teeny-tiny-townhouse-at-19-west-46th-street/"
    ],
    "market": "New York",
    "published": "Sat, 15 Mar 2025 15:00:00 +0000",
    "published_dt": "2025-03-15T15:00:00+00:00",
    "author": "Holden Walter-Warner"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/15/pets-co-ops-and-a-major-acquisition-this-weeks-reporter-notes/",
    "title": "Are co-ops loosening pet rules? Is Compass acquiring another brokerage?",
    "subhead": "TRD explores these questions and more in notes from an NYC resi reporter",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 15, 2025, 10:00 AM",
    "pub_date_dt": "2025-03-15T10:00:00",
    "content": "The Agency’s Mike Fabbri was almost across the finish line on a Downtown Manhattan co-op sale.\nHis buyer, a woman in her 30s, had already signed a contract for the apartment and agreed to pay in cash. All that was left was the board application, a historically arduous process, but he was confident she fit the bill.\nThen came deal-breaking news — his buyer was the proud owner of a cockatoo.\nFabbri scrambled to pull together documentation that might convince the board that a new winged resident wasn’t such a bad idea. He collected letters of recommendation from his buyer’s previous landlord and a friend who used to watch her bird on occasion. Her doctor wrote a note testifying to the bird’s capabilities as an emotional support animal.\nThe co-op board rejected her bid. Boards don’t typically give a reason for their refusal, but given her other qualifications, Fabbri suspects it was the cockatoo.\nIn my time as a reporter, brokers across the city have recounted similar tales, especially when selling Manhattan co-ops, where rules are stringent and even the slightest error on a board package — or a dog teetering on the edge of 50 pounds — can scrap a deal.\nAs prices for co-ops stagnated, and buyers turned increasingly to condos, agents say several boards have\nrelaxed many of their policies\n, allowing buyers to finance more of their purchase or renovate their apartments in months that aren’t June, July or August.\nCould requirements for pets, which appraiser Jonathan Miller\nonce referred to\nas a “dog weighing-in ceremony,” be the next to ease? While most still have weight and breed restrictions, blanket bans on pets are likely near impossible, since the pandemic prompted many New Yorkers to adopt a furry family member.\n“People are not giving up their dogs, even if they love the apartment,” said Brown Harris Stevens’ Lisa Simonsen. “Some people would probably prefer to leave behind a teenager.”\nEven with restrictions still in place, brokers have found ways to skirt around the rules — and it usually involves tacking on a few numbers to the purchase price.\nOne of Simonsen’s buyers was approved to buy a Park Avenue co-op, despite her two 70- to 80-pound hunting dogs.\n“When you get to the point that you’re getting full ask or over ask, they don’t say no so quickly.”\nUnlike Fabbri, other brokers have gotten lucky with the paperwork. About eight years ago, Compass’ Vickey Barron was representing a doctor in the purchase of a co-op on lower Fifth Avenue.\n\nDuring the board interview, a member asked him if anyone would be staying in his apartment, to which he replied, his girlfriend, and potentially her dog. His response sent Barron on a chase to assemble the dog’s vaccination records, adoption papers and anything else she could think of to prove the dog wouldn’t be a problem.\nThe board’s final request was for her buyer to bring the dog in for an interview.\nThe pup must have passed the test because Barron’s buyer got the apartment. But last she checked, he’d lost the girlfriend. And her dog.\nNot so fast…\nThe time for acquisitions is now — at least that’s what Real Trends co-founder Steve Murray\nprophesied on a panel\nat the HousingWire conference almost a year ago. And the latest headlines are proving him right.\nRumors swirled on Thursday that Compass was closing in on a deal to buy Berkshire Hathaway HomeServices. The speculation was all but confirmed in the afternoon when the Wall Street Journal reported that the firms were in\n“advanced talks,”\nthough the story lacked any specifics about the pending sale.\nHomeServices CEO Gino Blefari\nrefuted the reporting\nin an email sent around to franchisees, claiming “no such sale is being contemplated.”\nTales of the alleged acquisition came just months after Compass purchased @properties and Christie’s International Real Estate,\na $444 million sale\nthat sent shockwaves across the industry. In New York City, Compass and the local BHHS affiliate were both among the\ntop brokerages\nby sales volume in 2023, with Compass holding the No.2 spot with $5 billion in sell-side deals and BHHS in 18th with just under $100 million.\nIn the first two weeks of March, other major national brokerages have announced deals of their own. Keller Williams Realty, the largest brokerage by agent count, sold\na significant stake\nto Stone Point Capital, the parent company of CoreLogic. Earlier this week, mortgage firm Rocket Companies\npaid $1.75 billion\nto acquire Redfin.\nWith two deals in the books before the end of the first quarter, signs are pointing toward more acquisitions in the year to come — even if Compass buying BHHS isn’t one of them.\nNYC Deal of the Week\nActress Grace Hightower sold the Central Park West co-op she shared with her ex-husband, Robert De Niro, for\n$18 million\nin the priciest deal to close in the city this week. The couple bought the apartment at 88 Central Park West for $21 million almost two decades ago.\nThe home, which De Niro and Hightower renovated after a fire in 2012, has five bedrooms, views of Central Park and an eat-in kitchen.\n",
    "related_links": [
      "https://therealdeal.com/magazine/national-october-2023/how-co-ops-are-coping-with-a-changing-world/",
      "https://housingnotes.com/june-19-2015/",
      "https://www.housingwire.com/articles/now-is-a-great-time-for-brokerage-acquisitions-realtrends-consulting/",
      "https://therealdeal.com/national/2025/03/13/compass-in-talks-to-acquire-bhhs/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/national/2024/12/02/compass-is-acquiring-properties-christies-real-estate/",
      "https://therealdeal.com/magazine/march-2024/ranking-nycs-top-brokerages-of-2023/",
      "https://therealdeal.com/national/2025/03/04/keller-williams-takes-private-equity-investment/",
      "https://therealdeal.com/national/2025/03/10/rocket-companies-acquiring-redfin-for-1-75b/",
      "https://therealdeal.com/new-york/2025/03/10/grace-hightower-robert-de-niros-ex-wife-sells-co-op-for-18m/",
      "https://therealdeal.com/magazine/may-2024/the-crucial-comeback-of-nycs-co-ops/",
      "https://therealdeal.com/new-york/2025/02/26/inside-park-slopes-rising-condo-market/",
      "https://therealdeal.com/magazine/national-october-2023/how-co-ops-are-coping-with-a-changing-world/"
    ],
    "market": "New York",
    "published": "Sat, 15 Mar 2025 14:00:00 +0000",
    "published_dt": "2025-03-15T14:00:00+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/15/breaking-down-a-compass-deal-for-berkshire-hathaway-homeservices/",
    "title": "Will they, or won’t they? Breaking down the Compass, HomeServices deal drama",
    "subhead": "Mega-deal, which HomeServices CEO denied, would supercharge Compass’ M&A mission",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 15, 2025, 9:00 AM",
    "pub_date_dt": "2025-03-15T09:00:00",
    "content": "The residential real estate world has been in the spin cycle in the last 24 hours.\nA bombshell report from the\nWall Street Journal\nThursday said Compass, the country’s largest real estate brokerage, was\nnearing a deal to acquire\nBerkshire Hathaway’s real estate arm, HomeServices of America.\nBut HomeServices CEO Gino Blefari\ndenied the report in a memo\nreleased hours later to employees.\n“I want to confirm to you that there are no discussions, negotiations, or agreements to sell HomeServices or any of its affiliated companies, and that includes the Berkshire Hathaway HomeServices franchise business,” Blefari wrote, adding that “no such sale is being contemplated.”\nThe statement was a sharp pivot from the picture of “advanced talks” that made headlines, but weren’t enough to shut down the possibility of a deal materializing.\nAn acquisition, even one of such staggering proportions, would be\nin line with Compass’ ambitions\nfor market share and inventory. Compass, for its part, stayed quiet amid the mixed messaging, leaving the industry with more questions than answers.\nThe Berkshire perspective\nBlefari himself has acknowledged that he’s not always in the know when it comes to Berkshire Hathaway’s inner workings.\nHe told Housingwire in 2021 that he hadn’t spoken to Berkshire Hathaway’s CEO Warren Buffett in years, and that the trillion-dollar conglomerate’s performance doesn’t bleed into his brokerage’s operations. In that same interview, he also criticized Compass for not competing on a “level playing field” with its investor-fueled bonuses and lucrative splits.\nAny deal for the real estate arm would still be executed by Buffett’s firm, and there’s a chance that Blefari just hadn’t been clued in yet. Blefari has not responded to texts for comment, and an automatic email response said he was traveling for business for the remainder of the week.\nBut the deal would still be out of character for Buffett, who has a stated aversion to selling subsidiaries.\n“Berkshire almost never sells controlled businesses unless we face what we believe to be unending problems,” he wrote in a 2024 shareholder\nletter\n.\n\nA sale of HomeServices now would also run counter to Buffett’s guiding ethos of buying low and selling high, and likely signal Buffett’s long-term pessimism about the real estate market or Berkshire’s ability to compete in it.\nThe brokerage business was consistently profitable, making $160 million in 2019, $375 million in 2020 and $381 million in 2021. But after barely breaking in 2023, HomeServices lost $107 million in 2024, which it attributed to an industry downturn and settlement payments related to the Sitzer/Burnett antitrust lawsuit.\nThe real estate industry has suffered some of its worst years in recent memory as a result of high interest rates and the surge of buying and selling that came in the aftermath of the pandemic. But real estate is cyclical, and a sale now would likely not be maximizing HomeServices’s value.\nAn analyst who covers Compass also raised the possibility that the deal is not for the entire brokerage, but for pieces under its umbrella.\nThe Compass perspective\nThe deal, while shocking in its scale, is in line with the M&amp;A warpath Compass has been on in the past 12 months. At a recent investor day, Compass CEO Robert Reffkin noted the company’s strong M&amp;A momentum, albeit with a nod toward its appetite for smaller brokerages.\nThe firm’s biggest move came when it announced a $444 million deal for @properties and Christie’s International Real Estate towards the end of last year. The deals are part of the brokerage’s efforts to get up to 30 percent market share in its top 30 markets in the next five years.\nThis acquisition would be its largest to date. HomeServices is the fourth-largest brokerage in the country, with $4.4 billion in revenue last year compared to Compass’ $5.6 billion.\nBy total transaction volume, HomeServices is more than six times as large as @properties.\nBringing on HomeServices would also help grow Compass’ ancillary businesses, said Finley Hair, national director of M&amp;A Advisory at WAV Group, something that brokerages are increasingly focused on to combat their thin margins.\nA massive acquisition would be in good company on the residential consolidation front. This week, Rocket Companies announced a $1.75 billion deal to acquire Redfin, and earlier this year Keller Williams announced it was\nselling a majority stake\nto private equity firm Stone Point Capital.\nCompass has been pushing its off-MLS inventory, which only grows more valuable the larger it gets, and other companies may be seeing the writing on the wall.\n“There’s one thing that has never changed in the real estate business,” Hair said.  “He who controls the inventory, controls the market — Robert Reffkin understands that, and that’s what he’s going after.”",
    "related_links": [
      "https://www.wsj.com/real-estate/compass-in-talks-to-buy-warren-buffetts-real-estate-brokerage-unit-5eab82e5",
      "https://therealdeal.com/national/2025/03/13/compass-in-talks-to-acquire-bhhs/",
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://therealdeal.com/magazine/january-2025/compass-residential-upstart-turned-behemoth-plans-to-get-even-bigger/",
      "https://berkshirehathaway.com/letters/2024ltr.pdf",
      "https://therealdeal.com/national/2025/03/04/keller-williams-takes-private-equity-investment/"
    ],
    "market": "National",
    "published": "Sat, 15 Mar 2025 13:00:00 +0000",
    "published_dt": "2025-03-15T13:00:00+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/texas/2025/03/15/texas-republicans-block-las-vegas-sands-legalization-efforts/",
    "title": "Freshman lawmakers blocking Sands’ legalization efforts",
    "subhead": "Coalition opposes “any attempt to expand gambling” this session, which could kill a proposed megadevelopment in Irving",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 15, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-15T08:00:00",
    "content": "Will the Las Vegas Sands, owners of the Dallas Mavericks, manage to legalize gambling in Texas this legislative session?\nNot if a coalition of freshmen in the Texas House of Representatives gets its way. Twelve Republican lawmakers who replaced pro-gambling politicians in the last election are holding the line against casinos, the Texas Tribune\nreported\n. They are joined by three others who voted in favor of sports betting last session but have since rescinded their support.\nThey said this week they would oppose “any attempt to expand gambling” this session, which ends in May. After that, the Texas Legislature won’t meet in regular session again until 2027.\nProposals to legalize casinos and sports betting have been introduced, but the GOP coalition aims to stop them in their tracks. Neither proposal has received a committee hearing, the first step to consideration by the full house.\nThat could be bad news for the city of Irving, where Sands is seeking zoning approval for a Mavericks stadium with a resort and entertainment center, including a casino. Sands is spending big on lobbying and advertising campaigns in favor of “destination resort” casinos. If a casino is a no-go, Sands has said it is\nlikely to kill the entire proposal\n.\nMeanwhile in Southern Dallas, developer\nHoque Global\nmet its first deadline in its agreement with the city of Dallas for its University Hills megadevelopment. The firm now has\n60 days to purchase\nthe 270 acres for the development.\nOne of Fort Worth’s biggest development players,\nCrescent Real Estate\n, shifted its C-suite with the appointment of\nConrad Suszynski\nas sole CEO following the retirement of co-CEO Jason Anderson. Fort Worth is undergoing a development boom that is touching a beloved antique mall near the Cultural District, where\nPhoenix Property Company\nis planning a\n12-story hotel\n, plus retail and multifamily.\n\nIn office leasing news, the flight-to-quality trend reeled in some big fish.\nLaw firm Skadden, Arps, Slate, Meagher &amp; Flom leased 52,000 square feet spanning two full floors in\nHines’\nTexas Tower\nin Houston. The lease brings the building, at 845 Texas Avenue to 99 percent leased.\nAnother law firm, Hicks Johson, is spending $4.3 million to build out its lease at\nSkanska’s\nNorton Rose Fullbright tower at 1550 Lamar Street, which is\ndowntown Houston’s newest\noffice building.\nAnd a retail merchandiser is\nmoving its headquarters\nto 5801 Headquarters Drive in Plano, owned by\nMonarch Alternative Capital\nand\nTourmaline Capital Partners\nand built in 2021. The company will exit Granite Properties’ Granite Park III, which was built in 2007.\nAnd in Austin, Facebook and Instagram owner Meta Platforms is spending $3.7 million on an\noffice buildout in downtown Austin\n, although it’s not clear for whom.\n—Rachel Stone\n",
    "related_links": [
      "https://www.texastribune.org/2025/03/12/texas-gambling-sports-betting-casinos-house-republicans/",
      "https://therealdeal.com/texas/dallas/2025/03/13/backlash-rises-over-sands-vision-for-irving-casino-resort/",
      "https://therealdeal.com/texas/dallas/2025/03/12/hoque-global-has-60-days-to-buy-southern-dallas-acreage/",
      "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
      "https://therealdeal.com/texas/fort-worth/2025/03/14/phoenix-property-co-plans-highrise-hotel-amid-fort-worth-boom/",
      "https://therealdeal.com/texas/houston/2025/03/12/houstons-texas-tower-hits-99-leased-with-law-firm-signing/",
      "https://therealdeal.com/texas/houston/2025/03/12/skanskas-houston-tower-lands-law-firm-headquarters-lease/",
      "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/",
      "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
      "https://therealdeal.com/texas/dallas/2025/03/11/heres-what-could-happen-to-dallas-federal-buildings/",
      "https://therealdeal.com/texas/houston/2025/03/12/d-r-hortons-forestar-buys-land-for-home-lots-near-galveston/",
      "https://therealdeal.com/texas/houston/2025/03/14/houstons-largest-landowners-include-high-profile-homebuilders/"
    ],
    "market": "Texas",
    "published": "Sat, 15 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-15T12:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/state-farm-provisionally-can-do-22-insurance-rate-hike/",
    "title": "State Farm “provisionally” approved for 22% insurance rate hike",
    "subhead": "Insurance commissioner approves previously denied increase",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 8:09 PM",
    "pub_date_dt": "2025-03-14T20:09:00",
    "content": "State Farm General got its wish to hike home insurance rates by an average of 22 percent.\nThe news comes weeks after being\nstraight-armed\nby California’s chief insurance regulator for a request to increase rates because of the Los Angeles wildfires.\nCalifornia Insurance Commissioner Ricardo Lara “provisionally” granted the unit of Illinois-based State Farm Mutual Automobile Insurance the emergency rate increase requested after billions in wildfire claims,\nthe Los Angeles Times reported\n.\nBut the increase — which includes a 38 percent rate increase for rental buildings and 15 percent for renters and condo owners — won’t take effect until a hearing slated for April 8.\nLara approved the increase on March 14 after\nturning down the request last month\n, saying the insurer had failed to prove it was warranted.\nHe’d given the insurer an opportunity, however, to provide more evidence to justify the request.\nIn making his decision, Lara called on State Farm to halt any pending nonrenewals of customers statewide and for the insurer’s parent company to provide its California insurer an infusion of $500 million to stabilize its capital position, according to the Times.\n“The role of insurance commissioner involves balancing a stable and sustainable insurance market that serves consumers with effective oversight,” he said in a statement. “To ensure long-term choices for Californians, I had to make an unprecedented decision in the short term.”\n“The facts will be revealed in an open, transparent hearing,” he added.\n\nState Farm has faced years of losses and huge damage claims after the\nJan. 7 fires\nthat raged Pacific Palisades to Altadena, and leveled more than 12,000 homes.\nAs of March 11, State Farm General and its parent have received more than 12,000 fire and auto claims related to the wildfires, and paid\nmore than $2.2 billion to customers\n.\nState Farm General has estimated it will pay out $7.9 billion in the wake of the Palisades, Eaton and other L.A. County fires.\nBut, its net losses from the fires will be closer to $600 million after reinsurance payments, which largely will come from its parent company. Reinsurance is bought by insurers from other insurers to protect themselves from catastrophic events.\nLast March, the company announced it would\nnot renew 72,000 home, apartment and other property policies\nin California, citing wildfire risks and other concerns.\nThat followed a\ndecision in May 2023\nto stop writing insurance for new businesses, homeowners, and other personal property and casualties in the state, with the exception of personal auto policies.\nIn June, State Farm\nrequested a 30 percent rate increase for its homeowners policies\n, as well as other rate hikes, which await a decision. The request took state officials by surprise, with Lara saying it raised “serious questions about its financial condition.”\nState Farm General last month said it’s lost $2.8 billion over the last nine years, including gains from investment income. State Farm Group, led by State Farm General’s parent company, was given a superior financial rating in December by a rating agency.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://www.latimes.com/business/story/2025-03-14/insurance-commissioner-decides-to-provisionally-grant-state-farms-22-rate-hike",
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://www.latimes.com/california/story/2025-02-11/strongest-southern-california-storm-in-a-year-what-to-know",
      "https://newsroom.statefarm.com/state-farm-is-here-to-help-california-customers-impacted-by-wildfires/",
      "https://www.latimes.com/california/story/2024-03-23/state-farm-wont-renew-72-000-insurance-policies-in-california-worsening-the-states-insurance-crisis",
      "https://newsroom.statefarm.com/state-farm-general-insurance-company-california-new-business-update/",
      "https://therealdeal.com/la/2024/06/28/state-farm-seeks-steep-home-insurance-hikes-in-california/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/18/california-insurance-commish-to-state-farm-go-pound-ashes/",
      "https://therealdeal.com/la/2025/02/05/state-farm-seeks-38-rate-hike-on-rental-buildings/",
      "https://therealdeal.com/la/2024/06/28/state-farm-seeks-steep-home-insurance-hikes-in-california/"
    ],
    "market": "Los Angeles",
    "published": "Sat, 15 Mar 2025 00:09:17 +0000",
    "published_dt": "2025-03-15T00:09:17+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/phoenix/2025/03/14/arizonas-richest-person-buys-final-piece-in-mesa-mall-site/",
    "title": "Arizona’s richest person joins mall-to-mixed redevelopment trend with Mesa",
    "subhead": "Firm owned by Ernest Garcia II buys last piece of 80-acre site for $24M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-14T19:30:00",
    "content": "Verde Investments has finished buying up a demolished mall to build a retail village of up to 4,000 homes in Mesa, east of Phoenix.\nThe Tempe-based investor led by billionaire Ernest Garcia II paid nearly $24 million for the final 34 acres at the former Fiesta Mall site at 1445 West Southern Avenue,\nthe Phoenix Business Journal reported\n.\nThe deal works out to $705,882 an acre, completing the final land purchase of the 80-acre mall site.\nSeller MMCP, a limited liability company of undisclosed origin, bought the 34-acre chunk in 2017 for $6.7 million, or $197,059 per acre.\nIn December, Verde\nreceived a green light from the city\nto redevelop the former indoor mall.\nPlans for the development, dubbed Fiesta Redefined and designed by Texas-based Nelsen Partners, call for up to 4,000 homes, 1.9 million square feet of offices, shops and restaurants, and more than 500,000 square feet of open space.\nCost and timeline for the project were not disclosed.\nRezoning of the former mall site commenced late last year on the southwest corner of Southern Avenue and Alma School Road.\n\nThe city of Mesa has\npointed\nto the redevelopment of Fiesta Mall as among the “optimal uses of real estate within the city,” according to the Business Journal.\nThe 1.2 million-square-foot mall, which officially opened in 1979, was developed by Sears Roebuck and Company, which was among its anchor stores. Once a retail mecca for greater Phoenix, the mall slid into decline and closed in 2018. It was razed in 2023.\nVerde is seeking partners to advance the redevelopment.\n“We are aware that Verde Investments is actively marketing the land to potential developers,” Mesa City Manager Chris Brady told the Business Journal in a statement. “We’ve had conversations with national and regional developers who have expressed interest in the site’s potential.\n“While no deal has materialized yet, we are confident it is a matter of time for a developer to present a proposal that will bring jobs and offer quality mixed-use development.”\nVerde Investments, a holding company founded in 1992 by Garcia, invests in commercial properties. Its Verde Outdoor owns more than 1,200 billboards across the U.S.\nGarcia is the\nlargest shareholder\nof Tempe-based Carvana, a sub-prime lender and online retailer of used cars, and owns DriveTime Automotive, a used-car dealership in Phoenix. A\nconvicted felon\nstemming from the Lincoln Savings &amp; Loan scandal, he is the\nrichest person in Arizona\n, according to the Business Journal, with a value pegged by Forbes at\n$14.5 billion\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/phoenix/news/2025/03/13/fiesta-redefined-developer-purchases-site.html",
      "https://therealdeal.com/national/phoenix/2024/12/11/verde-investments-to-build-retail-urban-village-in-mesa/",
      "https://www.bizjournals.com/phoenix/news/2024/10/17/mesa-gives-update-on-redevelopment-strategy.html",
      "https://www.bizjournals.com/phoenix/news/2023/08/28/carvana-stock-rises-after-ceo-purchase.html",
      "https://www.forbes.com/sites/nathanvardi/2017/12/18/how-an-ex-con-became-a-billionaire-from-used-cars/",
      "https://www.bizjournals.com/phoenix/news/2024/10/01/forbes-arizona-wealthiest-people.html",
      "https://www.forbes.com/profile/ernest-garcia-ii/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/phoenix/2024/12/11/verde-investments-to-build-retail-urban-village-in-mesa/",
      "https://therealdeal.com/national/phoenix/2024/09/19/consortium-to-redevelop-metrocenter-mall-in-phoenix/",
      "https://therealdeal.com/national/phoenix/2024/07/01/komatsu-eyes-225k-sf-industrial-facility-in-mesa/"
    ],
    "market": "National",
    "published": "Fri, 14 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-14T23:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/calif-urges-insurers-to-expand-coverage-in-fire-risk-areas/",
    "title": "State pushes insurers to expand coverage in fire-prone areas",
    "subhead": "New maps of high-risk zones outline where insurers must write more policies",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-14T18:30:00",
    "content": "State insurance regulators have unveiled a new plan to stabilize the home insurance market by pushing insurers to expand coverage in fire-prone areas where companies have dropped hundreds of thousands of homeowners in recent years.\nThe plan updates a map of high-risk zip codes where insurers will be required to write more policies, aiming to create a more equitable insurance market despite growing wildfire threats, the\nSan Jose Mercury News reported\n.\nHowever, many high-risk Bay Area neighborhoods, including Oakland, the Berkeley Hills and Gilroy, aren’t included in the updated map.\nState regulators say this is because those areas fall within zip codes where the overall insurance need is deemed lower. Despite this, new rules will still require insurers to offer coverage to homeowners in these areas who have been rejected by traditional providers due to fire risk.\n“Insurance companies have ignored those homes, and we’re trying to put the spotlight on them,” Michael Soller, spokesperson for the California Department of Insurance, told the Mercury News.\nThe plan stems from a deal with the insurance industry, allowing companies to raise rates based on climate-related risks in exchange for expanding coverage in high-risk areas.\nCalifornians currently pay an average of $1,435 annually for homeowners insurance, below the national average. But prices vary widely. And insurers like State Farm and Allstate have stopped issuing new policies in the state, citing strict rate-setting rules and wildfire losses.\nThe new rules require insurers to cover a proportional share of high-risk policies. For example, if a company covers 100 of every 1,000 policies statewide, it must cover 85 of every 1,000 in high-risk areas.\n\nHowever, some consumer groups argue the reforms have loopholes that may allow insurers to delay meeting these targets or only slightly increase coverage.\nHomeowners in fire-prone areas, like Carolyn Grote of the Berkeley Hills, are preparing independently. Grote formed a “Firewise community” with neighbors to improve fire safety, hoping to retain her insurance.\n“If Firewise could help people retain their insurance, that might be the biggest motivator,” she told the newspaper.\nConsumer groups are skeptical.\n“Insurers can use secret models to raise rates right away with unenforceable promises to expand coverage,” Carmen Balber of nonprofit Consumer Watchdog told the Mercury News.\nRegulators, however, insist they will monitor compliance closely and can revoke rate-setting privileges if insurers fail to meet coverage requirements.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.mercurynews.com/2025/03/14/wildfire-insurance-homeowners-bay-area/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/25/california-insurance-head-plans-to-fix-home-market-crisis/",
      "https://therealdeal.com/la/2025/02/05/state-farm-seeks-38-rate-hike-on-rental-buildings/",
      "https://therealdeal.com/san-francisco/2024/12/13/farmers-insurance-ups-home-policy-line-in-california/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 22:30:37 +0000",
    "published_dt": "2025-03-14T22:30:37+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/forever-21-closing-these-stores-in-southern-california/",
    "title": "Forever 21 to close more than a dozen stores across SoCal",
    "subhead": "If no buyer is found LA firm could close 350 stores nationwide",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 5:49 PM",
    "pub_date_dt": "2025-03-14T17:49:00",
    "content": "Forever 21 is preparing to potentially close hundreds of stores, including more than a dozen in Southern California, as part of its ongoing bankruptcy.\nThe Los Angeles-based apparel firm, hurt by plunging sales and competition from overseas e-commerce merchants, will make cuts across Los Angeles and Orange counties,\nthe Orange County Register reported.\nThe pending closures come after the 41-year-old company l\nocked the doors of its Downtown L.A. headquarters\nlast month at the California Market Center at 110 East 9th Street, in the Fashion District.\nAfter decades of family ownership, the retail chain was sold in 2020 to investors who now seek a new owner.\nThe company is preparing to close down its remaining 350 stories as part of its bankruptcy filing,\naccording to Bloomberg\n, citing anonymous sources.\nEfforts to find a buyer for the fast-fashion retailer to avoid a liquidation have so far failed, they said. Talks with one potential bidder are ongoing\nForever 21 reported to the state it would be closing eight stores across Southern California — but the closures appear to be more widespread, with hundreds of employees to hit the bricks, according to the Register.\nThe official closures include stores at the The Outlets at Orange, Main Place Mall in Santa Ana, Galleria at Tyler Mall in Riverside, Ontario Mills in Ontario, Victoria Gardens in Rancho Cucamonga, Montclair Place in Montclair, Lakewood Center Mall and at Los Cerritos Mall\nThe company said the layoffs and store closures are permanent, beginning April 25 and continuing through May 9, letters submitted to California’s Employment Development Department.\n\nReaders of the Register also reported stores at Westfield Fashion Square in Sherman Oaks, The Shops at Santa Anita in Arcadia, South Coast Plaza in Costa Mesa, Promenade Temecula and Inland Center in San Bernardino had closing signs on their storefront windows.\nThe company,\nwith 58 stores in California\n, announced in February that it would shutter at least 200 stores nationwide.\nThe retailer was founded in 1984 by husband and wife Do Won and Jin Sook Chang as Fashion 21, in Los Angeles, with its first store on Figueroa Street.\nRenamed Forever 21, the chain grew into a nationwide brand known for its trendy and cheap clothing for teens and 20-somethings. At its peak in 2015, the company reported $4.4 billion in sales and 1,300 stores worldwide.\nBut over the years, the company faced numerous controversies, including accusations of wage theft, the use of cadmium in its jewelry, controversial slogans on T-shirts and the cheap labor used abroad to sew its clothing.\nIn 2020, its assets were sold in bankruptcy for $81 million to a group of investors that included Authentic Brands Group, Simon Properties and Brookfield Properties. That group, known as SPARC, owned retail brands including Lucky, Eddie Bauer, Aeropostale, Brooks Brothers and Nautica.\nIn January, SPARC said\nit was merging with JCPenney\n, creating a new group called Catalyst Brands, which left off Forever 21 from its list of brands. Instead, the company said it was seeking a new operator for the retailer.\nToday, fast fashion in the U.S. has been overrun with competition from Chinese e-commerce companies such as Temu and Shein, which produce and sell items for pennies, according to the Register.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.dailynews.com/2025/03/05/forever-21-closing-at-least-8-more-stores-in-southern-california/",
      "https://therealdeal.com/la/2025/02/25/forever-21-to-close-hq-at-brookfields-cmc/",
      "https://www.mercurynews.com/2025/03/14/forever-21-weighs-closing-all-stores-ahead-of-bankruptcy/",
      "https://locations.forever21.com/us/directory/states/ca",
      "https://www.dailynews.com/2025/01/09/lucky-forever-21-operator-merges-with-jcpenney/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/25/forever-21-to-close-hq-at-brookfields-cmc/",
      "https://therealdeal.com/la/2022/07/25/forever-21-leases-164k-sf-for-new-hq/",
      "https://therealdeal.com/la/2024/02/07/blackstone-and-worthe-list-former-forever-21-hq-for-sale/"
    ],
    "market": "Los Angeles",
    "published": "Fri, 14 Mar 2025 21:49:10 +0000",
    "published_dt": "2025-03-14T21:49:10+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/chris-kennedy-hines-score-610m-loan-for-office-tower/",
    "title": "Kennedy, Hines rake in $610M Salesforce Tower refi",
    "subhead": "Deal comes with appraisal pegging 60-story property at $888M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-14T17:30:00",
    "content": "Hines, Chris Kennedy of a famous American political family and their investment partners in a 60-story skyscraper in Chicago have defied the pandemic-induced downturn for commercial office space.\nThe owners of\nSalesforce Tower\non the bank of the Chicago River are nearing the finalization of a $610 million long-term debt deal, marking a milestone in the aftermath of the pandemic-stricken economy, CoStar News\nreported\n. Should the deal close later this month as expected, the property — developed by Hines and the Kennedy family as well as the AFL-CIO’s real estate investment arm — will stand as a contrarian bet that worked out amid economic uncertainty.\nThe commercial mortgage-backed securities loan reflects the tower’s long-term valuation of $888 million, as appraised by Cushman &amp; Wakefield. Its current valuation of $745 million is expected to rise further following the repayment of tenant-improvement costs and free rent allowances.\nThe refinancing package, with Wells Fargo, JPMorgan Chase and Goldman Sachs serving as the lenders, will replace the property’s $549 million construction debt and is projected to carry an interest rate of 6.525 percent until its maturity in March 2030.\nConceived during the early days of the pandemic, Salesforce Tower has upended market trends by maintaining high occupancy levels, with leases covering over 95 percent of its 1.2 million square feet. Key tenants include Salesforce, which rents more than 477,000 square feet, and Kirkland &amp; Ellis, which is on a 677,000-square-foot lease; those deals run into the 2040s.\n\nMeanwhile, much of the rest of the Chicago office market is depressed, with record-high vacancy rates of more than 25 percent and\nmassive foreclosure lawsuits\nagainst office landlords winding through Cook County court.\nFor the Salesforce Tower developers and Chicago’s broader office market, scoring the loan is a testament to the investment thesis that the world’s largest companies remain interested in ultra-premium workspace and aren’t afraid to invest heavily in it as a method to attract and retain top talent. Kirkland has poured over $207 million beyond its tenant-improvement allowance to create its ideal workspaces, while Salesforce has put up an additional $78 million for its interior buildout, the Moody’s report cited by the outlet shows.\nMoody’s put out a robust outlook on the deal, buoyed by a net operating income projected to reach about $51.2 million by the second year of the loan.\nEastdil Secured arranged the financing package for Salesforce Tower.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2020/04/14/amidst-the-chaos-hines-just-locked-down-one-of-the-fattest-construction-loans-in-chicago-history/",
      "https://www.costar.com/article/1787199735/chicagos-salesforce-tower-nears-610-million-refinancing",
      "https://therealdeal.com/chicago/2024/11/04/beacon-capital-hit-with-372-million-chicago-office-foreclosure/",
      "https://therealdeal.com/chicago/2023/03/24/meta-salesforce-shedding-huge-chunks-of-office-space/",
      "https://therealdeal.com/chicago/2020/04/14/amidst-the-chaos-hines-just-locked-down-one-of-the-fattest-construction-loans-in-chicago-history/",
      "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-14T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/14/ppg-development-bh3-nab-refi-for-slate-hallandale-beach/",
    "title": "PPG, BH3 score $225M refi for Hallandale Beach apartment tower, as lending still flows in South Florida",
    "subhead": "JP Morgan Chase and Monroe Capital provided financing for 26-story, 250-unit project completed in 2022",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 14, 2025, 5:10 PM",
    "pub_date_dt": "2025-03-14T17:10:00",
    "content": "PPG Development and BH3 Management scored a $225 million refinancing for the Slate Hallandale Beach apartment tower.\nThe deal marks continued lending in South Florida, despite higher interest rates, slower apartment leasing and other economic headwinds.\nJP Morgan Chase and Monroe Capital provided the refinancing for the 26-story, 250-unit Slate at 101 Diplomat Parkway, according to a PPG and BH3 news release. The tower is fully leased.\nFaisal Ashraf of Lotus Capital Partners represented the owners in the refinancing.\nHallandale Beach-based PPG and Paramus, New Jersey-based Premium Capital Resources bought the development site in 2018 for\n$43.3 million\n. The property includes the adjacent 127-acre former Diplomat Golf &amp; Tennis Club, which the firms redeveloped into the luxury Shell Bay Club.\nAfter Ari Pearl’s PPG and Michael Herman’s Premium completed Slate in 2022, Fort Lauderdale-based BH3 bought a 50 percent stake in the tower, according to the release. Premium Capital still has a stake in the building, a PPG spokesperson said.\n\nBH3 is led by co-founders Gregory Freedman and Daniel Lebensohn, as well as executive chairman Eric Edidin.\nThe recent refinancing replaces a\n$150 million\nrefinancing PPG and Premium had scored for the tower in 2022, records show.\nDesigned by Kobi Karp, Slate consists of one- to four-bedroom apartments, ranging from 859 square feet to 3,230 square feet, according to the release. It has more than 30,000 square feet of amenities.\nSouth Florida real estate has scored several mammoth\nrefinancings\nin recent months.\nIn December, Whitman Family Development scored\n$740 million\nfor its luxury Bal Harbour Shops, refinancing a $550 million debt secured in 2019 and also providing construction financing for the shopping center’s expansion. That came on the heels of Related Ross securing a\n$200 million\nrefinancing for a portion of its CityPlace mixed-use campus in downtown West Palm Beach.\nAlso in December, Grover Corlew nabbed a\n$114.4 million\nrefinancing for its recently completed 355-unit Mayla Pompano apartment complex at 11 Northeast 24th Avenue in Pompano Beach.\n",
    "related_links": [
      "https://therealdeal.com/miami/2018/05/30/louis-birdman-partners-sell-127-acre-diplomat-property-in-hallandale-for-43m/",
      "https://therealdeal.com/miami/2022/04/11/ari-pearl-completes-luxury-apartment-tower-in-hallandale-beach-scores-150m-refi/",
      "https://therealdeal.com/tag/refinancing/",
      "https://therealdeal.com/miami/2024/12/19/whitman-family-nabs-740m-loan-for-bal-harbour-shops/",
      "https://therealdeal.com/miami/2024/12/11/ares-lends-200m-refi-to-related-ross-for-cityplace-building/",
      "https://therealdeal.com/miami/2024/12/06/grover-corlew-nabs-refi-for-new-pompano-beach-rental-complex/",
      "https://therealdeal.com/miami/2023/09/27/ppg-buys-site-for-new-headquarters-in-hallandale-beach/",
      "https://therealdeal.com/miami/2025/03/12/bh3-proposes-844-units-for-dna-towers-in-flagler-village/",
      "https://therealdeal.com/miami/2025/02/12/asi-cymbal-nabs-refi-for-live-local-act-miami-gardens-units/"
    ],
    "market": "South Florida",
    "published": "Fri, 14 Mar 2025 21:10:52 +0000",
    "published_dt": "2025-03-14T21:10:52+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/14/la-resi-rent-hikes-double-national-average-after-wildfires/",
    "title": "LA apartment rent hikes double national average in wake of wildfires",
    "subhead": "Rents in LA, OC counties rose 0.7% versus 0.3% in US: ApartmentList",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 4:49 PM",
    "pub_date_dt": "2025-03-14T16:49:00",
    "content": "Landlords in Los Angeles and Orange counties have jacked up rents at more than twice the national rate since a firestorm early this year torched more than 12,000 homes.\nRents in January and February rose 0.7 percent across the region — more than double the 0.3 percent increases for apartments nationwide and locally during the same period,\nthe Orange County Register reported\n, citing a report\nfrom ApartmentList.\nRents rose across Los Angeles as thousands of refugees from fire-scorched neighborhoods scrambled to find places to live.\nMonthly rents in Santa Monica, near the Palisades fire, are up 3 percent year to date, with a typical two-bedroom unit renting for $2,867.\nRents in Glendale, near the Eaton fire, are up 2.1 percent, with a typical two-bedroom home renting for $2,462 a month. At the same time, rents in January and February rose 2 percent in Pasadena to $2,731, and 1.9 percent in Burbank to $2,448.\nDespite government actions to cap rent hikes, “the fires could still have a meaningful impact on rent prices in a market where metro-wide rent growth had previously been essentially flat,” ApartmentList’s report stated.\n“Increases are relatively modest so far and do not indicate evidence of widespread rent gouging but they do seem to indicate that the trajectory of the area’s rent prices has been altered by the fires.”\n\nAn analysis by the Washington Post after the fires found that landlords had illegally gouged renters scrambling to find homes, with rents jumping by\n20 percent across Los Angeles County.\nIn nearly 30 cities and Los Angeles neighborhoods, the median rent for homes listed within two weeks after the fires started spiked well\npast the legal limit of 10 percent\n, compared with those listed within two weeks before the blazes\nAn executive order signed by Gov. Gavin Newsom after the fires began made it illegal to jack up the cost of hotels, housing, gas and other goods by more than 10 percent.\n—\nDana Bartholomew\nKEY POINTS:\n",
    "related_links": [
      "https://www.dailynews.com/2025/03/13/los-angeles-rent-hikes-run-twice-national-increases-report-says/",
      "https://www.apartmentlist.com/ca/los-angeles#rent-report",
      "https://therealdeal.com/la/2025/01/28/la-area-landlords-illegally-hike-rents-20-after-fires/",
      "https://therealdeal.com/la/2025/01/27/socal-agent-hit-with-price-gouging-charge-law-limits-rents/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/01/28/la-area-landlords-illegally-hike-rents-20-after-fires/",
      "https://therealdeal.com/la/2025/03/10/la-to-temporarily-ban-evictions-for-substantial-remodeling/",
      "https://therealdeal.com/new-york/2025/03/04/eviction-moratoriums-pose-risks-for-owners-renters/"
    ],
    "market": "Los Angeles",
    "published": "Fri, 14 Mar 2025 20:49:20 +0000",
    "published_dt": "2025-03-14T20:49:20+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/14/miami-beach-mayor-steven-meiner-threatens-to-evict-o-cinema/",
    "title": "Miami Beach mayor’s threat to evict O Cinema will test tenant free speech protections, experts say",
    "subhead": "Steven Meiner wants to terminate theater operator’s lease over screening of Oscar winning doc he labeled “false one-sided propaganda attack on the Jewish people”",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 14, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-14T16:30:00",
    "content": "The First Amendment may not save O Cinema from getting evicted for screening an Oscar winning documentary about the Gaza War and events that led to it.\nOn Wednesday, the\nMiami Beach\nCity Commission will consider Mayor Steven Meiner’s request to terminate O Cinema’s lease for a movie theater space inside a city-owned historic building at 1130 Washington Avenue, as well as end roughly $40,000 in grants to the nonprofit arthouse.\nMeiner moved to kick out O Cinema after it went ahead with sold-out showings of “No Other Land,” a film about the ongoing conflict between Palestinians and Israelis in the West Bank. Directed by Palestinian activist Basel Adra and Israeli journalist Yuval Abraham, “No Other Land” won best documentary feature at this year’s Academy Awards.\nIn a newsletter to his constituents, Meiner called the film “a false one-sided propaganda attack on the Jewish people that is not consistent with the values of our City and residents.”\nMeiner and city officials did not respond to requests for comment. O Cinema co-founder Kareem Tabsch told\nThe Real Deal\nthat the nonprofit art house is ready to pursue “all courses to allow us to continue operating in Miami Beach.”\n“We haven’t ruled out what those measures would be,” Tabsch said. “I think it is very clear that when we decided to continue showing this film, [Meiner] introduced a resolution to pull our funding and cancel the lease.”\nO Cinema is getting legal counsel from the Florida chapter of the American Civil Liberties Union and Community Justice Project, “ Tabsch added.\nWhile some civil libertarians believe Miami Beach officials would be violating O Cinema’s right to free speech by evicting the theater, the lease terms favor the city, according to commercial real estate experts.\n\nA copy of the agreement obtained by\nThe Real Deal\nshows that the city can terminate the lease “without cause and without liability to the landlord” as long as O Cinema is given 180 days prior written notice. O Cinema’s five-year lease expired last year, but in April the city commission approved the tenant’s option to renew for another two years, city records show.\n“To the extent it can be shown that canceling the lease was based [on the content of “No Other Land,”] there would be a First Amendment violation claim,” said Miami-based attorney Mitchell Jagodinski. “The question for the court would be whether the operator of the theater waived this claim via the lease contract.”\nJagodinski is representing the developers of\nMiami Wilds\n, a canceled mixed-use project in unincorporated southwest Miami-Dade County that planned to feature a water park, 200-room hotel and 20,000 square feet of restaurants. Last year, Miami-Dade sued Mami Wilds to terminate a 2022 lease agreement to build the project on 66 acres of county-owned land.\nMiami Wilds\ncountersued by alleging Miami-Dade Mayor Danielle Levine Cava violated the developers’ rights by allegedly killing the deal to appease environmental groups and boost her reelection chances.\nO Cinema likely waived a First Amendment claim by agreeing to the city’s “termination for convenience” clause, Jagodinski said. “It essentially gives the city full control to just cancel [the lease] whenever they want for whatever reason,” he explained. “[O Cinema] agreed to this type of situation eventually happening.”\nMiami Beach\nelected officials are definitely within their purview to end the business relationship with O Cinema, said Jose Smith, a former city attorney for Miami Beach and North Miami Beach who also served on the Miami Beach City Commission from 1997 to 2005.\n“I have not seen the entire documentary or the city’s lease with O Cinema,” Smith said via text. “However, the First Amendment does not require the city to permit its tenant, in a city owned venue, to espouse anti-Semitic, hateful, one-sided propaganda, or to be subsidized by the city for doing so.”\nYet, Norman Powell, a North Bay Village-based real estate lawyer who is also the city attorney for\nMiramar\n, isn’t convinced the city of Miami Beach’s “termination for convenience” clause would trump a potential First Amendment violation claim by O Cinema.\n“It’s clear that the mayor’s primary reason for terminating the lease is because he doesn’t like this documentary being played there,” Powell said. “The basis for termination is really not for convenience. It’s being terminated to stifle free speech.”",
    "related_links": [
      "https://therealdeal.com/tag/miami-beach/",
      "https://therealdeal.com/miami/2022/10/10/miami-dade-faces-suit-over-water-park-hotel-project-near-zoo/",
      "https://therealdeal.com/miami/2024/04/17/miami-wilds-countersues-miami-dade-over-scuttled-water-park/",
      "https://therealdeal.com/miami/2023/11/08/how-real-estate-backed-candidates-fared-in-miami-beach-runs/",
      "https://therealdeal.com/tag/miramar/"
    ],
    "market": "South Florida",
    "published": "Fri, 14 Mar 2025 20:30:00 +0000",
    "published_dt": "2025-03-14T20:30:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/developer-saj-eyes-office-to-resi-conversion-in-lafayette/",
    "title": "Developer eyes office-to-resi conversion in wake of YIMBY lawsuit in Lafayette",
    "subhead": "SAJ wants to replace three office buildings with 90-unit apartment building",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-14T16:00:00",
    "content": "SAJ Development wants to swing a wrecking ball into three office buildings in Lafayette to erect a 90-unit apartment building in an upscale city long opposed to affordable housing.\nThe locally based developer filed revised plans to replace the offices with a seven-story, 171,400-square-foot complex at 1001 Oak Hill Road,\nthe San Francisco Business Times reported\n. The city will consider the project on March 17.\nThe application came as housing advocates\nsued the East Bay city\nfor creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals. The lawsuit by the Housing Action Coalition accused Lafayette of “pretending” to comply with the state housing element, a planning blueprint required of every city and county across the state every eight years.\nLafayette’s alleged shell game includes relying on faith-based institutions and longtime businesses with no plans to develop housing as potential building sites for homes, according to the complaint.\nThe lawsuit seeks a court to compel the city to adopt a revised plan with an update to its zoning laws. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031. Within the decade through 2019, the city permitted 115 homes.\nSAJ could help remedy that by its mixed-use project calling for 79 market-rate apartments and 11 affordable apartments, including five for very-low-income households and six for moderate-income households.\nWhat appears to be a U-shaped complex, designed by Berkeley-based Trachtenberg Architects, would be draped in two shades of brown, with tiered roof decks, and floor-to-ceiling corner windows with exterior balconies, according to a rendering.\nThe developer would employ a nearly 23 percent state density bonus in exchange for the affordable housing, plus a state streamlining law for faster approvals. A cost and timeline for construction were not disclosed.\n\nSAJ applied using Senate Bill 330, which effectively freezes zoning that’s in place at the time a project is submitted, limits the number of public hearings to five and suspends or eliminates restrictions on housing development.\nThe law aims to prevent cities from delaying projects unnecessarily over subjective standards, along with several other laws meant to stop cities from blocking affordable housing.\nThe developer had submitted an earlier version of the project in 2022 that called for tearing down just two of the three offices to build\n53 units\n. City officials approved that version in May, before SAJ revised its plans. Jeff Stone, owner of Diamond Construction, was listed as the property owner operating through SAJ Development, according to SFYimby.\nLafayette was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group, allowing the development to move forward. The project has not broken ground.\nMembership in SAJ Development, led by Stone, includes Diamond Swope Holdings, the Steven Kay Trust, the Griggs Community Property Trust and Outdo, based in Lafayette, according to state business records. Another firm, Valley Oak Capital, is based in Texas.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/13/lafayette-office-residential-oak-hill-saj.html",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://sfyimby.com/2024/04/updated-plans-shared-for-1001-oak-hill-road-in-lafayette.html",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/",
      "https://therealdeal.com/san-francisco/2022/05/13/midwest-investor-pays-103m-for-two-shopping-centers-in-lafayette/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-14T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/farpoint-visualizes-chicago-bears-stadium-in-bronzeville/",
    "title": "Look: Farpoint’s vision for a Bronzeville Bears stadium",
    "subhead": "$3.2B proposal one of three the team is considering",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 3:50 PM",
    "pub_date_dt": "2025-03-14T15:50:00",
    "content": "The developer with ambitious plans for the Bronzeville Lakefront put pictures with its pitch for a Chicago Bears stadium, although the team’s plans are far from certain.\nFarpoint Development released renderings for a $3.2 billion domed stadium on the 49-acre site of the former Michael Reese hospital on the South Side, aiming to present an alternative to the team’s two other options, Crain’s\nreported\n. The team is also considering a redevelopment of the Arlington Heights racetrack and a domed stadium near Soldier Field.\nThe Bronzeville pitch includes an entertainment district, hotels and a 20-acre park bridging over Lake Shore Drive, connecting the stadium to the lakefront, proximity to which has been one of the National Football League team’s main requirements.\nThe developer argues the site offers the best of both worlds: an urban core location and room for ancillary developments — retail, dining and multifamily projects — that could generate additional revenue for the team.\nThe stadium would be privately financed by the Bears, but the developer is pitching $600 million in state infrastructure funds to prepare the site for development, including utilities, roads and environmental work.\nThat departs from\nthe Bears’ other lakefront proposal\n, which sought a $900 million upfront public subsidy. By financing the stadium privately, developers see the plan as more palatable to political leaders wary of direct public subsidies.\n\nStill, hurdles remain. The Bears haven’t publicly engaged with the proposal as of late, but\nrescinded a rejection in the fall\nafter Farpoint updated its plans to take out a conflict with Metra tracks it previously planned to build over.\nInsiders suggest the team is still focused on either advancing its lakefront vision or moving forward in Arlington Heights. The narrow footprint of the Michael Reese site has also raised concerns about feasibility.\nAnother complication is the adjacent Prairie Shores apartment complex, partially owned by Farpoint. The developer says the stadium could fit without impacting the complex, but demolishing units has been floated as a way to maximize the site — an option that would likely draw political pushback.\nThe city still owns the majority of the site and would need to contribute land, as well as cover about $40 million in debt tied to its acquisition. Public financing could also come from tax increment financing and leveraging the site’s federal opportunity zone status.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/sports/michael-reese-developer-farpoint-unveils-bears-stadium-plan",
      "https://therealdeal.com/chicago/2025/02/28/bears-advance-stadium-studies-for-arlington-heights-site/",
      "https://therealdeal.com/chicago/2024/11/12/chicago-bears-considering-south-side-for-stadium-development/",
      "https://therealdeal.com/chicago/2024/11/12/chicago-bears-considering-south-side-for-stadium-development/",
      "https://therealdeal.com/chicago/2025/02/28/bears-advance-stadium-studies-for-arlington-heights-site/",
      "https://therealdeal.com/chicago/2024/12/24/chicago-fire-advances-stadium-idea-at-related-midwests-the-78/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 19:50:49 +0000",
    "published_dt": "2025-03-14T19:50:49+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/14/houstons-largest-landowners-include-high-profile-homebuilders/",
    "title": "Which homebuilders own the most land in Houston?",
    "subhead": "These are the seven-county metro area’s biggest landowners",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-14T15:00:00",
    "content": "Houston’s largest landowners include homebuilders carving out new suburbs and public entities managing flood zones and parks.\nThe top 10 landowners control about 2.6 percent of the metro, the Houston Chronicle\nreported\n.\nThe ranking was compiled based on an analysis of Harris, Montgomery, Liberty, Fort Bend, Brazoria, Galveston and Chambers counties, calculating acreage totals from public property records and mapping data and ranking by parcel totals.\nIt offers a snapshot of the region’s most influential landholders shaping development patterns in and around the Houston metro.\nPrivate developers dominate the landscape, with Camillo Companies leading the pack.\nThe Houston-based homebuilder owns 3,650 acres across six counties, supporting the development of 11,222 residential lots under its brands, including SimplyHome and Legend Homes.\nAnother major player, Arlington-based D.R. Horton, holds 3,490 acres. As Houston’s most active homebuilder in 2023, it led the region with 5,570 home starts and continues expanding in suburban communities.\nMeanwhile, Colony Ridge controls nearly 15,000 acres, primarily in Liberty County. The firm, known for developing infrastructure-ready lots, remains a major driver of suburban sprawl despite facing\nscrutiny over its business practices\n.\n\nPublic entities are also prominent landholders. The City of Houston manages 31,530 acres, including major public assets like George Bush Intercontinental Airport, parklands and municipal facilities. The Harris County Flood Control District controls 26,000 acres for its role in flood mitigation efforts.\nThe role of public entities in flood mitigation is particularly crucial, the Bayou City’s low-lying topography and history of major flooding events making infrastructure and water management far more important to long-term development planning relative to most other Texas metros.\nHarris County itself holds 30,130 acres, spanning government buildings, recreational spaces and major event venues like NRG Park.\nHouston’s sprawl is driven by a mix of public investment and private development, with much of the metro’s expansion occurring along major growth corridors like Interstate 45, U.S. Highway 59 and the Grand Parkway.\nLiberty County, where Colony Ridge dominates, is one of the fastest-growing exurban areas, driven by demand for affordable housing. Its population increased 25.5 percent from mid-2020 to last summer, Census data shows.\nMeanwhile, Fort Bend and Montgomery counties continue to attract large-scale master-planned communities, fueled by population growth and proximity to Houston’s employment centers.\n— Judah Duke\n",
    "related_links": [
      "https://www.houstonchronicle.com/projects/2025/houston-largest-top-landowners-map/",
      "https://therealdeal.com/texas/houston/2023/12/20/federal-government-sues-colony-ridge-developer/",
      "https://therealdeal.com/texas/houston/2025/02/24/johnson-development-prepares-another-700-home-lots-near-houston/",
      "https://therealdeal.com/texas/houston/2025/01/22/starwood-starts-another-master-planned-community-near-houston/",
      "https://therealdeal.com/texas/houston/2025/01/09/houston-has-most-top-selling-master-planned-communities-again/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-14T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/14/dallasnews-corp-sells-plano-printing-plant-for-44-million/",
    "title": "DallasNews sells printing plant for $44M in latest property cut",
    "subhead": "Newspaper’s parent company sold Plano asset to fund its pension obligations",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 2:08 PM",
    "pub_date_dt": "2025-03-14T14:08:00",
    "content": "A newspaper printing and distribution plant in Plano has sold for $43.5 million.\nDallasNews Corporation, parent company of the Dallas Morning News, sold the property to Florida-based Denago EV, a low-speed vehicle company that specializes in electric golf carts, the outlet\nreported\n. The sale pencils out to about $70 per square foot.\nDenago plans to use the 29-acre, 620,000-square-foot facility at 3900 West Plano Parkway as a manufacturing hub, joining a growing list of companies establishing production lines in North Texas. DallasNews, formerly known as A.H. Belo Corporation, has owned the property since 1999, county records show.\nIt downsized its printing plant with a five-year lease valued at $3.5 million for a 67,600-square-foot facility in Carrollton last June, according to its\nlatest quarterly report\n. The property’s address was not disclosed.\nProceeds from the sale will be used to fully fund the company’s remaining pension obligations, with plans to transfer the pension to an insurance company. The pension’s balance stood at about $16 million late last year, and the transfer would remove the liability from the company’s balance sheet, it said.\n\nDallasNews’ pension expenses have been rising, with $1.42 million spent on net periodic pension and post-employments benefits in the first nine months of last year, more than double the $674,000 spent during the same period in 2023, the report said.\nThe company said last year it was moving to shed assets and return to profitability by moving to the\nsmaller printing plant with fewer workers\nto save an estimated $5 million a year.\nThe company has been selling off real estate assets since 2019, when it offloaded its historic downtown Dallas office building at 508 Young Street to developer Ray Washburne\nIn February, Washburne said he was selling to “one of the major data companies” to bring a data center to the 546,000-square-foot property,\nthrowing a wrench\nin the city’s intentions to integrate it into its larger convention center redevelopment plan. The deal is slated to close in April, Washburne said.\n— Judah Duke\n",
    "related_links": [
      "https://www.dallasnews.com/business/2025/03/13/dallasnews-corp-completes-43m-plano-printing-plant-sale/",
      "https://investor.dallasnewscorporation.com/static-files/b9251d00-2a3e-4a05-9899-0207ac45f9a1",
      "https://www.dallasnews.com/business/local-companies/2024/05/14/dallas-morning-news-moving-to-smaller-printing-plant-with-fewer-workers-a-new-press/",
      "https://therealdeal.com/texas/dallas/2025/02/25/dallas-city-council-rouses-to-washburnes-data-center-deal/",
      "https://therealdeal.com/texas/dallas/2025/02/25/dallas-city-council-rouses-to-washburnes-data-center-deal/",
      "https://therealdeal.com/texas/2025/02/03/ray-washburne-to-sell-dallas-newspaper-building-for-data-center/",
      "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 18:08:32 +0000",
    "published_dt": "2025-03-14T18:08:32+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/zappettini-family-defaults-on-mountain-view-tech-campus/",
    "title": "Zappettini family defaults on Mountain View tech campus",
    "subhead": "Family office defaulted on $120M in CMBS loans, after eyeing redevelopment",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-14T14:00:00",
    "content": "The Zappettini family office has defaulted on $120 million in commercial mortgage-backed security loans tied to a 100,000-square-foot tech campus in Mountain View.\nThe San Francisco-based office led by John Zappettini received a notice of default from an undisclosed lender of loans tied to the Terra Bella Tech Park at 850-900 Shoreline Boulevard,  1212-1305 Terra Bella Avenue and 1330-1350 West Middlefield Road,\nthe Silicon Valley Business Journal reported\n.\nThe family bought and developed the 10-acre office and industrial park with 17 buildings in the 1970s, then turned it into a tech campus. In 1921, it tried to redevelop it into a mixed-use village, with homes and commercial properties, according to its website.\nA default notice filed this week gives the Zappettinis 90 days to pay off the default amount. If they fail, the lender will record a notice of sale, Steven Hoffman, a real estate attorney based in Sunnyvale who is not connected to the situation, told the Business Journal.\nThe Business Journal reported in February that the\nMountain View tech campus had been heading toward foreclosure\nor a loan modification after the owner defaulted on a $120 million mortgage debt.\nLoan servicer reports obtained in January showed Zappettini Investment Company failed to repay the mortgage debt by its June 2024 maturity date. The initial loan default was\nfirst reported by The Real Deal\nthat month.\nCiti Real Estate Funding issued the two loans — one for $65 million and a second for $55 million — and then pooled them into commercial mortgage-backed securities deals.\n\nAs of last summer, leases for 40 percent of the tech park’s office, light-industrial and research and development buildings were set to expire within six months, a key factor in the default.\nThe Zappettini family was originally in the wholesale flower importing business and formerly used some of the Mountain View properties for its wholesale operations, according to its website.\nThe Zappettinis sold multiple parcels in Mountain View to Google in 2011, which the tech giant sold a few years later to the Irvine Company, according to public records. They sold another property to Google in 2016 for its now-abandoned\nGoogle Landings\nproject.\nThe family also owned almost 2 acres in the San Francisco Flower Mart from the 1950s until they sold it to Kilroy Realty in 2016 for $31 million in cash and $56 million in stock.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanjose/news/2025/03/13/default-mountain-view-tech-campus-zappettini.html",
      "https://www.bizjournals.com/sanjose/news/2025/02/05/zappettini-cre-portfolio-loan-default-foreclosure.html",
      "https://therealdeal.com/san-francisco/2024/07/16/sf-based-zappettini-family-defaults-on-loan-tied-to-silicon-valley-commercial/",
      "https://therealdeal.com/sanfrancisco/2023/09/10/google-finally-gets-its-land-as-family-leases-farm-for-companys-expansion/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/07/16/sf-based-zappettini-family-defaults-on-loan-tied-to-silicon-valley-commercial/",
      "https://therealdeal.com/san-francisco/2024/11/26/essex-property-pays-26-million-for-mountain-view-buildings/",
      "https://therealdeal.com/san-francisco/2024/12/10/amazon-com-leases-217k-sf-office-building-in-mountain-view/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-14T18:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/philadelphia/2025/03/14/philadelphia-budget-proposal-full-of-real-estate-nuggets/",
    "title": "Philadelphia budget proposal full of real estate nuggets",
    "subhead": "Mayor Parker pitches $800M loan for housing, construction tax reduction",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-14T13:30:00",
    "content": "Philadelphia’s real estate industry will be paying close attention to the city’s budget process over the next few months.\nMayor Cherelle Parker revealed her 2025-26 budget proposal on Thursday, Bisnow\nreported\n, spending a few minutes of remarks to talk about real estate. A number of components of her budget proposal directly impact the industry.\nParker proposed the city borrow $800 million over a five-year period to\nbuild and preserve\n30,000 housing units across Philadelphia. The costs could be funded by several tax increases, including upping the real estate transfer tax from 3.28 percent to 3.58 percent, and increasing a document recording fee by $3.\nParker also called for the elimination of a 1 percent construction impact tax in hopes of getting more shovels in the ground. It’s unclear how much of the tax was actually an inhibitor to development, because it only generates $3.5 million for the city per year.\nThe proposal calls for $11 million in additional funding for the Philadelphia Department of Planning and Development to assist the hiring of 32 employees. Parker also pitched a reduction of the city’s wage tax and business income and receipts tax.\n\nNotably omitted from the budget proposal was the\nextension of a 10-year tax abatement\nfor conversion projects, pitched by the Tax Reform Commission last month. Finance Director Rob Dubow said the city prefers to simplify its tax structure by eliminating certain taxes, rather than altering abatements.\nThe city’s next big housing moment is only days away, when Parker reveals her Housing Opportunities Made Easy Initiative at a special session, a hearing she’s herself described as a “D-Day for housing.” That hearing is scheduled for March 24.\nThe coming fiscal year, meanwhile, begins on July 1, so the City Council needs to negotiate and adopt a budget before then.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bisnow.com/philadelphia/news/commercial-real-estate/philadelphia-budget-proposal-home-initiative-construction-tax-cherelle-parker-128474",
      "https://therealdeal.com/national/philadelphia/2025/02/24/philadelphia-mayor-signs-order-to-create-preserve-30k-units/",
      "https://therealdeal.com/national/philadelphia/2025/02/28/philadelphia-considers-more-tax-breaks-for-conversions/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/philadelphia/2025/02/28/philadelphia-considers-more-tax-breaks-for-conversions/",
      "https://therealdeal.com/national/philadelphia/2025/02/24/philadelphia-mayor-signs-order-to-create-preserve-30k-units/",
      "https://therealdeal.com/national/philadelphia/2025/01/22/philadelphia-expands-tenant-protections-to-more-renters/"
    ],
    "market": "National",
    "published": "Fri, 14 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-14T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/elon-musk-orders-hud-to-cut-fair-housing-act-awards/",
    "title": "Sudden HUD cuts leave Chicago housing nonprofits in limbo",
    "subhead": "President Donald Trump, billionaire Elon Musk’s Department of Government Efficiency directed termination of contracts",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 1:03 PM",
    "pub_date_dt": "2025-03-14T13:03:00",
    "content": "Fair Housing Act funding for Chicago-area organizations is frozen.\nThe U.S. Department of Housing and Urban Development abruptly terminated or delayed grants to at least five local groups as well as 78 grantees across the country, leaving some without contracts or reimbursement since the start of the year, the Chicago Tribune\nreported\n.\nAmong those impacted is the Chicago Lawyers’ Committee for Civil Rights, which had 16 months left in a three-year grant totaling $425,000 annually.\nThe termination was directed by President Donald Trump and billionaire Elon Musk’s Department of Government Efficiency, according to HUD’s termination letter to the group, which said the grant “no longer effectuates the program goals or agency priorities.”\nAt least one group is challenging the cancellations in court, saying the termination of funds awarded through HUD’s Fair Housing Initiatives Program is illegal.\nFour members of the National Fair Housing Alliance are suing HUD and DOGE over the allegedly unlawful cancellation of more than $30 million in grants through the program. The lawsuit, which is seeking class-action status, was filed Thursday in federal court in Massachusetts.\nThe South Suburban Housing Center and Open Communities in Evanston received the same letter and faces similar funding losses posed to disrupt decades of work supporting low-income and minority communities.\nThe nonprofit lost its two grants, which totaled about $1.4 million over the next three years, funds it has received since 1995. The amount represented 92 percent of its fair housing budget and 37 percent of its total organizational budget.\n\nChicago’s Continuum of Care network — responsible for coordinating housing services for the homeless — has over $112 million in HUD grants still pending contracts. At least 14 organizations have been operating without reimbursement since January.\nThe cuts come amid broader federal workforce reductions at HUD, including layoffs at the agency’s Chicago office.\nHUD Secretary Scott Turner, who was confirmed by the U.S. Senate on Feb. 5, has defended the changes, saying the agency is “taking inventory” to improve efficiency. HUD officials have promised some clarity in the coming weeks, with letters to awardees expected soon.\nThe cuts are targeting racial justice initiatives and could erode protections for vulnerable groups, particularly as\nhousing discrimination\ncomplaints rise and\naffordable housing options shrink\n, the National Fair Housing Alliance said.\nFor other organizations, like Ignite, which provides services for homeless youth as the parent organization for Continuum of Care, the clock is ticking.\nIgnite has dipped into reserves to continue operations while awaiting its yearly $320,000 contract reimbursement. Others are turning to donors or state-level funding to close the gaps.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagotribune.com/2025/03/13/chicago-housing-organizations-hud-grants-limbo/",
      "https://therealdeal.com/chicago/2025/03/13/lease-rates-plummet-for-chicago-housing-voucher-holders/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/national/2025/03/12/doge-cancels-affordable-housing-deals-in-anti-dei-push/",
      "https://therealdeal.com/chicago/2025/03/13/lease-rates-plummet-for-chicago-housing-voucher-holders/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 17:03:51 +0000",
    "published_dt": "2025-03-14T17:03:51+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/advent-properties-withdraws-suburban-chicago-multifamily-plans/",
    "title": "Developer pulls plug on Des Plaines multifamily despite hot market",
    "subhead": "Advent Properties withdrew its plans but could submit another proposal",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 12:45 PM",
    "pub_date_dt": "2025-03-14T12:45:00",
    "content": "Advent Properties’ development plans in downtown Des Plaines are off the table for now.\nThe Chicago-based firm withdrew its plans for a seven-story apartment building with retail, a setback for one of the city’s key redevelopment sites, the Daily Herald\nreported\n.\nThe\nproposal\ncalled for 278 apartments and 8,500 square feet of ground-floor retail at 760 Lee Street, replacing undeveloped land and a parking lot. The plan also included indoor and outdoor parking and a public park.\nDes Plaines city officials had postponed a scheduled February review to give Advent time to revise the project following feedback from the council in December. But Advent withdrew its application earlier this month without explanation, according to city planning memos.\nAdvent, an entity tied to Paul Dukach, is reportedly still evaluating future development options for the nearly 3-acre site.\n\nThe withdrawal halts momentum for a proposal that could have contributed to Des Plaines’ broader downtown revitalization efforts. The suburb has been actively courting multifamily and mixed-use developments to reshape its urban core. Nearby projects include\nCompasspoint Development’s 131-unit apartment complex\nand the 212-unit Welkin project that opened in 2022.\nThe downtown Des Plaines apartment market has been\na draw for developers\nin recent years, with suburban multifamily investment outperforming Chicago’s core in terms of rental growth.\nSuburban rents rose 4 percent year over year in the fourth quarter, compared to 2.3 percent for central Chicago, according to Integra Realty Resources.\nAdvent’s withdrawal leaves a gap in the city’s downtown growth plans, though local officials indicated that development conversations could continue in the future.\n— Judah Duke\n",
    "related_links": [
      "https://www.dailyherald.com/20250313/news/real-estate-company-withdraws-plan-for-apartment-building-in-downtown-des-plaines/",
      "https://therealdeal.com/chicago/2024/12/16/mixed-use-plans-seek-approval-in-chicago-suburb-des-plaines/",
      "https://therealdeal.com/chicago/2023/04/18/compasspoint-green-lit-for-des-plaines-apartments/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2024/11/11/why-suburban-chicago-multifamily-sales-outperform-city/",
      "https://therealdeal.com/chicago/2023/04/18/compasspoint-green-lit-for-des-plaines-apartments/",
      "https://therealdeal.com/chicago/2024/12/16/mixed-use-plans-seek-approval-in-chicago-suburb-des-plaines/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 16:45:20 +0000",
    "published_dt": "2025-03-14T16:45:20+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/fort-worth/2025/03/14/phoenix-property-co-plans-highrise-hotel-amid-fort-worth-boom/",
    "title": "Highrise hotel to oust popular antique mall amid development boom",
    "subhead": "Phoenix Property Company plans mixed-use district on Montgomery Street",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 12:30 PM",
    "pub_date_dt": "2025-03-14T12:30:00",
    "content": "Fort Worth will trade vintage charm for modern development, rezoning the Montgomery Street Antique Mall site to clear the way for a 12-story hotel and mixed-use project.\nFort Worth City Council greenlighted development of the 7.4-acre site at 2501 and 2601 Montgomery Street, Bisnow\nreported\n.\nDallas developer Phoenix Property Company and landowner Montgomery Corner LLC, an entity tied to American Land and Cattle and Luther King Capital Management, plan to replace the long-standing antique mall with a hotel, ground-floor retail and a separate multifamily building.\nThe plans also leave room for a brewery or distillery, though Phoenix told the city’s zoning commission last month that such uses aren’t currently in the works. The development is near Fort Worth’s Cultural District, just off Interstate 30.\nThe antique mall has been a fixture in the district for more than 30 years, drawing loyal patrons and housing the Secret Garden restaurant. News of the redevelopment sparked social media backlash, with some residents calling it a “terrible decision” that could displace locals and worsen traffic. No one spoke in opposition at the council’s zoning hearing, despite online pushback.\nCouncil member Macy Hill noted that developers met with local stakeholders prior to the meeting and expressed optimism about the project’s potential to modernize the area.\n\nMontgomery Street Antique Mall’s owners have yet to announce whether the business will relocate or close.\nPhoenix is also working with the Texas Department of Transportation to address concerns about traffic flow and access at the nearby intersection of Montgomery Street and I-30.\nThe project is part of the redevelopment trend across Fort Worth. The council rezoned more than 83 acres along Montgomery Street for intensive commercial use, and downtown plans are progressing, including more than $2 billion in future projects and reimagining\nPanther Island as a waterfront district\n.\n— Judah Duke\nREAD MORE LINKS:\n",
    "related_links": [
      "https://www.bisnow.com/dallas-ft-worth/news/mixed-use/mixed-use-development-with-a-12-story-hotel-to-replace-montgomery-street-antique-mall-in-fort-worth-128473",
      "https://therealdeal.com/texas/fort-worth/2024/07/29/how-fort-worth-is-enabling-dense-development-at-panther-island/",
      "https://therealdeal.com/texas/fort-worth/2025/02/26/georgetown-companies-buys-fort-worth-whole-foods-retail-center/",
      "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
      "https://therealdeal.com/texas/fort-worth/2024/07/29/how-fort-worth-is-enabling-dense-development-at-panther-island/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 16:30:00 +0000",
    "published_dt": "2025-03-14T16:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/14/sf-suspends-empty-homes-tax-in-bid-to-save-it/",
    "title": "SF suspends empty-homes tax in bid to save it",
    "subhead": "Supervisor wants to amend tax to keep it alive, subject to constitutional challenge",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-14T12:00:00",
    "content": "San Francisco officials have delayed suspending a voter-approved “Empty Homes Tax” during a legal challenge because of a push by Supervisor Jackie Fielder to keep the measure alive.\nThe tax, known as Proposition M, was approved in November 2022 with 54 percent of the vote and targets property owners with residential units left vacant for over 182 days a year,\nthe San Francisco Chronicle reported.\nTaxes range from $2,500 to $5,000 based on size, rising to a maximum of $20,000 a year per unit, applying only to buildings with three or more apartments.\nFielder argued that amendments should be explored to prevent the tax from being suspended indefinitely while the city fights a lawsuit from landlords and property owners who say it violates their property rights.\nShe proposed that the tax suspension should only last “until the courts tell us otherwise,” allowing the city to collect if legally permitted. Fielder’s motion to continue the vote passed unanimously, with a hearing set for March 18.\nThe Empty Homes Tax took effect at the beginning of last year, with collections planned for upcoming April.\n\nProponents estimated it would generate more than $20 million a year for housing and unlock about 5,000 units within two years, though critics have questioned the projections.\nThe tax has faced legal challenges since February 2023, when property owner groups filed a lawsuit alleging it was coercive and infringed on their rights.\nIn December 2023, Superior Court Judge Charles Haines\ndeclined to dismiss the lawsuit\narguing in a ruling that property owners don’t need to wait until the tax is due to challenge it in court. In October, Haines\nstruck down the tax\n, saying that it violated the U.S. and California constitutions and was preempted by California law.\nThe court subsequently ordered the city to halt enforcement and collection, and the city treasurer stated that property owners would not be required to pay by the original April 30, 2025 deadline unless the court’s decision is reversed on appeal.\nThe city attorney’s office is now appealing the ruling and has expressed disappointment with the trial court’s decision.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/sf/article/sf-empty-homes-tax-suspension-in-limbo-20215573.php",
      "https://www.sfchronicle.com/politics/article/sf-empty-tax-18577248.php",
      "https://www.sfchronicle.com/politics/article/judge-strikes-san-francisco-s-vacant-home-tax-19881408.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/01/04/judge-oks-challenge-to-san-franciscos-empty-homes-tax/",
      "https://therealdeal.com/san-francisco/2022/07/05/vacant-home-tax-poised-for-november-ballot-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2022/11/15/apartment-vacancy-tax-passes-in-san-francisco-and-berkeley/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-14T16:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/14/blackstone-looks-to-sell-off-more-signature-bank-debt/",
    "title": "Blackstone looks to sell off more Signature Bank debt",
    "subhead": "Joint venture offers $395M worth of 121 commercial property loans",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 14, 2025, 11:10 AM",
    "pub_date_dt": "2025-03-14T11:10:00",
    "content": "A Blackstone-led venture is ready to sell more of the commercial property debt once held by Signature Bank, at least the third time it may sell loans from its stake.\nThe joint venture of Blackstone, Rialto Capital and the Canada Pension Plan Investment Board is marketing $395 million worth of commercial property loans in the tri-state area, Bloomberg\nreported\n. Most of the assets tied to the debt are in New York City.\nThe portfolio includes 121 loans backed by office, multifamily, retail and industrial properties. A Newmark team led by Doug Harmon and Adam Spies are marketing the debt and bids are due later this month.\nBlackstone, Rialto and Newmark did not immediately respond to requests for comment.\nThe joint venture has sliced off portions of the debt for sale before. Last year, Morgan Stanley purchased $700 million worth of loans from the trio. Also last year, distressed debt player Maverick Real Estate Partners\nacquired $247 million in debt\n, backed by eight properties including buildings in Midtown Manhattan, Brooklyn and Queens.\n\nIn December 2023, Blackstone Real Estate Debt Strategies, BREIT, Rialto Capital and Canada Pension Plan Investment Board\nscored a 20 percent stake\nin a venture holding Signature’s $17 billion commercial real estate loan book with a winning bid of $1.2 billion. The FDIC retained an 80 percent interest and provided financing equal to 50 percent of the venture’s value.\nA month later, the venture started\nshopping around\n$1.8 billion in performing loans, mostly backed by apartment buildings.\nThe collapse of Signature Bank and proliferation of its debt across firms continues to reverberate throughout New York City’s commercial real estate industry. This month, a group of lenders — Community Preservation Group, Related Fund Management and Neighborhood Restore —\nfiled six pre-foreclosure actions\nagainst borrower Madison Realty Capital at Manhattan properties once tied to the failed Signature Bank.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bloomberg.com/news/articles/2025-03-12/blackstone-venture-said-to-eye-sale-of-new-york-property-debt",
      "https://therealdeal.com/new-york/2024/02/23/maverick-buys-247m-in-signature-loans-from-blackstone-venture/",
      "https://therealdeal.com/new-york/2023/12/14/blackstone-wins-stake-in-signature-cre-loans-for-1-2-billion/",
      "https://therealdeal.com/national/2024/01/15/blackstone-looks-to-sell-1-8b-of-signature-loans/",
      "https://therealdeal.com/new-york/2025/03/04/trio-of-lenders-file-cases-against-madison-realty-capital/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2024/01/15/blackstone-looks-to-sell-1-8b-of-signature-loans/",
      "https://therealdeal.com/new-york/2023/12/14/blackstone-wins-stake-in-signature-cre-loans-for-1-2-billion/",
      "https://therealdeal.com/new-york/2024/02/23/maverick-buys-247m-in-signature-loans-from-blackstone-venture/"
    ],
    "market": "National",
    "published": "Fri, 14 Mar 2025 15:10:41 +0000",
    "published_dt": "2025-03-14T15:10:41+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/",
    "title": "Retail merchandiser flits to newer Plano office space",
    "subhead": "Moving from Granite Park III to 2021 build owned by Monarch Alternative Capital, Tourmaline Capital Partners",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 14, 2025, 11:00 AM",
    "pub_date_dt": "2025-03-14T11:00:00",
    "content": "The flight to quality office trend is responsible for yet another corporate relocation.\nAnderson Merchandisers is moving its headquarters from one Plano office to another; it’s leaving Granite Properties’ Granite Park III, which was built in 2007, for Apex at Legacy, a property delivered in 2021.\nThe retail merchandising company inked a deal to occupy 30,000 square feet — the full top floor — at the 210,000-square-foot office building, according to a news release from JLL. Anderson is bringing more than 100 employees to the space by the fourth quarter of this year, with plans to hire more.\nJLL’s Conor McCarthy and Jayme Schutt represented the tenant in lease negotiations. John Brownlee, Gini Rounsaville and Michael Williams represented the landlord, Monarch Alternative Capital and Tourmaline Capital Partners.\nApex at Legacy, at 5801 Headquarters Drive, is a 14-story office building that was\ndeveloped\nby Dallas-based Heady Investments. Monarch Alternative Capital and Tourmaline Capital Partners purchased the property in 2021.\n\nIt includes features like a game lounge that includes a golf simulator. It’s within walking distance from Legacy West, a mixed-use development in Plano with more than 400,000 square feet of retail and office space.\nThere are plans for expansion — the development will soon feature a second building with office space and a Kimpton Hotel, the release said.\nCorporate America’s push to return to the office has emphasized the flight-to-quality trend in the office market.\nCompanies like Anderson Merchandisers are luring employees into the office with top-of-the-line amenities. Meanwhile, operators of older inventory are under pressure to compete with new deliveries.\nThat’s just one segment of the Dallas-Fort Worth office market, which had 52.8 million square feet of unused office space in November. The Metroplex ranked third in the country for office vacancy, behind New York and Chicago.\n",
    "related_links": [
      "https://www.dallasnews.com/business/real-estate/2021/06/07/new-york-investor-takes-new-plano-office-tower/",
      "https://therealdeal.com/texas/dallas/2024/11/19/dallas-office-vacancy-third-highest-in-nation/",
      "https://therealdeal.com/texas/dallas/2025/02/26/granite-properties-secures-two-floor-lease-in-west-plano/",
      "https://therealdeal.com/texas/dallas/2024/11/11/ryan-koch-moving-to-trophy-building-in-planos-legacy-west/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 15:00:00 +0000",
    "published_dt": "2025-03-14T15:00:00+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/msasa-properties-to-build-118-apartments-in-san-jose/",
    "title": "Msasa Properties to build 118 apartments in San Jose",
    "subhead": "Development near Japantown the first large market-rate project in the city since 2023",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 8:00 PM",
    "pub_date_dt": "2025-03-13T20:00:00",
    "content": "A developer wants to bulldoze an office building to build 118 apartments in the first large multifamily development in San Jose in two years.\nAn affiliate of locally based Msasa Properties led by Mostafa Aghamiri was approved by the San Jose City Council to demolish a two-story, 12,000-square-foot office building at 380 North First Street, in Hensley, the\nSilicon Valley Business Journal reported\n.\nThe affiliate, 380 N 1st Street QOZB LLC, has filed plans to build a 119,000-square-foot apartment complex in its place. Aghamiri’s Msasa Properties\nfiled plans in September 2023\nto build the seven-story complex near San Jose’s Japantown.\nWith developers having built no market-rate projects larger than 20 units in the city last year, Aghamiri’s project appears to be the first large-scale multifamily development since 2023, in which 336 units were built.\nPlans call for 118 apartments on a half-acre north of Basset Street between North First and North Second streets, with six set aside as affordable for very low-income households. Parking would be available for 74 cars.\nInitial plans by Aghamiri included 18 affordable units, or 15 percent, but he cut it to 5 percent to make the project pencil out, according to Erik Schoennauer, a local land use consultant who spoke on behalf of the developer.\n\nThe project, designed by Oakland-based Studio T-Square, features a charcoal and white complex with balconies, according to a rendering, bookended by a brown brick sections.\nThe site is located in an opportunity zone, which offers tax advantages to developers.\nAghamiri bought the office property in 2022 for $5.3 million, or $442 per square foot.\nThe 61-year-old offices have been vacant for 10 months, and have been damaged by vandals, Schoennauer said. They’ve been 60 percent vacant for more than five years\nHe said Aghamiri hopes to break ground this summer, and complete the project in 20 to 24 months.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanjose/news/2025/03/12/vacant-san-jose-office-demolition-redevelopment.html",
      "https://therealdeal.com/san-francisco/2023/09/06/msasa-properties-updates-plan-for-apartments-in-san-jose/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2023/09/06/msasa-properties-updates-plan-for-apartments-in-san-jose/",
      "https://therealdeal.com/san-francisco/2025/02/18/hanover-secures-120m-loan-for-1140-apartments-in-san-jose/",
      "https://therealdeal.com/san-francisco/2025/02/27/robson-homes-wants-to-turn-eggs-into-homes-in-san-jose/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 00:00:00 +0000",
    "published_dt": "2025-03-14T00:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/13/lack-of-land-leads-oc-home-builders-to-23-dip/",
    "title": "Lack of land leads OC home builders to 23% dip",
    "subhead": "Top developers reported 31% drop in single-family homes, 15% drop in attached homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-13T19:30:00",
    "content": "Top developers in Orange County are selling fewer homes, with deals plunging in the double digits because of fewer places to build.\nThe top 13 builders in the county last year sold a combined 2,253 attached and detached homes, down 23 percent from 2,912 sold in 2023,\nthe Orange County Business Journal reported\n, citing figures from Zonda and local developers.\nSingle-family home sales fell 31 percent to 908, while attached townhome and condominium sales declined 15 percent.\nNine of the 13 biggest builders reported fewer homes sold compared to last year, with Tri Pointe Homes, Landsea Homes, Taylor Morrison, Trumark Homes and KB Home showing the biggest drops.\nThere just isn’t enough available land in OC to build new houses, according to Allison Rawlins Tift, a senior vice president at Land Advisors Organization, a consultant group with an office in Irvine.\n“The home builders all echo the same sentiments about wanting or needing any mapped/entitled/finished lots available in the county, but there is a similar lack of supply of future lots available for home builders to acquire and then build upon,” Rawlins told the Business Journal.\nOf the nine companies that reported year-over-year OC sales declines, Irvine-based Tri Pointe Homes reported the largest drop, selling 95 houses last year, 67 percent fewer than in 2023.\nScottsdale-based Taylor Morrison sold 25 detached homes last year, a 59 percent drop from 2023. It didn’t sell any attached homes, compared to eight in 2023.\n\nSan Ramon-based Trumark Homes sold 52 percent fewer homes, according to the Business Journal, while Los Angeles-based KB Home reported a 44 drop in home sales in OC last year to 53 homes.\nMiami-based Lennar had the highest volume of sales in OC last year, closing on 936 attached and detached houses, but sales were 15 percent fewer than the 1,099 homes sold the prior year.\nMeanwhile, Pennsylvania-based Toll Brothers sold 94 attached houses in OC last year,  compared to 82 in 2023, a 37 percent drop. Its detached home sales plunged 49 percent to 172, from 339 in 2023.\nWhile most developers lost sales, three companies managed to grow their businesses, while Mission Viejo-based PulteGroup reported flat sales, according to the Business Journal.\nIrvine-based California Pacific Homes reported the biggest jump, with a 200 percent surge to 135 homes sold in Orange County last year, including 111 single family houses, which leaped 484 percent.\nThe Seal Beach-based Olson reported 104 percent year-over-year growth, with all 92 attached homes sold.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/oc-homepage/homebuilders-hit-the-brakes-on-new-oc-homes/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/01/22/typical-house-payment-reaches-7700-in-orange-county/",
      "https://therealdeal.com/la/2025/01/10/orange-county-home-prices-jump-7-7-most-in-the-nation/",
      "https://therealdeal.com/la/2024/08/08/orange-county-joins-the-trillion-dollar-housing-club/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-13T23:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/13/lender-nabs-83k-sf-k-town-retail-center-in-half-off-sale/",
    "title": "Lender nabs 83K sf K-town retail center in half-off sale",
    "subhead": "Columbia Pacific buys California Market at auction after landlord Jake Sharp Capital defaults on $52.5M mortgage loan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-13T18:30:00",
    "content": "A lender has purchased an 83,000-square-foot Koreatown shopping center at a bankruptcy auction after landlord Jake Sharp Capital defaulted on a $52.5 million mortgage loan.\nThe lender, an affiliate of Seattle-based Columbia Pacific Advisors, paid $29.2 million for the three-story California Market at 450 South Western Avenue,\nCommercial Observer reported\n.\nThe purchase works out to $352 per square foot.\nThe shopping center, built in 1987 to contain the California Market, became the first Korean supermarket in the state. It’s best known as a symbol of the 1992 Los Angeles riots, when the market owner and his tenants threw up barricades against looters, while\ndefending it with guns\n.\nJake Sharp, based in Hollywood, bought the plaza in 2020 at a bankruptcy auction for\n$57.5 million, or $693 per square foot.\nThe seller was Hyun Rhee, widow of the late supermarket chain founder Richard Rhee.\n\nBesides California Market, its two dozen tenants include restaurants Gaju Gimbop, Two Hands Seoul Fresh Corn Dogs and Thanks Pizza, as well as Etude W Salon and Guardian Computer Repairs.\nTo buy the shopping center at South Western and 5th Street, Jake Sharp Capital borrowed $52.5 million from Columbia. The firm defaulted on the loan in January, according to CO.\nJake Sharp Capital, founded in 2020, is run by Lafayette Sharp, who lives in Dana Point, according to state business records. It appears to be affiliated with the Jake Sharp Group, founded in 2011 by Jake Sharp, a commercial mortgage firm also based in Dana Point.\nIt’s not clear if Columbia plans to sell or hold on to the building. Representatives for Columbia didn’t immediately respond to CO’s request for comment, while Jake Sharp Capital could not be reached.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://commercialobserver.com/2025/03/la-koreatown-california-market-auction-columbia-pacific/",
      "https://www.kang.org/4-29-riots",
      "https://therealdeal.com/la/2020/12/16/california-market-in-koreatown-sells-for-58m-at-bankruptcy-auction/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2020/12/16/california-market-in-koreatown-sells-for-58m-at-bankruptcy-auction/",
      "https://therealdeal.com/la/2025/03/12/jamison-scores-50m-refi-for-koreatown-apartment-complex/",
      "https://therealdeal.com/la/2024/11/20/hankey-overcomes-appeal-against-koreatown-apartment-highrise/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-13T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/fivepoint-hunters-point-settlement-offer-is-paltry-judge/",
    "title": "Judge kicks FivePoint settlement offer for Hunters Point as “paltry”",
    "subhead": "Deal would allow developers to skirt $1B lawsuit by “paying nickels”",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-13T17:00:00",
    "content": "A proposed legal settlement over the botched environmental cleanup of Hunters Point Shipyard would leave thousands of affected residents with just $606 per person.\nA federal judge denied the agreement between developers FivePoint Holdings and Lennar and lawyers behind the $1 billion lawsuit — calling it a “sweetheart deal” for the builders and the “worst settlement” he’s ever seen, the\nSan Francisco Chronicle reported.\nIn a scathing order, U.S. District Judge James Donato called the proposed payout to 6,500 residents of Hunters Point “paltry,” and accused the plaintiff’s lawyers of selling out their clients.\n“No question that the proposed terms are unfair to the class members,” he said during a January hearing.\nResidents of Hunters Point filed a lawsuit in 2018 alleging they were the victims of fraud and had suffered health defects in connection with the former shipyard’s ongoing toxic cleanup.\nIn the latest attempt by Irvine-based FivePoint and Miami-based Lennar to settle, the developers and Sausalito law firm Bonner &amp; Bonner had asked the court to approve a $5.4 million deal.\nBut with $1.4 million for attorney fees and $4 million in community payouts, it worked out to $606 per person. A settlement proposal in 2022 for 9,000 residents, also rejected by the judge, would have worked out to $400 per person.\nDonato accused the residents’ attorneys, Charles and Cabral Bonner, of colluding against Tetra Tech EC, a third defendant in the lawsuit but left out of the settlement talks. The unit of Tetra Tech was hired two decades ago to\nclean hazardous radiation and toxic substances\nfrom the shipyard once owned by the U.S. Navy.\nThe developers and the Bonners had entered into a “common interest agreement,” which allows parties with shared legal interests to share information in order to collaborate on defense strategies. But the judge said the residents and developers are “adverse parties” who cut a deal to target Tetra Tech EC.\nSuch a settlement “becomes collusive when it is aimed to injure the interests” of an absent defendant, Donato said.\n\nThe Bonners have denied wrongdoing, saying they acted in the best interest of their clients by collaborating with the developers. Lennar declined to comment to the Chronicle, while FivePoint didn’t respond to a request for comment.\nSam Singer, a spokesperson for Pasadena-based Tetra Tech EC said: “The judge’s order speaks for itself.”\nAfter signing the common interest agreement, the Bonners amended the residents’ complaint for the sixth time. The changes “drastically narrowed plaintiff’s claims against the home builder defendants, dropped the class allegations against them, and deleted the damages demand of $1 billion,” Donato wrote in his order.\n“The evidence of collusion is striking,” Donato wrote. During the hearing, he questioned why the developers should be allowed to exit a $1 billion lawsuit in exchange for “paying nickels.”\nFivePoint, a spinoff of Lennar, has entitlements for thousands of homes and millions of square feet of commercial space at Hunter’s Point.\nA trial date for the case is set for next year, but the Bonners said they are talking with the developers about another settlement deal, and\nreached out to Tetra Tech EC\nto “see if they are interested in negotiating.”\nTetra Tech EC has faced\nmultiple ongoing lawsuits\nrelated to the cleanup of the 500-acre shipyard site, including a lawsuit filed by the developers in 2020. This year, the U.S. Department of Justice agreed to settle a lawsuit brought against the contractor a decade ago, originally by whistleblowers, for\n$97 million\n, according to the Chronicle.\nThe Navy previously said in other court filings that the “negative fiscal impact” of the fraud at the shipyard is between\n$370 million and $570 million\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/sf/article/hunters-point-shipyard-settlement-20206846.php",
      "https://www.sfchronicle.com/realestate/article/sf-shipyard-waterfront-neighborhood-18532802.php",
      "https://bayviewlawsuit.com/february-lennar-settlement-update/",
      "https://www.courthousenews.com/cops-tell-ninth-circuit-to-revive-hunters-point-radioactive-contamination-case/",
      "https://www.sfchronicle.com/bayarea/article/sf-hunters-point-shipyard-20044068.php",
      "https://www.sfchronicle.com/bayarea/article/U-S-sues-Tetra-Tech-over-Hunters-Point-shipyard-13536013.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/08/02/radioactivity-moves-back-cleanup-deadline-at-hunters-point/",
      "https://therealdeal.com/san-francisco/2024/09/09/fivepoint-reworks-candlestick-hunters-point-projects-in-sf/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-13T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
    "title": "Crescent names Conrad Suszynski sole CEO amid development push",
    "subhead": "Fort Worth-based firm promoted several people to executive positions",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-13T15:30:00",
    "content": "A Fort Worth power player made changes at the top.\nCrescent Real Estate named Conrad Suszynski as its sole CEO following the retirement of co-CEO Jason Anderson, the Dallas Business Journal\nreported\n.\nSuszynski steps into the role after almost 20 years at the company. He joined Crescent in 2006 when it operated as Goff Capital Partners before its conversion to Crescent Real Estate in 2016.\nThe firm has also promoted several internal leaders. These include Christopher Goff — Chairman John Goff’s son — to senior managing director, head of capital formation; Andrew Lombardi, who will remain CFO, to senior managing director; Noelle Garsek to managing director, general counsel; and Ben Molk to managing director, office. Joseph Pitchford, managing director of development, will join Crescent’s senior management committee.\nThe leadership shift comes as Crescent expands its footprint across North Texas. The firm manages $4.4 billion in assets and oversees about $225 million in development.\n\nCrescent is raising $250 million for its fourth GP Invitation Fund as it strengthens its development pipeline. The firm’s portfolio includes marquee assets like The Crescent in Uptown Dallas — a 1.3 million-square-foot property with office, retail and hotel components — and the Robert L. Crandall corporate campus for American Airlines in Fort Worth.\nIts development activity is also expanding. Crescent is advancing a\nsecond office tower in Fort Worth\n, constructing the 30-story, 215-unit\nCrescent Point Tower\nin Uptown Dallas and preparing to open a 31-story\nluxury apartment building\nat 2811 Maple in May, where rents start at $4,000 a month.\nIt recently started development on its 92-home\nhigh-end housing project in Horseshoe Bay\nnear Marble Falls, northwest of Austin. Groundwork and infrastructure at the 114-acre site is expected to be completed in March 2026.\nSuszynski said the company is deepening its focus on high-quality development, particularly in Uptown Dallas and Fort Worth, where Crescent is looking to cultivate environments that mirror the success of its flagship properties.\nThe leadership team has an average tenure of over 12 years, Suszynski said.\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/crescent-real-estate-promotes-new-ceo-leaders.html",
      "https://therealdeal.com/texas/fort-worth/2024/03/28/crescent-to-develop-another-office-building-in-fort-worth/",
      "https://therealdeal.com/texas/dallas/2024/04/01/crescent-real-estate-adding-resi-tower-to-uptown-dallas/",
      "https://www.wfaa.com/article/money/business/uptown-dallas-2811-maple-luxury-apartments/287-11fc9cf0-199c-4f3c-825e-92c9af05ff06",
      "https://therealdeal.com/texas/austin/2025/03/07/crescent-real-estate-targets-upscale-central-texas-homebuyers/",
      "https://therealdeal.com/texas/austin/2025/03/07/crescent-real-estate-targets-upscale-central-texas-homebuyers/",
      "https://therealdeal.com/texas/fort-worth/2024/03/28/crescent-to-develop-another-office-building-in-fort-worth/",
      "https://therealdeal.com/texas/2025/03/04/movers-landsea-names-stewart-parker-dfw-president/"
    ],
    "market": "Texas",
    "published": "Thu, 13 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-13T19:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/13/backlash-rises-over-sands-vision-for-irving-casino-resort/",
    "title": "Sands suggests killing massive Irving development if no casino",
    "subhead": "Backlash from residents over zoning proposal for Mavericks stadium, entertainment district, gambling resort",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-13T15:00:00",
    "content": "Las Vegas Sands’ vision for a destination resort in Irving is facing growing public resistance, with concerns over the proposed casino dominating recent discussions.\nMore than 30 Irving residents spoke against the proposal, criticizing the casino element and raising concerns about the city’s planning process in a Planning and Zoning Commission meeting last week, the Dallas Business Journal\nreported\n.\nThe commission is\nconsidering a proposal\nto rezone the 182-acre site owned by Sands to allow for high-density, mixed-use development. Sands acquired 259 acres near the former Texas Stadium in mid-2023.\nThe changes would pave the way for a destination resort featuring a potential casino — pending state legalization — as well as a 15,000-seat arena for the Dallas Mavericks, plus a hotel, retail and entertainment spaces.\nThe debate comes amid broader speculation about the future of the Dallas Mavericks, co-owned by Sands’\nnewly promoted CEO Patrick Dumont\n. Sands bought Mark Cuban’s majority stake in the Mavericks for $3.5 billion at the end of 2023.\nThe rezoning would also establish a baseline development framework, though Sands would need to submit detailed plans for approval later. The proposal is still moving through the early stages. The commission scheduled to revisit it on Monday before a possible city council vote next Thursday.\n\nResidents argued that discussions were being rushed and lacked transparency, with some claiming they first learned of the zoning amendments just 48 hours before the meeting. Others questioned why city leaders would consider approving zoning for a casino while gambling is illegal in Texas.\nSands has said that a casino is essential for the project’s financial viability. Casino revenue is necessary to support other resort amenities like convention space and entertainment venues, the company said.\nThe company plans to have representatives at the upcoming meetings and maintained Sands is committed to “ongoing engagement and collaboration,” spokesman Ron Reese said.\nRemoving casino gaming from the zoning could force Sands to reconsider the development altogether, he said.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/las-vegas-sands-irving-destination-resort-zoning.html",
      "https://therealdeal.com/texas/dallas/2025/02/28/irving-talks-zoning-changes-for-las-vegas-sands-owned-land/",
      "https://therealdeal.com/texas/dallas/2025/03/10/dallas-mavericks-owner-patrick-dumont-promoted-to-sands/",
      "https://therealdeal.com/texas/dallas/2025/03/10/dallas-mavericks-owner-patrick-dumont-promoted-to-sands/",
      "https://therealdeal.com/texas/dallas/2025/02/28/irving-talks-zoning-changes-for-las-vegas-sands-owned-land/",
      "https://therealdeal.com/texas/2024/01/03/adelson-family-buys-dallas-design-district-acreage-from-mark-cuban/"
    ],
    "market": "Texas",
    "published": "Thu, 13 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-13T19:00:00+00:00",
    "author": "TRD Staff"
  }
]