[
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/14/anderson-merchandisers-takes-full-floor-lease-in-plano/",
    "title": "Retail merchandiser flits to newer Plano office space",
    "subhead": "Moving from Granite Park III to 2021 build owned by Monarch Alternative Capital, Tourmaline Capital Partners",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 14, 2025, 11:00 AM",
    "pub_date_dt": "2025-03-14T11:00:00",
    "content": "The flight to quality office trend is responsible for yet another corporate relocation.\nAnderson Merchandisers is moving its headquarters from one Plano office to another; it’s leaving Granite Properties’ Granite Park III, which was built in 2007, for Apex at Legacy, a property delivered in 2021.\nThe retail merchandising company inked a deal to occupy 30,000 square feet — the full top floor — at the 210,000-square-foot office building, according to a news release from JLL. Anderson is bringing more than 100 employees to the space by the fourth quarter of this year, with plans to hire more.\nJLL’s Conor McCarthy and Jayme Schutt represented the tenant in lease negotiations. John Brownlee, Gini Rounsaville and Michael Williams represented the landlord, Monarch Alternative Capital and Tourmaline Capital Partners.\nApex at Legacy, at 5801 Headquarters Drive, is a 14-story office building that was\ndeveloped\nby Dallas-based Heady Investments. Monarch Alternative Capital and Tourmaline Capital Partners purchased the property in 2021.\n\nIt includes features like a game lounge that includes a golf simulator. It’s within walking distance from Legacy West, a mixed-use development in Plano with more than 400,000 square feet of retail and office space.\nThere are plans for expansion — the development will soon feature a second building with office space and a Kimpton Hotel, the release said.\nCorporate America’s push to return to the office has emphasized the flight-to-quality trend in the office market.\nCompanies like Anderson Merchandisers are luring employees into the office with top-of-the-line amenities. Meanwhile, operators of older inventory are under pressure to compete with new deliveries.\nThat’s just one segment of the Dallas-Fort Worth office market, which had 52.8 million square feet of unused office space in November. The Metroplex ranked third in the country for office vacancy, behind New York and Chicago.\n",
    "related_links": [
      "https://www.dallasnews.com/business/real-estate/2021/06/07/new-york-investor-takes-new-plano-office-tower/",
      "https://therealdeal.com/texas/dallas/2024/11/19/dallas-office-vacancy-third-highest-in-nation/",
      "https://therealdeal.com/texas/dallas/2025/02/26/granite-properties-secures-two-floor-lease-in-west-plano/",
      "https://therealdeal.com/texas/dallas/2024/11/11/ryan-koch-moving-to-trophy-building-in-planos-legacy-west/"
    ],
    "market": "Texas",
    "published": "Fri, 14 Mar 2025 15:00:00 +0000",
    "published_dt": "2025-03-14T15:00:00+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/14/lender-takes-back-ohebshaloms-downtown-brooklyn-building/",
    "title": "Lender takes back building from Richard Ohebshalom’s Pink Stone Capital",
    "subhead": "Foreclosure auction for DoBro rental draws no other bidders",
    "authors": "ByElizabeth Cryan",
    "pub_date": "Mar 14, 2025, 10:34 AM",
    "pub_date_dt": "2025-03-14T10:34:00",
    "content": "Richard Ohebshalom’s Downtown\nBrooklyn rental building\nwent back to the lender in a foreclosure auction.\nChicago-based commercial real estate lender Prime Finance bought the brick-clad 103-unit apartment building at 180 Nassau Street for $1,000. There were no other bidders at the auction — but a few gasps erupted from the gallery as the $51.5 million upset price was announced.\nThe lender filed a foreclosure suit in 2022, the same year it bought a $52 million note on the property from Investors Bank. Prime claimed that Pink Stone failed to resume debt payments after a forbearance period extended to the developer ended that year. The court appointed a receiver in May 2023.\nThe debt on the property had ballooned to $58 million by August, when a state Supreme Court judge ordered a foreclosure auction for the property.\n\nOhebshalom, the son of Empire Management’s Fred Ohebshalom, bought the development site at Nassau and Duffield streets for $11.28 million from Brooklyn developer Isaac Hager in 2012. He wrapped up construction in 2014 on the 10-story rental building, known as Warehouse 180, and Investors issued the $52 loan that year.\nOhebshalom tried\nselling the property\nin 2018, asking north of $60 million according to sources at the time, but no deal was reached. A potential obstacle was the looming phase-out of the building’s 421a property tax abatement, which caused property taxes owed on the building to increase.\nIn 2023, Ohebshalom\nlost control\nof a 7-story Soho building, including an apartment where he lived, after pledging the property as collateral for $4 million in mezzanine loans. A few years earlier, in 2018, Pink Stone found itself embroiled in a family feud when Ohebshalom filed\ntwo lawsuits\nagainst his father, Fred.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2022/11/10/pink-stone-faces-foreclosure-on-dobro-rental-building/",
      "https://therealdeal.com/new-york/2018/12/04/pink-stones-warehouse-180-rental-building-in-dobro-hits-the-market/",
      "https://therealdeal.com/new-york/2023/06/26/richard-ohebshalom-loses-home-building-in-soho/",
      "https://therealdeal.com/new-york/2017/03/24/son-what-have-you-done-richard-ohebshalom-files-another-suit-against-fred/",
      "https://therealdeal.com/new-york/2022/11/10/pink-stone-faces-foreclosure-on-dobro-rental-building/",
      "https://therealdeal.com/new-york/2018/12/04/pink-stones-warehouse-180-rental-building-in-dobro-hits-the-market/",
      "https://therealdeal.com/new-york/2023/06/26/richard-ohebshalom-loses-home-building-in-soho/"
    ],
    "market": "New York",
    "published": "Fri, 14 Mar 2025 14:34:40 +0000",
    "published_dt": "2025-03-14T14:34:40+00:00",
    "author": "Elizabeth Cryan"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/14/longtime-douglas-elliman-agent-pablo-alfaro-joins-compass/",
    "title": "Longtime Elliman agent Pablo Alfaro joins Compass",
    "subhead": "Alfaro most recently was sales director at Rivage Bal Harbour",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 14, 2025, 10:30 AM",
    "pub_date_dt": "2025-03-14T10:30:00",
    "content": "Longtime Douglas Elliman agent Pablo Alfaro joined Compass.\nAlfaro left\nElliman\nafter about 14 years. He’s been involved in sales totaling more than $1 billion over his 20-year career, according to a press release. That includes helping to bring new developments to Elliman such as Faena House, Alan Faena and Len Blavatnik’s ultra-luxury condo building; and Ian Schrager’s Edition Residences. Both are in Miami Beach.\nAlfaro most recently was\nleading sales\nat Rivage Bal Harbour Residences, Related Group, Two Roads Development and Rockpoint’s oceanfront luxury condo building at 10245 Collins Avenue. His listings include the nearly $25 million listing of a penthouse at Palazzo del Mare on Fisher Island. Recent deals include supermodel Elle Macpherson’s\n$18.5 million sale\nof her Coral Gables mansion in September.\nAlfaro joined\nCompass\non Monday, state records show. He’ll be based out of the Lincoln Road office in Miami Beach.\n\n“I see a lot of major changes going on in the industry, upper management, the way we run our business, social media. Compass was the best partner for me,” Alfaro said. “I run my business in a very private way.”\nAlfaro is the latest agent to leave Elliman for Compass over the past year. In South Florida, that list includes Thor Brown in Palm Beach and Bonnie Heatzig in Boca Raton. More recently, New York broker\nHolly Parker\n, who also operates in South Florida, joined Compass after 24 years with Elliman.\nThe moves have gone in both directions. While Elliman’s senior vice president of sales for development marketing in Miami,\nNikol Solares\n, left the brokerage for Compass in January,\nElliman brought on Drew Backoff\nas vice president of marketing for new development. Backoff was previously a senior leader at Compass’ development marketing arm.\n",
    "related_links": [
      "https://therealdeal.com/national/2024/10/14/compass-elliman-agents-tracking-broker-moves-2024/",
      "https://therealdeal.com/miami/2023/01/18/related-partners-launch-sales-of-bal-harbour-condos-with-ph-asking-over-65m/",
      "https://therealdeal.com/miami/2024/10/01/supermodel-elle-macpherson-sells-coral-gables-mansion/",
      "https://therealdeal.com/company/compass/",
      "https://therealdeal.com/national/2025/02/05/holly-parker-joins-compass-after-24-years-at-douglas-elliman/",
      "https://therealdeal.com/miami/2025/01/15/compass-to-expand-into-new-dev-condo-sales-luxury-resi/",
      "https://therealdeal.com/miami/2025/02/24/movers-shakers-elliman-taps-new-development-marketing-vp/",
      "https://therealdeal.com/national/2025/03/11/elliman-closed-bumpy-2024-with-narrowed-losses/",
      "https://therealdeal.com/miami/2025/02/24/movers-shakers-elliman-taps-new-development-marketing-vp/",
      "https://therealdeal.com/national/2024/10/14/compass-elliman-agents-tracking-broker-moves-2024/"
    ],
    "market": "South Florida",
    "published": "Fri, 14 Mar 2025 14:30:00 +0000",
    "published_dt": "2025-03-14T14:30:00+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/14/why-manalapans-trophy-market-is-booming/",
    "title": "Why Manalapan’s trophy market is booming right now",
    "subhead": "A look inside the tiny Palm Beach-adjacent enclave with some of Florida’s most expensive listings",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 14, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-14T09:45:00",
    "content": "Just south of Palm Beach, the small island town known for its popularity with the rich and powerful, lies an even smaller island town: Manalapan. Long overshadowed by its more famous neighbor, it is now an ultra-luxury market hub with some of Florida’s most expensive home listings.\n“In the past, everyone only wanted to be on the [Palm Beach] island. Now, we’re seeing specifically people who want to be in Manalapan,” said Douglas Elliman agent Senada Adžem. “It’s not a Palm Beach address, but it’s become very prominent.”\nCurrently six properties are listed in Manalapan asking more than $50 million, remarkable for a town that spans just 2.4 square miles and has about 400 year-round residents, agents say. Those\ntrophy listings\ninclude a 4-acre spec estate\nasking $285 million\n. It would be the priciest home on the market in the U.S., except for a 9-acre Naples compound\nlisted for $295 million\n.\n“I’m shocked. I’m a little blown away with the amount of interest we’ve received,” said Nick Malinosky, the Douglas Elliman agent representing the record Manalapan listing.\nPerhaps the first sign of Manalapan’s ultra-luxury boom was\nbillionaire Larry Ellison’s $173 million\npurchase of a 16-acre oceanfront compound in 2022. It remains the most expensive home ever sold in Florida. Ellison doubled down on his investment in the town in August, dropping $277.4 million on the\nEau Palm Beach Resort &amp; Spa\n. All Manalapan residents are granted free membership to the resort, which functions as the de facto town center.\nOther high-profile Manalapan buyers include Fox News host Sean Hannity, who bought a waterfront mansion for\n$23.5 million\nin November.\nStill, brokers say many of their clients are interested first in a Palm Beach home. The island emerged from the pandemic as\nan epicenter of the American ultra-luxury market\n, a place where homes frequently trade for north of $50 million. Last year, the two\nmost expensive home sales in Florida\nwere both in Palm Beach: A private island sold for\n$150 million\n, and a historic oceanfront estate traded for\n$148 million\n. But with fewer than 2,500 homes on the 16-mile long barrier island, Palm Beach options are limited.\nPalm Beach’s market also has a crucial mismatch between what buyers want to buy and what sellers want to sell. Since the onset of the pandemic, affluent buyers across South Florida have prioritized large, oceanfront properties in turnkey condition. Nothing on the market in Palm Beach fits that bill. Pocket listings for such homes have make-me-move prices that agents say range from about $100 million to as much as $300 million.\nMeanwhile, oceanfront properties in Manalapan are abundant, and buyers don’t have to pay the premium for a Palm Beach address.\n“You’re going to get more bang for your buck,” Malinosky said.\nIn addition to large lots –– oceanfront Manalapan estates have a minimum of 150 feet of beach frontage –– the enclave is also a short distance from private schools, private airports and private clubs like President Donald Trump’s Mar-a-Lago. Many of the properties have both oceanfront and Intracoastal Waterway frontage, allowing for residents to keep their yachts docked in the backyard.\n\n“What they have to offer is exceptional,” said Corcoran Group agent Candace Friis, who has an oceanfront Manalapan listing asking $87 million.\nMalinosky agreed, saying spec developers in Manalapan also have a keen understanding of what ultra-luxury buyers want, something\nothers have struggled with\n.\n“There is no shortage of buyers who can spend $100 million, $200 million right now,” he said. But they want homes that check all the boxes: spa facilities, office space, a guest house and staff quarters are must-haves for buyers at that price range. Manalapan has ample listings with these amenities, agents said.\nAll together, these market dynamics have made Manalapan a household name among a certain set of sophisticated buyers, agents added.\n“There was a time I would have to explain to buyers coming to town what Manalapan is,” said Malinosky. Not anymore.\nHere are this season’s trophy listings in Manalapan:\n$285M | 1960 South Ocean Boulevard | Seller: Stewart Satter\nSpec developer and former Manalapan mayor Stewart Satter is\nasking $285 million\nfor the 4-acre ocean-to-Intracoastal estate planned for 1960 South Ocean Boulevard. He bought the land for $27.5 million in March, records show. The planned estate will have a 50,390-square-foot main house with eight bedrooms, nine bathrooms, seven half-bathrooms and two kitchens. It will also have a guest house, boathouse, beach house, car museum, bowling alley, shooting range, padel court, gym, spa, theater and golf simulator, the listing shows. The design team for the estate, which is\nbeing marketed fully furnished\n, includes architecture firm Choeff Levy Fishman and Marc-Michaels Interior Design.\nMalinosky has the listing.\n$150M | 1370 South Ocean Boulevard | Seller: Christopher Rokos\nBillionaire hedge funder Christopher Rokos is asking $150 million for his 2.8-acre ocean-to-Intracoastal estate. The founder of London-based Rokos Capital Management has a net worth of $2.3 billion, according to Forbes. He bought the estate for $40 million in 2017, records show. The 18,400-square-foot mansion was built in 1972 and renovated in 2015. It has nine bedrooms, 11 bathrooms, five half-bathrooms, a spa wing with a gym and wellness facilities, a billiard room, game room, theater and a 10-car garage with a club room, according to records and the listing. It is being marketed fully furnished with interiors by Marc-Michaels Interior Design.\nJack Elkins with William Raveis has the listing.\n$95M | 1140 South Ocean Boulevard | Seller: Joe Farrell\nSpec developer Joe Farrell has already found a buyer for the oceanfront estate at 1140 South Ocean Boulevard. He listed it for $95 million in August, and it became pending earlier this month, Redfin shows. Farrell bought the 1.6-acre site for\n$32.5 million\nin January of last year, and is planning a 19,000-square-foot, nine-bedroom main house and a 4,000-square-foot, four-bedroom guest house, eight-car garage, two pools and a pickleball court, the listing shows. Construction is expected to be completed later this year.\nMargit Brandt with Premier Estate Properties is representing both parties in the deal, she confirmed.\n$87M | 1160 South Ocean Boulevard | Seller: Robert Wexler\nSpec developer Robert Wexler is asking $87 million for the renovated oceanfront estate at 1160 South Ocean Boulevard. Records show his NBU Land Trust bought the 1.7-acre compound from Cantor Companies CEO Michael Cantor for\n$28 million\nin 2021. The estate was built in 1995 and renovated in 2022, records show. The compound includes a 14,800-square-foot main house with seven bedrooms, 10 bathrooms and two half-bathrooms, according to records. It also has a 1,700-square-foot, two-bedroom guest house, a pool, gym, wine room, game room, theater, 13-car garage, staff quarters and a catering kitchen, the listing shows.\nCandace Friis and Phillip Friis with the Corcoran Group have the listing.\n$85M | 640 South Ocean Boulevard | Seller: Robert Wexler\nWexler has another listing down the road at 640 South Ocean Boulevard asking $85 million. Records show his trust bought the 1.9-acre oceanfront estate for\n$36 million\nin 2020. Built in 2019, it includes a 12,800-square-foot main house with nine bedrooms, 12 bathrooms and six half-bathrooms, according to property records. The compound also has a guest house, a guard house at the entrance, a wine room, gym, spa and pool, the listing shows.\nCasey Flannery with Equestrian Sotheby’s International Realty has the listing.\n$79M | 1040 South Ocean Boulevard | Seller: 1040 Ocean LLC\nA Delaware entity named for the address is selling the estate at 1040 South Ocean Boulevard, asking $79 million for the 2.2-acre compound built in 2018. The LLC’s address is listed as 616 Nimes Road in Los Angeles, which is a Bel Air mansion currently on the market for $56.8 million. The listing agent told the Wall Street Journal the owners are European, but declined to comment further on their identities. They bought the Manalapan mansion for\n$25.8 million\nin 2021.\nThe estate has a 16,400-square-foot mansion with eight bedrooms, 12 bathrooms, three half-bathrooms, a guest house and a pool, according to records and the listing.\nMargit Brandt has the listing.\n$69.9M | 1460 South Ocean Boulevard | Seller: Vivian Dimond\nDeveloper and investor Vivian Dimond is asking $69.9 million for the 1.5-acre oceanfront estate at 1460 South Ocean Boulevard. Her Bayshore Grove Capital\nbought the property\nin August for an undisclosed amount, after Edward London’s London Financial South Ocean LLC\nforeclosed\non the home from Nigerian oil mogul Onajite Okoloko.\nThe 19,700-square-foot mansion was completed last year and includes six bedrooms, eight bathrooms, five half-bathrooms, a pool, wellness wing, staff quarters and 16-car garage, according to the listing.\nChris Leavitt with Douglas Elliman and Toni Schrager with Brown Harris Stevens have the listing.",
    "related_links": [
      "https://therealdeal.com/tag/trophy-properties/",
      "https://therealdeal.com/miami/2025/01/16/manalapan-spec-mansion-next-to-larry-ellison-lists-for-285m/",
      "https://therealdeal.com/miami/2024/02/07/naples-estate-listed-for-record-295m/",
      "https://therealdeal.com/miami/2022/06/22/oracle-founder-larry-ellison-pays-173m-for-jim-clarks-manalapan-estate/",
      "https://therealdeal.com/miami/2024/08/13/larry-ellison-pays-277m-for-eau-palm-beach-in-manalapan/",
      "https://therealdeal.com/miami/2024/12/03/sean-hannity-drops-24m-on-manalapan-mansion/",
      "https://therealdeal.com/miami/2024/02/12/palm-beach-ranks-as-americas-top-resi-trophy-market/",
      "https://therealdeal.com/miami/2024/12/19/south-floridas-10-most-expensive-home-sales-of-2024/",
      "https://therealdeal.com/miami/2024/05/17/palm-beachs-most-expensive-home-sells-at-discount-for-152m/",
      "https://therealdeal.com/miami/2024/06/18/playboy-mansion-owner-buys-palm-beach-estate-for-148m/",
      "https://therealdeal.com/magazine/december-2024/spec-on-ice/",
      "https://therealdeal.com/miami/2025/01/16/manalapan-spec-mansion-next-to-larry-ellison-lists-for-285m/",
      "https://therealdeal.com/weekend/luxury-homes/why-luxury-buyers-pay-top-dollar-for-furnished-homes/",
      "https://therealdeal.com/miami/2024/01/25/hamptons-developer-linked-to-33m-manalapan-estate-purchase/",
      "https://therealdeal.com/miami/2021/06/03/developer-michael-cantor-sells-oceanfront-manalapan-estate-for-28m/",
      "https://therealdeal.com/miami/2020/07/13/659526/",
      "https://therealdeal.com/miami/2021/02/08/oceanfront-mansion-in-manalapan-sells-for-26m/",
      "https://therealdeal.com/miami/2024/08/02/vivian-dimonds-fund-buys-manalapan-estate-asking-88m/",
      "https://therealdeal.com/miami/2023/12/13/lender-buys-oil-mogul-onajite-okolokos-manalapan-estate/"
    ],
    "market": "South Florida",
    "published": "Fri, 14 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-14T13:45:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
    "title": "HomeServices CEO denies Compass deal talks",
    "subhead": "“No such sale is being contemplated,” Gino Blefari told employees after WSJ report",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 14, 2025, 9:16 AM",
    "pub_date_dt": "2025-03-14T09:16:00",
    "content": "The head of Berkshire Hathaway HomeServices called bull on a\nWall Street Journal report\nclaiming Compass was in\n“advanced talks” to acquire the firm\n.\nIn an email to franchisees, HomeServices CEO and chairman Gino Blefari denied any ongoing deal discussions between the two companies.\n“I want to confirm to you that there are no discussions, negotiations, or agreements to sell HomeServices or any of its affiliated companies, and that includes the Berkshire Hathaway HomeServices franchise business,” wrote Blefari.\n“Moreover, no such sale is being contemplated,” he said.\nThe Journal first reported the residential giant was in talks for the firm, country’s fourth-largest brokerage, according to RealTrends.\n\nRepresentatives from BHHS and Compass did not immediately respond to requests for comment.\nThe strong denial from Blefari is an abrupt turn of events in a deal that was expected to be coming together soon, sources told the Journal.\nThe move would be a major step in what has become a 12-month period of rapid consolidation for Compass, the nation’s largest brokerage by deal volume.\nCompass sent shockwaves through the industry last year when it announced\na $444 million deal\nto acquire Christie’s International Real Estate and @properties. @properties was the eighth-largest brokerage in the country before the acquisition, according to RealTrends.\nThe acquisitions have contributed to Compass’ push to grow its private listings network. In the firm’s most recent earnings call, Reffkin said 7,500, or 35 percent of the company’s listings, were off-MLS. In February, more than half of new Compass listings started as private exclusives or were available only on Compass.com, which are part of the company’s latest\nconsumer marketing strategy\n.",
    "related_links": [
      "https://www.wsj.com/real-estate/compass-in-talks-to-buy-warren-buffetts-real-estate-brokerage-unit-5eab82e5",
      "https://therealdeal.com/national/2025/03/13/compass-in-talks-to-acquire-bhhs/",
      "https://therealdeal.com/national/2024/12/02/compass-is-acquiring-properties-christies-real-estate/",
      "https://therealdeal.com/national/2025/02/06/how-compass-new-consumer-platform-adds-to-inventory-push/"
    ],
    "market": "National",
    "published": "Fri, 14 Mar 2025 13:16:24 +0000",
    "published_dt": "2025-03-14T13:16:24+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/14/west-village-residents-oppose-private-padel-club/",
    "title": "West Village residents push back against private padel club",
    "subhead": "Neighborhood reps clash with developers over liquor license",
    "authors": "BySheridan Wall",
    "pub_date": "Mar 14, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-14T08:00:00",
    "content": "Padel may have fans everywhere\nfrom Brooklyn\nto\nBillionaires’ Row\n, but West Village residents won’t allow a new private members’ club hinged on the sport to get a liquor license without a fight.\nRoughly 30 people living in the neighborhood rallied against the proposal for 120 Leroy Street, which includes a rooftop restaurant and three padel courts, at a meeting with the state’s liquor licensing authority on Thursday.\nAmong their concerns, residents, brandishing signs reading “No Rooftop Restaurant” and “No Private Padel,” claim the project would drive noise up and add traffic and congestion to the largely residential area.\n“The community has been asking for a year, ‘Let us see your plans,’” said Massimo D’Angelo, an attorney representing a group of residents, who argued the team behind the project — including clothing designer Ronnie Fieg, the Cayre family’s Midtown Equities and the owners of Cafe Mogador — has been reluctant to share information with residents concerned about the plans.\nD’Angelo added that 450 local residents signed a petition opposing the project.\nThe authority denied a temporary permit for the premises and ordered the team behind the project to amend the application. Chair Lily Fan rebuked the applicants for failing to negotiate a solution.\n“Do something reasonable so that people will welcome you,” Fan said. She added that without the neighborhood’s support, “I don’t see how your business is going to survive.”\n“Convincing me is not a win,” Fan added. “That’s just the beginning. It’s these 450 people you have to convince”\nThe clash at the meeting was the latest development in a contentious saga between neighborhood residents and spearheads of the project, which is described as a private members’ club with spa, wellness, padel facilities and a restaurant. The restaurant is open to members of the public with a $50 cover charge.\nPlans for the building initially included a rooftop bar, though an attorney for the owners, Donald Bernstein, said zoning wouldn’t allow it. The developers instead pivoted to a rooftop extension of the restaurant and agreed not to allow any background music.\nAt the hearing, Bernstein said his clients would amend their application to exclude the restaurant’s rooftop extension and would seek only to license the restaurant on the floor below.\nAn architect for the project said at the hearing that the developers had invested $7 million in the project so far and that construction was about halfway finished with an expected completion in September or October this year — though residents strongly objected to his characterization of the progress.\n“That’s bullshit,” one resident yelled from the back of the room.\nAnother said, “We have eyes, you know.”\nWhen members of the authority asked attendees to quiet down, another added, “Someone needs to point out that he’s lying.”\nBut Bernstein dismissed their comments.\n“Money has been spent. Construction is being done,” he said.\nBernstein urged the authority to disregard the community’s objections to noise from the padel court, as the liquor license, if granted, would only apply to the restaurant and its rooftop extension, before he agreed to scrap it.\n“Whatever issue and complaints they have about the padel courts, this is not the right [venue] for it,” Bernstein said.\n\nFieg, Michael Cayre and a representative for the Mogador owners did not immediately respond to a request for comment.\nThe throwdown over the proposal began heating up last spring, when the developers applied for a liquor license and outlined their plans for the property’s roof and ninth floor. The fight was first reported by the\nNew York Post\n,\nIn the application, the team laid out its vision: a private members club with a spa, restaurant run by the acclaimed East Village restaurateurs, padel courts and a rooftop lounge with background music and the occasional DJ. The club, open from 7 a.m. until midnight, would allow non-members for a $50 fee and up to 20 private parties a year.\nResidents quickly rose up to block the plans. In May, members of Community Board 2, which includes Greenwich Village and the West Village, voted 33 to 1 to oppose the project, urging the SLA to deny the license application.\n“Noise pollution from this type of venue would be detrimental,” a couple with an eight-month-old child living at 421 Hudson Street wrote in a letter opposing the license. “A rooftop venue\nwith padel courts, alcohol, and loud music/live DJ all day until 12 a.m. every night of the\nweek is not at all in line with the character of this area.”\nAnother resident of the condo building objected to the project, claiming it would add “noise, drunken rowdiness, and crime to our lovely area.”\nBut the board’s vote was a suggestion, not a mandate, and the developer’s application continued to move forward, with residents pushing back each step of the way.\nThe following month, two state legislators, whose districts include neighborhoods near 120 Leroy, also wrote a letter to the SLA, encouraging them to deny the property’s liquor license. In the letter, State Senator Brian Kavanaugh and Assemblymember Deborah Glick pointed to residential buildings surrounding the property.\n“Most problematic is the rooftop bar and lounge,” Kavanaugh and Glick wrote in the letter, arguing it “would significantly increase the noise level experienced by these residents on a daily basis and late into the evening.”\nDespite residents’ vehement protests, by the end of the summer, signs pointed toward the license’s approval.\nSince the project is near other establishments that sell alcohol, it’s subject to the 500 Foot Law, which means the authority must determine whether issuing the license would be in the “public interest.”\nIn August, a judge sided with the applicants in a report, ruling the proposal met the public interest burden and recommending the authority grant the license.\nAt a January hearing on the license, community members once again voiced their objections to the project, and SLA chair Lily Fan ordered the developers to confer with residents privately to come to a resolution.\nBut a February meeting between the parties was to no avail.\n“The Applicants appeared for the February 22, 2025, Meet and Confer wholly unprepared and unwilling to foster a meaningful conversation with respect to the community members’ well documented and previously expressed concerns,” Massimo D’Angelo, an attorney representing a group of residents wrote to Fan last week.\nNow it’s back to the drawing board for the project’s team, who will have to re-file their application for a liquor license without the rooftop portion. Even with a small win under their belt, residents don’t appear to be backing down from their position.\n“Even if this proposed open-air padel stadium could be covered with a bubble, it would not be able to reduce the noise and lights that would disrupt this West Village residential community,” D’Angelo wrote in a statement.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2021/10/27/padel-its-a-sport-club-to-open-in-brooklyn-warehouse/",
      "https://therealdeal.com/weekend/style/pro-padel-league-hits-billionaires-row/",
      "https://nypost.com/2025/03/08/us-news/west-village-residents-against-ronnie-fiegs-rooftop-padel-courts/",
      "https://therealdeal.com/weekend/style/pro-padel-league-hits-billionaires-row/",
      "https://therealdeal.com/new-york/2023/05/24/ray-dalios-neighbor-clash-over-soho-penthouse-project/",
      "https://therealdeal.com/new-york/2025/03/11/details-emerge-on-pricing-at-80-clarkson/"
    ],
    "market": "New York",
    "published": "Fri, 14 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-14T12:00:00+00:00",
    "author": "Sheridan Wall"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/14/zell-kravinsky-buys-suburban-chicago-apartments/",
    "title": "Zell Kravinsky snags Algonquin rentals for $19M after FPA’s distress play",
    "subhead": "Suburban Chicago property bought out of distress in 2018 by Greg Fower’s San Francisco-based multifamily giant headed to investor landlord",
    "authors": "BySam Lounsberry",
    "pub_date": "Mar 14, 2025, 7:15 AM",
    "pub_date_dt": "2025-03-14T07:15:00",
    "content": "A venture involving Zell Kravinsky’s Morning Sky Capital scooped up a 63-unit apartment complex on the bank of the Fox River in the northwest suburbs of Chicago from multifamily giant Greg Fowler’s firm, which previously bought it out of distress.\nKravinsky’s company partnered with several other investors to pay $19.3 million for the ReNew on Main property at 1 North Main Street in Algonquin, public records show. The price of $302,000 per unit included assuming an existing mortgage with a balance of more than $11 million that the San Francisco-based seller, FPA Multifamily, previously took out on the property, sparing the buyer from shopping for debt at today’s elevated interest rates.\nFor FPA, one of Chicagoland’s largest multifamily landlords, the deal extends a streak of activity in the area that has tended to follow the same pattern: the firm is\nselling off its smaller assets\nand buying up bigger ones with funds the transactions generate. The Algonquin deal closed right as\nFPA bought a 356-unit Naperville apartment complex\nfor $68 million, in another deal where it assumed the existing debt of the seller, Chicago-based Rockwell Partners.\n“There is not a lot of liquidity in the market right now, which is good for people who have a conviction in the market and are ready to make a bet,” said Morning Sky’s Lev Kravinsky. “In general most of what we’re buying nowadays is either all cash or loan assumption. It’s difficult but not impossible to find deals that pencil with fresh debt.”\nFPA didn’t return a request for comment on the Algonquin transaction.\nWhile the deal is relatively small for FPA, the seller posted a gain on the property after buying it out of distress in 2018 for $12.7 million ($201,600 per unit). The complex, which also includes six ground-floor retail units, has a checkered ownership history after running into delays during its development, and financial trouble after its 2011 completion.\n\nFPA bought it from a financial institution, Boston-based UC Funds, which acquired the property through foreclosure. The property was conceived as a 54-unit luxury condo project, awarded to Aspen Homebuilders back in 2006 by the village of Algonquin. Aspen went bankrupt two years later, and the firm’s owner, Bruce Hawkins, pleaded guilty in 2013 to defrauding a bank of more than $1 million, the Northwest Herald previously\nreported\n.\nThe building remained unfinished for years, until developer John Bruegelmans took over the project in 2011 and gained approval to convert the project into rentals. Residents started moving in during 2015, but Buregelmans filed for bankruptcy in 2016 to restructure construction debt, the newspaper reported.\nThat’s what prompted a UC Funds entity to take over the building and eventually sell it to FPA.\nMeanwhile, buyers in Chicago and its suburban multifamily markets are\nset to raise rents\nin the coming year as new supply craters amid a development dropoff.\nMorning Sky owns several other apartment complexes in the area, with three in the suburbs and one in the city, Lev Kravinsky said. His father, Morning Sky principal Zell Kravinsky, is well-known as a philanthropist and longtime real estate investor.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2024/08/07/kurt-bender-pays-28m-for-arrive-town-center-to-fpa-multifamily/",
      "https://therealdeal.com/chicago/2025/03/10/fpa-multifamily-buys-suburban-chicago-asset-via-assumable-debt/",
      "https://www.shawlocal.com/2018/11/27/troubled-riverside-plaza-in-algonquin-sells-for-12-7m/auyduc7/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/02/14/fpa-multifamily-sells-downers-grove-asset-to-laramar-group/",
      "https://therealdeal.com/chicago/2024/08/06/fpa-multifamily-buys-oak-parks-tallest-tower/"
    ],
    "market": "Chicago",
    "published": "Fri, 14 Mar 2025 11:15:00 +0000",
    "published_dt": "2025-03-14T11:15:00+00:00",
    "author": "Sam Lounsberry"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/14/title-insurance-industry-remembers-cuomos-crackdown/",
    "title": "The Daily Dirt: Will title insurers forgive Cuomo?",
    "subhead": "Industry went to court to beat back governor’s attack",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 14, 2025, 7:00 AM",
    "pub_date_dt": "2025-03-14T07:00:00",
    "content": "Andrew Cuomo got some attention this week for\ndefending bail reform\n, a\nmeasure\nhe signed as governor that critics blamed for rising crime (a claim the data\ndid not actually prove\n) and for signaling that wrongdoers wouldn’t be held accountable.\nBut there was another Cuomo action that sticks in the craw of some real estate people even more: his attempt to\nrein in the title industry\n.\nOne person from that field told me that although he’s not impressed with the other mayoral candidates, he won’t be voting for Cuomo because of the battle over\nRegulation 208\n.\nCuomo’s Department of Financial Services didn’t think customers should bear any of the cost of title insurance agents’ entertainment of real estate professionals — that is, the folks who can steer homebuyers’ business to them.\nIn fact, DFS tried to forbid the industry from giving gifts or doing anything resembling “wining and dining.” The agency called out such “unscrupulous practices” as bad for consumers, who tend not to shop around for title insurance.\nThe regulations followed a DFS investigation that the agency said “revealed that title insurance companies and agents have spent millions of dollars on inducements that the industry has charged back to consumers as ‘marketing costs.’”\nBut the industry challenged Cuomo’s action in court. The legal battle went on for years but title insurers eventually won — overcoming a\nruling in Cuomo’s favor\nby the Appellate Division, which called the inducements an “ethically dubious scheme.” Regulation 208 remains on the books today.\n“Why is it illegal for me to market my services!” the title professional said by email. “Why are we, as an industry, the only people in the real estate sector that are not allowed to entertain our clients? Must we go Dutch when inviting a client or prospective client for lunch or dinner?”\nWhat we’re thinking about:\nOne landlord on X bemoaned the field of mayoral contenders,\ncommenting\n, “Who would we vote for other than Cuomo? Eric Adams is Trump’s bitch; all the other candidates seem to be looney tunes\nDSA types\n.” Do you agree? Send your thoughts to\neengquist@therealdeal.com\n.\nA thing we’ve learned\n: Of all the metro areas in the country, New York had the largest natural growth last year, with 214,000 births and 141,000 deaths.\nElsewhere…\nNormally, New York City apartments priced below market rate don’t stay vacant long. But an owner of a 10-building portfolio in the Bronx lost $117,000 in potential rent last year while trying to re-rent affordable units through the city’s Housing Connect lottery system, according to a New York Housing Conference\nreport\n.\n\nThe group’s analysis focused on why it takes so long to match these units with eligible tenants, which should be like selling ice cream cones for a dollar on a 100-degree day.\nIn the above example, the landlord estimated that it would have missed only $20,000 in rent had it been able to simply list the units. The portfolio’s vacancy rate would have been 0.6 percent instead of 3 percent.\nIn case you missed it, check out\nmy column\nabout the poorly designed system that produces this result for owners of affordable housing across the city.\nClosing time\nResidential:\nThe priciest residential sale Thursday was\n$10.35 million\nfor a 2,695-square-foot, sponsor-sale condominium unit at 500 West 18th Street in Chelsea. Deborah Kern and Steve Gold of the Corcoran Group had\nthe listing\n.\nCommercial:\nThe most expensive commercial closing of the day was\n$259.5 million\nfor a portion of 333 Schermerhorn Street in Downtown Brooklyn. Steiner NYC purchased the remaining stake from JPMorgan, Crain’s\nreported\n.\nNew to the Market:\nThe highest price for a residential property hitting the market was\n$12 million\nfor a 3,344-square-foot townhouse at 214 West 11th Street in the West Village. The Eklund Gomes Team at Douglas Elliman has the listing.\nBreaking Ground:\nThe largest new building application filed was for a 93,072-square-foot, 12-story community and housing facility at 1546 East New York Avenue in Brownsville. David Kriegel filed the permit on behalf of Xenolith Partners.\n— Matthew Elo",
    "related_links": [
      "https://nypost.com/2025/03/10/opinion/andrew-cuomo-gives-fair-notice-he-wont-fix-bail-reform-and-drive-down-crime/",
      "https://www.brennancenter.org/our-work/research-reports/facts-bail-reform-new-york-how-pretrial-detention-and-release-works-now",
      "https://www.brennancenter.org/our-work/research-reports/facts-bail-reform-and-crime-rates-new-york-state",
      "https://www.dfs.ny.gov/reports_and_publications/press_releases/pr1710171",
      "https://www.governor.ny.gov/sites/default/files/atoms/files/NSText_208_New.pdf",
      "https://www.dfs.ny.gov/industry_guidance/circular_letters/cl2019_02a",
      "https://x.com/MallardDuck13/status/1895902604116574337",
      "https://therealdeal.com/new-york/2025/02/25/zohran-mamdani-claims-landlords-reject-subsidy-to-cry-poverty/",
      "mailto:eengquist@therealdeal.com",
      "https://thenyhc.org/wp-content/uploads/2025/02/Housing-Connect-Rerental-Exemption-Final.pdf",
      "https://therealdeal.com/new-york/2025/02/25/why-nyc-landlords-struggle-to-re-rent-affordable-units/",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031300539001",
      "https://www.corcoran.com/listing/sold/500-west-18th-street-west-29c-manhattan-ny-10011/22943171/regionId/1",
      "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025031200809001",
      "https://www.crainsnewyork.com/real-estate/steiner-buys-out-jpmorgans-stake-downtown-brooklyn-skyscraper",
      "https://www.elliman.com/newyorkcity/sales/detail/527-l-704-17_23366842/214-w-11th-st-west-village-new-york-ny-10014"
    ],
    "market": "New York",
    "published": "Fri, 14 Mar 2025 11:00:00 +0000",
    "published_dt": "2025-03-14T11:00:00+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/msasa-properties-to-build-118-apartments-in-san-jose/",
    "title": "Msasa Properties to build 118 apartments in San Jose",
    "subhead": "Development near Japantown the first large market-rate project in the city since 2023",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 8:00 PM",
    "pub_date_dt": "2025-03-13T20:00:00",
    "content": "A developer wants to bulldoze an office building to build 118 apartments in the first large multifamily development in San Jose in two years.\nAn affiliate of locally based Msasa Properties led by Mostafa Aghamiri was approved by the San Jose City Council to demolish a two-story, 12,000-square-foot office building at 380 North First Street, in Hensley, the\nSilicon Valley Business Journal reported\n.\nThe affiliate, 380 N 1st Street QOZB LLC, has filed plans to build a 119,000-square-foot apartment complex in its place. Aghamiri’s Msasa Properties\nfiled plans in September 2023\nto build the seven-story complex near San Jose’s Japantown.\nWith developers having built no market-rate projects larger than 20 units in the city last year, Aghamiri’s project appears to be the first large-scale multifamily development since 2023, in which 336 units were built.\nPlans call for 118 apartments on a half-acre north of Basset Street between North First and North Second streets, with six set aside as affordable for very low-income households. Parking would be available for 74 cars.\nInitial plans by Aghamiri included 18 affordable units, or 15 percent, but he cut it to 5 percent to make the project pencil out, according to Erik Schoennauer, a local land use consultant who spoke on behalf of the developer.\n\nThe project, designed by Oakland-based Studio T-Square, features a charcoal and white complex with balconies, according to a rendering, bookended by a brown brick sections.\nThe site is located in an opportunity zone, which offers tax advantages to developers.\nAghamiri bought the office property in 2022 for $5.3 million, or $442 per square foot.\nThe 61-year-old offices have been vacant for 10 months, and have been damaged by vandals, Schoennauer said. They’ve been 60 percent vacant for more than five years\nHe said Aghamiri hopes to break ground this summer, and complete the project in 20 to 24 months.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanjose/news/2025/03/12/vacant-san-jose-office-demolition-redevelopment.html",
      "https://therealdeal.com/san-francisco/2023/09/06/msasa-properties-updates-plan-for-apartments-in-san-jose/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2023/09/06/msasa-properties-updates-plan-for-apartments-in-san-jose/",
      "https://therealdeal.com/san-francisco/2025/02/18/hanover-secures-120m-loan-for-1140-apartments-in-san-jose/",
      "https://therealdeal.com/san-francisco/2025/02/27/robson-homes-wants-to-turn-eggs-into-homes-in-san-jose/"
    ],
    "market": "San Francisco",
    "published": "Fri, 14 Mar 2025 00:00:00 +0000",
    "published_dt": "2025-03-14T00:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/13/lack-of-land-leads-oc-home-builders-to-23-dip/",
    "title": "Lack of land leads OC home builders to 23% dip",
    "subhead": "Top developers reported 31% drop in single-family homes, 15% drop in attached homes",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-13T19:30:00",
    "content": "Top developers in Orange County are selling fewer homes, with deals plunging in the double digits because of fewer places to build.\nThe top 13 builders in the county last year sold a combined 2,253 attached and detached homes, down 23 percent from 2,912 sold in 2023,\nthe Orange County Business Journal reported\n, citing figures from Zonda and local developers.\nSingle-family home sales fell 31 percent to 908, while attached townhome and condominium sales declined 15 percent.\nNine of the 13 biggest builders reported fewer homes sold compared to last year, with Tri Pointe Homes, Landsea Homes, Taylor Morrison, Trumark Homes and KB Home showing the biggest drops.\nThere just isn’t enough available land in OC to build new houses, according to Allison Rawlins Tift, a senior vice president at Land Advisors Organization, a consultant group with an office in Irvine.\n“The home builders all echo the same sentiments about wanting or needing any mapped/entitled/finished lots available in the county, but there is a similar lack of supply of future lots available for home builders to acquire and then build upon,” Rawlins told the Business Journal.\nOf the nine companies that reported year-over-year OC sales declines, Irvine-based Tri Pointe Homes reported the largest drop, selling 95 houses last year, 67 percent fewer than in 2023.\nScottsdale-based Taylor Morrison sold 25 detached homes last year, a 59 percent drop from 2023. It didn’t sell any attached homes, compared to eight in 2023.\n\nSan Ramon-based Trumark Homes sold 52 percent fewer homes, according to the Business Journal, while Los Angeles-based KB Home reported a 44 drop in home sales in OC last year to 53 homes.\nMiami-based Lennar had the highest volume of sales in OC last year, closing on 936 attached and detached houses, but sales were 15 percent fewer than the 1,099 homes sold the prior year.\nMeanwhile, Pennsylvania-based Toll Brothers sold 94 attached houses in OC last year,  compared to 82 in 2023, a 37 percent drop. Its detached home sales plunged 49 percent to 172, from 339 in 2023.\nWhile most developers lost sales, three companies managed to grow their businesses, while Mission Viejo-based PulteGroup reported flat sales, according to the Business Journal.\nIrvine-based California Pacific Homes reported the biggest jump, with a 200 percent surge to 135 homes sold in Orange County last year, including 111 single family houses, which leaped 484 percent.\nThe Seal Beach-based Olson reported 104 percent year-over-year growth, with all 92 attached homes sold.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/oc-homepage/homebuilders-hit-the-brakes-on-new-oc-homes/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/01/22/typical-house-payment-reaches-7700-in-orange-county/",
      "https://therealdeal.com/la/2025/01/10/orange-county-home-prices-jump-7-7-most-in-the-nation/",
      "https://therealdeal.com/la/2024/08/08/orange-county-joins-the-trillion-dollar-housing-club/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-13T23:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/13/chicago-developer-sterling-bay-downsizes-office-space/",
    "title": "Sterling Bay HQ move triggers tenant leapfrog in Fulton Market",
    "subhead": "Chicago developer downsizing space as it seeks funding for Lincoln Yards",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 7:15 PM",
    "pub_date_dt": "2025-03-13T19:15:00",
    "content": "Sterling Bay is relocating its headquarters within Chicago’s Fulton Market, the developer’s latest cost-cutting move, instigating a chain reaction of occupancy shakeups, CoStar\nreports\n.\nThe Chicago developer, which played a central role in transforming Fulton Market from a meatpacking district to a corporate hub, is downsizing its HQ from 31,000 square feet at 333 North Green Street to about 25,000 square feet at 939 West Fulton Market, subleasing space from Vital Proteins.\nR1 RCM, a Utah-based healthcare revenue management company, is expanding into the space Sterling Bay is exiting at 333 North Green Street. Add to the shuffle Chinese furniture manufacturer Sunon, which is negotiating to sublease R1 RCM’s 13,000 square feet space at 800 West Fulton.\nIf finalized, Sunon would join other furniture brands in the area, using the space as a showroom.\nR1 RCM was represented by JLL’s Andy Strand, Vital Proteins by Colliers’ Dougal Jeppe, and Sunon by JLL’s Sarah Silva and Nicole Becker.\nSterling Bay’s new offices will span the top two floors of a three-story building owned by Asana Partners.\n\nSterling Bay began to\nshed its Chicago assets\nlast year, likely to finance its Lincoln Yards project, a multi-billion-dollar mixed-use development on Chicago’s North Side\nthat has failed to attract investment\n.\nThe firm has also\nbeen selling off\nsome development parcels near Lincoln Yards and within Fulton Market itself.\nSterling Bay developed the 553,000-square-foot building at 333 North Green Street with JPMorgan in 2019, signing a long-term lease to have its offices in the building as part of the deal. The 19-story building is fully leased after nearly 97,000 square feet was\nleased by Dutch financial technology firm Adyen\nlate last year.\nFulton Market gained Google’s Midwest headquarters as well as McDonald’s, which leased the office building where Oprah Winfrey’s Harpo Studios once stood.\n— Judah Duke\n",
    "related_links": [
      "https://www.costar.com/article/54006887/chicago-developer-sterling-bay-to-move-hq-in-fulton-market-office-shuffle",
      "https://therealdeal.com/chicago/2025/01/10/sterling-bay-magellan-list-portion-of-downtown-chicago-tower/",
      "https://therealdeal.com/chicago/2024/07/24/inside-sterling-bays-delays-on-lincoln-yards-marcey-street/",
      "https://therealdeal.com/chicago/2024/07/22/sterling-bay-selling-off-more-fulton-market-land/",
      "https://therealdeal.com/chicago/2024/11/20/sterling-bay-lands-chicagos-biggest-office-lease-this-year/",
      "https://therealdeal.com/chicago/2024/07/22/sterling-bay-selling-off-more-fulton-market-land/",
      "https://therealdeal.com/chicago/2025/01/10/sterling-bay-magellan-list-portion-of-downtown-chicago-tower/",
      "https://therealdeal.com/chicago/2025/01/15/sterling-bay-paves-new-path-for-lincoln-park-housing-towers/"
    ],
    "market": "Chicago",
    "published": "Thu, 13 Mar 2025 23:15:00 +0000",
    "published_dt": "2025-03-13T23:15:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/witkoffs-150-charles-sets-new-downtown-record/",
    "title": "A $60M deal at Witkoff’s 150 Charles sets a Downtown Manhattan record",
    "subhead": "Financier, interior designer couple trade condo for double 2016 purchase price",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-13T18:30:00",
    "content": "A financier’s West Village condo just set a new record for Downtown Manhattan.\nHarsh Padia, CEO of HAP Capital, and his wife, interior designer Purvi Padia, traded their apartment for $60 million in an off-market deal that closed Thursday, the\nWall Street Journal\nfirst reported. The sale price was double what the Padias paid for the apartment in 2016.\nThe deal is now the most expensive for a condo in the area, surpassing private equity billionaire Robert Smith’s\n$59 million\npurchase of a penthouse in the Getty Building in 2018.\nThough it’s the priciest for a condo on record, the deal fell short of the largest townhouse sales Downtown, including a\n$73 million\nmegamansion that closed in Greenwich Village last year.\nThe buyer, whose identity remains unknown, paid roughly $10,300 per square foot for the duplex, which also features a sprawling private terrace overlooking the Hudson River. The ninth-floor unit has five bedrooms, five bathrooms and a spiral staircase.\nSerhant’s Peter Zaitzeff and Compass’ Jim St. André represented the Padias in the deal. Compass’ Eric Brown and Zeve Salman brought the buyer.\n\nThe Witkoff Group’s 150 Charles has snagged several pricey resales in recent years. A company tied to Credit Suisse executive Robert Shafir sold a penthouse at the building for\n$52 million\n, or a whopping $11,500 per square foot, in 2023 after purchasing it for $29 million in 2016.\nThe developer launched sales at the building in 2013 and racked up an A-list roster of buyers, including Ben Stiller, Jon Bon Jovi and Irina Shayk. The building’s amenities include a spa, pool and fitness center.\nAlex Witkoff is now the sole CEO of Witkoff Group after his father, Steve Witkoff, was appointed special envoy to the Middle East by President Donald Trump. The elder Witkoff told Bloomberg this week he was in the\nprocess of divesting\nfrom his development firm and a cryptocurrency firm he co-founded with Alex and his other son, Zach Witkoff, to avoid conflicts of interest.\n—\nSheridan Wall\n",
    "related_links": [
      "https://www.wsj.com/real-estate/luxury-homes/condo-sets-downtown-manhattan-record-bdd264d0",
      "https://therealdeal.com/new-york/2018/05/03/robert-f-smith-revealed-as-buyer-of-59m-getty-penthouse/",
      "https://therealdeal.com/new-york/2024/01/30/greenwich-village-townhouse-sells-for-downtown-record-73m/",
      "https://therealdeal.com/new-york/2023/07/11/penthouse-in-witkoffs-150-charles-sells-for-11k-psf/",
      "https://therealdeal.com/national/2025/03/13/steve-witkoff-divesting-from-eponymous-real-estate-firm/",
      "https://therealdeal.com/new-york/2024/01/30/greenwich-village-townhouse-sells-for-downtown-record-73m/",
      "https://therealdeal.com/new-york/2023/07/11/penthouse-in-witkoffs-150-charles-sells-for-11k-psf/",
      "https://therealdeal.com/new-york/2024/10/08/owners-at-witkoffs-150-charles-oppose-500k-parking-spots/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-13T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/13/lender-nabs-83k-sf-k-town-retail-center-in-half-off-sale/",
    "title": "Lender nabs 83K sf K-town retail center in half-off sale",
    "subhead": "Columbia Pacific buys California Market at auction after landlord Jake Sharp Capital defaults on $52.5M mortgage loan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-13T18:30:00",
    "content": "A lender has purchased an 83,000-square-foot Koreatown shopping center at a bankruptcy auction after landlord Jake Sharp Capital defaulted on a $52.5 million mortgage loan.\nThe lender, an affiliate of Seattle-based Columbia Pacific Advisors, paid $29.2 million for the three-story California Market at 450 South Western Avenue,\nCommercial Observer reported\n.\nThe purchase works out to $352 per square foot.\nThe shopping center, built in 1987 to contain the California Market, became the first Korean supermarket in the state. It’s best known as a symbol of the 1992 Los Angeles riots, when the market owner and his tenants threw up barricades against looters, while\ndefending it with guns\n.\nJake Sharp, based in Hollywood, bought the plaza in 2020 at a bankruptcy auction for\n$57.5 million, or $693 per square foot.\nThe seller was Hyun Rhee, widow of the late supermarket chain founder Richard Rhee.\n\nBesides California Market, its two dozen tenants include restaurants Gaju Gimbop, Two Hands Seoul Fresh Corn Dogs and Thanks Pizza, as well as Etude W Salon and Guardian Computer Repairs.\nTo buy the shopping center at South Western and 5th Street, Jake Sharp Capital borrowed $52.5 million from Columbia. The firm defaulted on the loan in January, according to CO.\nJake Sharp Capital, founded in 2020, is run by Lafayette Sharp, who lives in Dana Point, according to state business records. It appears to be affiliated with the Jake Sharp Group, founded in 2011 by Jake Sharp, a commercial mortgage firm also based in Dana Point.\nIt’s not clear if Columbia plans to sell or hold on to the building. Representatives for Columbia didn’t immediately respond to CO’s request for comment, while Jake Sharp Capital could not be reached.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://commercialobserver.com/2025/03/la-koreatown-california-market-auction-columbia-pacific/",
      "https://www.kang.org/4-29-riots",
      "https://therealdeal.com/la/2020/12/16/california-market-in-koreatown-sells-for-58m-at-bankruptcy-auction/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2020/12/16/california-market-in-koreatown-sells-for-58m-at-bankruptcy-auction/",
      "https://therealdeal.com/la/2025/03/12/jamison-scores-50m-refi-for-koreatown-apartment-complex/",
      "https://therealdeal.com/la/2024/11/20/hankey-overcomes-appeal-against-koreatown-apartment-highrise/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-13T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/13/chicago-tax-assessor-pushes-feds-to-release-appraisal-data/",
    "title": "Kaegi leans on Pulte to help improve property tax accuracy",
    "subhead": "Fannie Mae, Freddie Mac appraisal data is kept from local tax authorities, but the Cook County Assessor wants to change that",
    "authors": "ByKelli Duncan",
    "pub_date": "Mar 13, 2025, 6:27 PM",
    "pub_date_dt": "2025-03-13T18:27:00",
    "content": "Cook County Assessor Fritz Kaegi is pushing the federal government to release property appraisal data to the country’s largest assessors to help improve the accuracy of property tax assessments, which have received criticism locally for being systemically flawed.\nA resolution sponsored by Kaegi calls for the Federal Housing Finance Agency to hand data containing “millions of property appraisals” over to 16 of the nation’s largest assessment offices, according to a news release.\nThe assessor made the request just a day before the Senate on Thursday confirmed President Trump’s nominee\nBill Pulte as head of the FHFA\n, which collects appraisal records from Fannie Mae and Freddie Mac. Pulte’s stance on Kaegi’s idea is unclear; Pulte is the grandson of the late William Pulte, who started one of the nation’s largest homebuilders, Pulte Homes, in Detroit in the 1950s.\nThe Federal Housing Finance Agency compiles Fannie and Freddie appraisals into a Uniform Appraisal Dataset that contains parcel-level property characteristics. Most of this data is inaccessible to government assessors, but Kaegi and 15 other assessment offices across the country are hoping to change that.\nThe Kaegi-backed proposal’s supporters said it would aid in addressing a common problem encountered by Cook County homeowners: Less expensive homes tend to be overvalued for taxes relative to their actual sale price, while pricier homes tend to be undervalued for taxes in an issue known as “regressivity.”\n\nThis means that working class and low income families end up paying more than their fair share in property taxes or can’t pay at all, putting a strain on the local municipality that relies on property tax revenue to fund public services. This has been\nparticularly true for small towns in the South suburbs of Chicago\nthat have a higher concentration of working class homeowners hit with overvaluations.\n“In recent years, we’ve eliminated a large portion of the regressivity in Cook County’s residential assessments,” Kaegi said in the release. “With the release of this data, we would be able to clear one of the final hurdles to achieving thoroughly fair and accurate assessments.”\nA 2022 University of Chicago\nstudy cited the main causes of regressivity as “limitations in the data and methods used in assessment,” specifically a lack of data about property characteristics that might factor into calculating a property’s assessed value. A study by Josh Myers Valuation Solutions also attributed\nthe undervaluation of commercial properties\n, in part, to “lack of data-sharing.”\nThe resolution got a boost from the National Association of Counties’ Board of Directors, which endorsed the measure in a March 1 annual legislative conference, according to the release. Kaegi’s co-sponsor on the bill is Eddie Cook, the assessor of Maricopa County, Arizona, which includes the city of Phoenix.\n",
    "related_links": [
      "https://therealdeal.com/national/2025/01/17/trump-taps-bill-pulte-to-lead-federal-housing-finance-agency/",
      "https://therealdeal.com/chicago/2024/10/04/chicagos-south-suburbs-pay-higher-property-tax-rates/",
      "https://law.yale.edu/sites/default/files/area/center/corporate/spring2022_paper_berrychristopher_2-24-22.pdf?utm_medium=email&utm_source=govdelivery",
      "https://therealdeal.com/chicago/2024/12/13/systemic-flaws-revealed-in-cook-county-commercial-property-taxes/",
      "https://therealdeal.com/chicago/2024/12/13/systemic-flaws-revealed-in-cook-county-commercial-property-taxes/",
      "https://therealdeal.com/chicago/2024/10/04/chicagos-south-suburbs-pay-higher-property-tax-rates/"
    ],
    "market": "Chicago",
    "published": "Thu, 13 Mar 2025 22:27:31 +0000",
    "published_dt": "2025-03-13T22:27:31+00:00",
    "author": "Kelli Duncan"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/steiner-takes-sole-ownership-of-dobro-rental-tower/",
    "title": "Steiner takes over DoBro rental tower the Hub",
    "subhead": "Doug Steiner’s firm buys out JP Morgan fund in $420M deal",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:57 PM",
    "pub_date_dt": "2025-03-13T17:57:00",
    "content": "Steiner NYC has taken back sole ownership of\nthe Hub\n, its 55-story Downtown Brooklyn rental tower.\nThe developer bought out partner JP Morgan in a $420 million recapitalization of the 750-unit mixed-use building at 333 Schermerhorn Street,\nCrain’s\nreported. Steiner sold a 62 percent stake worth $253 million to a JP Morgan real estate equity fund in 2019.\nThe owners also had considered selling the property, according to Crain’s. But ultimately, chairman\nDoug Steiner\nsaid holding on to the property “made the most sense for us.”\nA JLL team including Rob Hinckley and Jeffrey Julien represented the sellers in the deal. A Walker &amp; Dunlop team including Aaron Appel and Jonathan Schwartz advised Steiner and arranged $62.5 of preferred equity from investment firm Meadow Partners.\n\nSteiner purchased the site in 2011 for $23.5 million and construction was completed in 2017. The tower includes 150 affordable units and street-level retail on Schermerhorn Street, Livingston Street, and Flatbush Avenue. The development also has a 75-foot indoor/outdoor pool.\nRents for the eight available apartments range from $3,480 for a studio to $5,437 for a one-bedroom, according to Crain’s.\nThe 2019 sale of the stake to JP Morgan coincided with a $330 million refinancing of the property from Nuveen Real Estate.\n– Elizabeth Cryan\n",
    "related_links": [
      "https://therealdeal.com/new-york/2019/03/22/steiner-sells-majority-stake-in-dobro-rental-tower-to-jpmorgan-fund/",
      "https://www.crainsnewyork.com/real-estate/steiner-buys-out-jpmorgans-stake-downtown-brooklyn-skyscraper",
      "https://therealdeal.com/new-york/2020/08/24/doug-steiner-talks-steiner-studios-brooklyn-expansion/",
      "https://therealdeal.com/new-york/2019/03/22/steiner-sells-majority-stake-in-dobro-rental-tower-to-jpmorgan-fund/",
      "https://therealdeal.com/new-york/2018/01/18/these-were-the-10-largest-nyc-developments-to-open-in-2017/",
      "https://therealdeal.com/new-york/2020/08/24/doug-steiner-talks-steiner-studios-brooklyn-expansion/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 21:57:22 +0000",
    "published_dt": "2025-03-13T21:57:22+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/nashville/2025/03/13/developers-rebrand-nashvilles-east-bank/",
    "title": "Developers rebrand East Bank with billions in pipeline",
    "subhead": "Newly designated River District includes Oracle’s 70-acre corporate campus",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:53 PM",
    "pub_date_dt": "2025-03-13T17:53:00",
    "content": "A group of Nashville developers is looking to reshape the city’s riverfront with a new name and a bold vision.\nRebranded the River District on the East Bank, the area spans 750 acres along the Cumberland River in northwest Nashville, where nearly 25 developments are already in the pipeline, the Nashville Business Journal\nreported\n.\nThe River District is being pushed by CET Holdings, E3 Construction Services and Red Seal Homes, each of which has active projects in the area. CET Holdings is behind the Horizon mixed-use development and Bentley Ridge townhome communities, while Red Seal is advancing its Proximity and SkyVue residential projects. E3 Construction holds the largest land portfolio and is planning four residential projects within the district.\nThe rebranding comes as Texas-based Ewing Properties’\nrecent $200 million listing for The Riverside\n, a 65-acre waterside site slated for a massive $2.5 billion development. Three public parks and 5 million square feet of residential, office and retail space are in the plans. Rob Lowe of Stream Realty is marketing the property.\n\nThe River District lies a few miles from major developments along West Trinity Lane, including the under-construction Titans stadium and Oracle’s planned tech hub and headquarters on the East Bank, set to connect to New City Properties’\nmixed-use redevelopment\nof the Neuhoff meat-packing plant.\nAlso in the East Bank, Carl Icahn’s firm is selling a 45-acre former scrapyard for $225 million. A local investment group led by veteran investors J. David Byerley and Sam Lingo are acquiring the property at a price well above its previous $25 million book value. The investment group initially\ntargeted $350 million\nin fundraising for the acquisition.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/nashville/news/2025/03/12/river-district-nashville-property-development-name.html",
      "https://therealdeal.com/national/nashville/2025/02/26/ewing-properties-lists-nashville-acreage-at-2500-markup/",
      "https://therealdeal.com/national/nashville/2025/03/06/germantown-neuhoff-redevelopments-next-phase-revealed/",
      "https://therealdeal.com/national/nashville/2025/02/05/investors-raising-funds-to-buy-carl-icahns-nashville-scrapyard/",
      "https://therealdeal.com/national/nashville/2025/03/06/germantown-neuhoff-redevelopments-next-phase-revealed/",
      "https://therealdeal.com/national/nashville/2025/02/26/ewing-properties-lists-nashville-acreage-at-2500-markup/",
      "https://therealdeal.com/national/nashville/2025/03/03/carl-icahn-selling-nashville-scarpyard-for-225-million/"
    ],
    "market": "National",
    "published": "Thu, 13 Mar 2025 21:53:06 +0000",
    "published_dt": "2025-03-13T21:53:06+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/arbor-realty-trust-closes-1b-in-financing/",
    "title": "Arbor secures $1.1B refi from JPMorgan to pay off CLO bondholders",
    "subhead": "Lender secures a repo line amid recent struggles with delinquencies",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 13, 2025, 5:37 PM",
    "pub_date_dt": "2025-03-13T17:37:00",
    "content": "Arbor Realty Trust secured a $1.15 billion refinancing from JPMorgan that will go toward paying off its Collateralized Loan Obligation bondholders.\nThe lender said the funds from JPMorgan will be used to redeem the bondholders of two large CLOs. The bondholders will be paid in full, the company said in a release.\nJPMorgan is providing the refinancing as a repurchase line, also known as repo line, in which Arbor will use the proceeds to pay off its CLO bondholders. The refinancing also gives Arbor about $80 million in additional liquidity.\nThe news is a positive sign for Arbor. The lender has struggled with loan\ndelinquencies\nand announced it will cut\ndividends\nin its last earnings. Last year, Bloomberg reported that Arbor faced a probe from the FBI and the Department of Justice. Arbor has become the subject of\nshort-seller\nreports, which claim Arbor’s loans are distressed.\nMuch of the scrutiny about Arbor relates to its CLOs. The lender originates loans to multifamily owners and then securitizes them into something called a collateralized loan obligation, or CLO.\nThe Federal Reserve’s decision to raise interest rates put strain on some of Arbor’s multifamily borrowers, who were stuck with floating rating loans, and led to an uptick in delinquencies and foreclosures. Arbor then had to\nmodify\nmany of these loans by pushing out maturity dates and providing temporary rate relief.\n\nBut any broader concerns about Arbor’s loan book did not deter JPMorgan from extending a massive repurchase line to Arbor. The deal is unusually structured, allowing Arbor to essentially refinance its debt at a lower rate and even take home some additional proceeds.\nIn exchange for the financing, Arbor transferred $1.4 billion of assets into a repurchase facility, of which $1.3 billion consisted of assets in two of its CLOs. The line is mostly non-recourse, according to Arbor.\nThe two CLOs Arbor intends to unwind have a leverage point of about 77 percent with pricing of SOFR plus 2.24 percent. The repurchase facility offers an 80 percent leverage and has a lower rate than the CLOS, according to Arbor. The lender did not disclose the exact rate.\n“This is an incredibly innovative transaction that creates tremendous efficiencies for us going forward,” Ivan Kaufman, Arbor’s CEO, said in a statement. “This result also continues to reinforce the quality of our loan book and the depth of our banking relationships.”\n",
    "related_links": [
      "https://therealdeal.com/national/2024/11/01/arbor-realty-trust-reports-more-foreclosures-slowing-loan-modifications/",
      "https://therealdeal.com/national/2025/02/21/arbor-realty-trust-reports-33-drop-in-earnings-projects-dividend-cut/",
      "https://therealdeal.com/national/2024/07/15/why-arbor-realty-trust-says-says-it-did-not-commit-fraud/",
      "https://therealdeal.com/national/2024/05/06/arbor-realty-trust-provides-workouts-on-1-9-billion-in-loan/",
      "https://therealdeal.com/national/2024/08/06/arbor-realty-trust-sued-by-investor-alleging-securities-fraud/",
      "https://therealdeal.com/national/2024/11/01/arbor-realty-trust-reports-more-foreclosures-slowing-loan-modifications/",
      "https://therealdeal.com/national/2025/02/21/arbor-realty-trust-reports-33-drop-in-earnings-projects-dividend-cut/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 21:37:45 +0000",
    "published_dt": "2025-03-13T21:37:45+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/13/beacon-capital-partners-lists-indebted-chicago-office-tower/",
    "title": "Beacon lists debt-burdened Loop office tower that’s losing tenants",
    "subhead": "Landlord has invested $14M in upgrades to attract leases",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-13T17:30:00",
    "content": "A LaSalle Street tower is hitting the market, but Chicago’s office market isn’t exactly dealing strong hands.\nBeacon Capital Partners listed its 40-story office tower at 190 South LaSalle Street at a challenging moment for Chicago’s office sector, Crain’s\nreported\n.\nThe property, known as the U.S. Bank Building, is facing potential tenant losses and mounting financial pressure. The price wasn’t disclosed.\nBeacon acquired the nearly 800,000-square-foot tower in late 2019 for $230 million ($288 per square foot) and is selling at a time when Loop office buildings are trading at significant discounts. A $167.5 million mortgage ($209 per square foot) from U.S. Bank also weighs it down — a balance that now likely exceeds the property’s market value amid rising vacancies and declining demand.\nTwo of the building’s largest tenants, Neuberger Berman and Bain &amp; Company, are expected to exit by 2027 and 2028, respectively.\nThe looming vacancies add to the building’s uncertainty despite its anchor tenant U.S. Bank’s signing through 2030. The weighted average lease term across tenants is just over four years, according to marketing materials.\n\nThe sale offer comes after Beacon’s\nloss on 303 East Wacker Drive\n, which sold in December for about $63 million, a steep drop from the $182 million Beacon paid in 2018. Another blow came with a foreclosure lawsuit at 330 North Wabash Avenue, where Beacon faces claims over a $372 million loan after its appraisal\ndropped 62 percent last month\nfrom issuance four years ago.\nBeacon recently invested $13.7 million in renovating 190 South LaSalle, upgrading the lobby, fitness center and conference spaces in hopes of attracting tenants.\nThe building, developed in 1987 and designed by Philip Johnson, is one of the few LaSalle Street properties to undergo significant recent updates. That list includes 135 South LaSalle Street, for which the city doled out $98 million in TIF subsidies to Riverside Investment &amp; Development, DL3 Realty and AmTrust RE to convert vacant office space into 386 residential units\nlast fall\n.\nSeveral nearby towers have fallen into foreclosure, like New York-based landlord Feil Organization’s 10 South LaSalle Street. Feil was\nhit with a foreclosure suit\nby Wilmington Trust in January over contractors’ unpaid mechanics liens.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/190-s-lasalle-hits-market-bad-time-office-real-estate",
      "https://therealdeal.com/chicago/2024/08/23/beacon-capital-lists-downtown-chicago-office-tower/",
      "https://therealdeal.com/chicago/2025/02/21/appraisal-drops-62-on-beacon-capitals-chicago-office-tower/",
      "https://therealdeal.com/chicago/2024/11/08/chicagos-office-to-residential-subsidy-backs-another-conversion/",
      "https://therealdeal.com/chicago/2025/01/13/rialto-files-lasalle-street-foreclosure-against-feil/",
      "https://therealdeal.com/chicago/2025/01/13/rialto-files-lasalle-street-foreclosure-against-feil/",
      "https://therealdeal.com/chicago/2025/03/12/investor-pitches-conversion-for-chicagos-pittsfield-building/",
      "https://therealdeal.com/chicago/2025/02/24/musk-trump-ditching-two-chicago-government-office-buildings/"
    ],
    "market": "Chicago",
    "published": "Thu, 13 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-13T21:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/claudine-de-niro-moves-tribeca-condo-for-a-premium/",
    "title": "Claudine De Niro sells Tribeca condo asking $8M",
    "subhead": "Buyer is owner of famed Marble House, the building’s triplex maisonette",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 13, 2025, 5:12 PM",
    "pub_date_dt": "2025-03-13T17:12:00",
    "content": "It’s been a good week to be the ex-wife of a De Niro.\nClaudine De Niro, the ex-wife of Raphael, has entered into contract on her Tribeca condo asking $8 million, according to StreetEasy.\nThat deal came just days after Grace Hightower, the ex of Robert De Niro (Raphael’s father), sold her\nCentral Park West co-op for $18 million\n.\nUnlike Hightower, who sold her home for a loss, Claudine looks to have had a buy-low, sell-high strategy.\nRaphael bought the home, unit 2B at 60 Collister Street, for $\n3.5 million in 2012\n; in 2020, Claudine received ownership shares worth over $1 million, according to public records.\nIn 2023, Claudine, who is an agent at Compass, listed the home with an asking price of $7.8 million.\nCasa Blanca’s Hannah Bomze took over the listing with its new, higher price, earlier this year. Bomze declined to comment on the deal.\n\nThe nearly 4,000-square-foot apartment leans into its Downtown-loft features, with exposed wood beam ceilings and white brick walls, and a great room spanning over 1,000 square feet.\nThe home has four bedrooms; the primary suite comes with a walk-in closet, tri-head steam shower, heated floors and large tub. Two other bedrooms come with en-suite bathrooms.\nThe condo has tenants in place through the end of July.\nThe buyers are the owners of the building’s most well-known unit, a triplex maisonette known as the “Marble House,” according to a source familiar with the transaction. The unit’s owners, who bought the 80-foot-wide home for over $17 million in 2022, will likely combine the two units.\nThe Marble House comes with its own 45-foot-long pool, along with a sauna and steam room — and of course, lots of marble. The home, designed by former owner and “8 Mile” producer Stuart Parr, features four different types of imported marble across its 9,200 square feet.\nClaudine and Raphael founded the De Niro Team at Douglas Elliman in 2004, and in 2010\nappeared eighth\non\nThe Real Deal’s\nlist of top brokers in the city.\nThe pair separated in 2015 before finalizing their divorce in 2020. Claudine joined Compass shortly thereafter, where she works across Miami and New York City, according to her personal website.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/10/grace-hightower-robert-de-niros-ex-wife-sells-co-op-for-18m/",
      "https://therealdeal.com/new-york/2012/07/24/raphael-de-niro-pays-3-5m-for-loft-at-60-collister/",
      "https://therealdeal.com/magazine/new-york-june-2010/the-top-brokers/",
      "https://therealdeal.com/new-york/2014/05/05/tribeca-marble-mansion-asks-18-95-million/",
      "https://therealdeal.com/new-york/2012/07/24/raphael-de-niro-pays-3-5m-for-loft-at-60-collister/",
      "https://therealdeal.com/new-york/2025/03/10/grace-hightower-robert-de-niros-ex-wife-sells-co-op-for-18m/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 21:12:15 +0000",
    "published_dt": "2025-03-13T21:12:15+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/brickell-commercial-condo-owner-files-for-bankruptcy/",
    "title": "More South Florida distress: Brickell commercial condo owner’s bankruptcy filing delays foreclosure sale",
    "subhead": "Venezuelan ex-banker Eligio Cedeño’s entity allegedly defaulted on two loans totaling $13M",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 13, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-13T17:00:00",
    "content": "A disgraced Venezuelan ex-banker identified in the Panama Papers joins a growing number of South Florida commercial real estate owners feeling the pinch of distress.\nAn entity managed by Eligio Cedeño in Coral Gables filed for Chapter 11 reorganization in Miami federal bankruptcy court on Saturday, two days before its four commercial units at\nBrickell House\ncondominium at 1300 Brickell Bay Drive were scheduled to be sold at a foreclosure auction.\nCedeño’s entity, Ectul Holdings, listed $19 million in assets and $13.3 million in debts, the bankruptcy petition shows. Ectul’s largest creditor is Fort Lauderdale-based Fuse 10, which won a $7.5 million final judgment against the entity in January, Miami-Dade court records show.\nEctul’s bankruptcy attorney Diego Mendez did not respond to a request for comment.\nIn October of last year, Fuse 10 filed a foreclosure complaint against Ectul alleging that the borrower defaulted on a $6 million loan issued in 2023, by missing two monthly interest payments and a payment to its real estate taxes and insurance account that year. Ectul entered into a forbearance agreement that expired in February of last year, the lawsuit alleges. Cedeño’s entity paid $7.5 million for the three commercial units in 2021, records show.\nEctul’s second largest creditor is North Miami Beach-based Blue Waves Investment, which also has a pending\nforeclosure\ncomplaint against the entity. The lawsuit alleges Ectul defaulted on a $5 million loan secured by a Brickell House penthouse also owned by the Cedeño entity. In 2023, Ectul paid $5.2 million for the 3,860-square-foot unit at 1300 Brickell Bay Drive in Miami, records show.\n\nThe sale of the commercial units and the penthouse foreclosure complaint are stayed as a result of the bankruptcy filing.\nCedeño was among a half-dozen Venezuelan banking executives identified in the 2016\nPanama Papers\nas controlling secret offshore accounts, published reports state. Nearly a decade earlier, in 2007, Cedeño was arrested and detained in Venezuela for allegedly breaking the country’s currency laws and allegedly engaging in illegal transactions to obtain U.S. dollars.\nHe was released two years later and fled to the U.S. In 2011, the U.S. government granted Cedeño asylum, according to published reports.\nAcross South Florida, commercial property owners are catching the brunt of market headwinds. This month, a lender slapped Don King with a foreclosure complaint that alleges the legendary boxing promoter defaulted on a\n$5 million\nmortgage secured by a Deerfield Beach warehouse he owns.\nBrooklyn-based investor and Holocaust survivor Zipporah Goldstein is also feeling a lender’s heat. Recently, Troy, Michigan-based Flagstar Bank filed a foreclosure complaint in Miami-Dade County against Goldstein’s entity that owns nine ground-floor commercial units inside a three-story Art Deco building in Miami Beach. Flagstar alleges Goldstein and her entity defaulted on a\n$5.5 million\nloan.\nLast month, a partnership among Miami-based builder Marlon Gomez and Coral Gables-based developers Fausto Callava and Antonio Pardo was hit with a foreclosure complaint alleging the joint venture defaulted on a\n$10 million\nloan secured by a 1.8-acre Miami River development site.",
    "related_links": [
      "https://therealdeal.com/miami/2019/03/25/brickell-house-condo-owners-reach-32m-settlement-over-failed-robotic-parking/",
      "https://therealdeal.com/tag/foreclosures/",
      "https://therealdeal.com/tag/panama-papers/",
      "https://therealdeal.com/miami/2025/03/11/don-king-slapped-with-5m-foreclosure-lawsuit/",
      "https://therealdeal.com/miami/2025/03/12/flagstar-bank-targets-south-beach-store-in-foreclosure/",
      "https://therealdeal.com/miami/2025/03/04/gomez-development-avenue-4s-miami-river-site-in-foreclosure/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-13T21:00:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/fivepoint-hunters-point-settlement-offer-is-paltry-judge/",
    "title": "Judge kicks FivePoint settlement offer for Hunters Point as “paltry”",
    "subhead": "Deal would allow developers to skirt $1B lawsuit by “paying nickels”",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-13T17:00:00",
    "content": "A proposed legal settlement over the botched environmental cleanup of Hunters Point Shipyard would leave thousands of affected residents with just $606 per person.\nA federal judge denied the agreement between developers FivePoint Holdings and Lennar and lawyers behind the $1 billion lawsuit — calling it a “sweetheart deal” for the builders and the “worst settlement” he’s ever seen, the\nSan Francisco Chronicle reported.\nIn a scathing order, U.S. District Judge James Donato called the proposed payout to 6,500 residents of Hunters Point “paltry,” and accused the plaintiff’s lawyers of selling out their clients.\n“No question that the proposed terms are unfair to the class members,” he said during a January hearing.\nResidents of Hunters Point filed a lawsuit in 2018 alleging they were the victims of fraud and had suffered health defects in connection with the former shipyard’s ongoing toxic cleanup.\nIn the latest attempt by Irvine-based FivePoint and Miami-based Lennar to settle, the developers and Sausalito law firm Bonner &amp; Bonner had asked the court to approve a $5.4 million deal.\nBut with $1.4 million for attorney fees and $4 million in community payouts, it worked out to $606 per person. A settlement proposal in 2022 for 9,000 residents, also rejected by the judge, would have worked out to $400 per person.\nDonato accused the residents’ attorneys, Charles and Cabral Bonner, of colluding against Tetra Tech EC, a third defendant in the lawsuit but left out of the settlement talks. The unit of Tetra Tech was hired two decades ago to\nclean hazardous radiation and toxic substances\nfrom the shipyard once owned by the U.S. Navy.\nThe developers and the Bonners had entered into a “common interest agreement,” which allows parties with shared legal interests to share information in order to collaborate on defense strategies. But the judge said the residents and developers are “adverse parties” who cut a deal to target Tetra Tech EC.\nSuch a settlement “becomes collusive when it is aimed to injure the interests” of an absent defendant, Donato said.\n\nThe Bonners have denied wrongdoing, saying they acted in the best interest of their clients by collaborating with the developers. Lennar declined to comment to the Chronicle, while FivePoint didn’t respond to a request for comment.\nSam Singer, a spokesperson for Pasadena-based Tetra Tech EC said: “The judge’s order speaks for itself.”\nAfter signing the common interest agreement, the Bonners amended the residents’ complaint for the sixth time. The changes “drastically narrowed plaintiff’s claims against the home builder defendants, dropped the class allegations against them, and deleted the damages demand of $1 billion,” Donato wrote in his order.\n“The evidence of collusion is striking,” Donato wrote. During the hearing, he questioned why the developers should be allowed to exit a $1 billion lawsuit in exchange for “paying nickels.”\nFivePoint, a spinoff of Lennar, has entitlements for thousands of homes and millions of square feet of commercial space at Hunter’s Point.\nA trial date for the case is set for next year, but the Bonners said they are talking with the developers about another settlement deal, and\nreached out to Tetra Tech EC\nto “see if they are interested in negotiating.”\nTetra Tech EC has faced\nmultiple ongoing lawsuits\nrelated to the cleanup of the 500-acre shipyard site, including a lawsuit filed by the developers in 2020. This year, the U.S. Department of Justice agreed to settle a lawsuit brought against the contractor a decade ago, originally by whistleblowers, for\n$97 million\n, according to the Chronicle.\nThe Navy previously said in other court filings that the “negative fiscal impact” of the fraud at the shipyard is between\n$370 million and $570 million\n.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/sf/article/hunters-point-shipyard-settlement-20206846.php",
      "https://www.sfchronicle.com/realestate/article/sf-shipyard-waterfront-neighborhood-18532802.php",
      "https://bayviewlawsuit.com/february-lennar-settlement-update/",
      "https://www.courthousenews.com/cops-tell-ninth-circuit-to-revive-hunters-point-radioactive-contamination-case/",
      "https://www.sfchronicle.com/bayarea/article/sf-hunters-point-shipyard-20044068.php",
      "https://www.sfchronicle.com/bayarea/article/U-S-sues-Tetra-Tech-over-Hunters-Point-shipyard-13536013.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/08/02/radioactivity-moves-back-cleanup-deadline-at-hunters-point/",
      "https://therealdeal.com/san-francisco/2024/09/09/fivepoint-reworks-candlestick-hunters-point-projects-in-sf/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-13T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/seattle/2025/03/13/su-plans-architectural-expression-of-bellevues-evolution/",
    "title": "Su Development plans “architectural expression of Bellevue’s evolution”",
    "subhead": "23-story apartment options cash in on challenge to Seattle by waterfront suburb",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-13T17:00:00",
    "content": "A flight to quality by Seattle office tenants could be a boon for Su Development, which plans to build a 23-story apartment tower in Bellevue — now a suburban challenge to the Emerald City.\nThe locally based developer has filed revised plans for a high-rise at 205 105th Ave NE, the\nPuget Sound Business Journal\nand\nDowntown Bellevue Network\nreported. It would replace a shuttered sushi restaurant.\nThe building, dubbed 205 Tower, would contain one of two options — either a 260-foot-tall building with 164 units and 5,000 square feet of shops and restaurants, or a 308-foot building with 173 apartments, with similar retail.\nThe project, designed by locally based MZA, is “an architectural expression of Bellevue’s evolution,” according to the project narrative.\nThat evolution, across Lake Washington from Seattle, includes a growing tech hub that’s now home to eBay, Meta, ByteDance, Oracle, Salesforce, Google, Microsoft and a\nmajor Amazon campus\n.\nSeattle-based\nAmazon.com\nhas 14,000 employees in Bellevue and plans to\nadd 11,000 more\nin the coming years, with downtown poised for more multifamily projects like 205 Tower, according to the Business Journal.\nSu, a vertically integrated design-build firm, is known for its architecturally dazzling projects, including a\ntwo-tower development at Yesler Terrace in Seattle\nand Soma Towers in Bellevue.\n\nIts latest project seeks to capitalize on its location along the Grand Connection, a series of projects designed to uplift the pedestrian experience between Meydenbauer Bay Park through Downtown, and across Interstate 405 to an Eastrail multi-use path.\nThe proposed glass towers at Northeast Second Street and 105th Avenue Northeast contain a sculpted crown atop a five-story podium, with exterior balconies jutting from floor-to-ceiling windows, according to renderings.\nThe first concept draws on the interaction between water and land, highlighting the contrast between Bellevue’s urban landscape and an adjoining park, according to dbNetwork. The second is based on Pacific Northwest stone outcroppings, with a prominent vertical element.\nSu’s project “directly engages” with the Grand Connection with a public plaza along Northeast Second Street, with “retail frontages, seating areas and landscaping to create a dynamic, human-scaled environment,” according to a project filing.\nZoe Wang, project architect for Su, said the company wants to break ground by the end of next year.\nSu, founded in 1981 by John Su, built Downtown Bellevue’s first concrete-and-steel condominium building, and has developed more than 2,400 apartments, according to the Business Journal.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/seattle/news/2025/03/11/su-plans-multifamily-tower-bellevue.html",
      "https://downtownbellevue.com/2025/03/12/high-rise-proposed-former-sushi-maru-bellevue/",
      "https://therealdeal.com/national/seattle/2024/11/08/amazon-com-exits-office-in-seattle-in-shift-to-bellevue/",
      "https://www.bizjournals.com/seattle/organization/amazon",
      "https://therealdeal.com/national/seattle/2024/11/08/amazon-com-exits-office-in-seattle-in-shift-to-bellevue/",
      "https://www.bizjournals.com/seattle/news/2020/11/23/su-development-plans-two-tower-project-in-seattle.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/seattle/2025/03/06/amazon-commits-100m-for-affordable-housing-in-bellevue/",
      "https://therealdeal.com/national/seattle/2024/11/08/amazon-com-exits-office-in-seattle-in-shift-to-bellevue/",
      "https://therealdeal.com/national/seattle/2024/09/25/capstone-and-pgim-pivot-from-office-to-housing-in-bellevue/"
    ],
    "market": "National",
    "published": "Thu, 13 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-13T21:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/13/compass-in-talks-to-acquire-bhhs/",
    "title": "Compass in talks to buy Berkshire Hathaway HomeServices",
    "subhead": "Resi giant eyes second major acquisition in 12-month growth tear",
    "authors": "ByJake Indursky",
    "pub_date": "Mar 13, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-13T16:30:00",
    "content": "There is a new development in this story.\nCompass could be continuing its period of expansion with a massive growth spurt in the form of a deal to buy Berkshire Hathaway HomeServices.\nThe Wall Street Journal first\nreported\nthe residential giant was in talks for the country’s fourth-largest brokerage, according to RealTrends.\nTerms of the deal have not yet been reported.\nThe move would be a major step in what has become a 12-month period of rapid consolidation for\nCompass\n, the nation’s largest brokerage by deal volume.\nCompass sent shockwaves through the industry last year when it announced\nits $444 million deal\nto acquire Christie’s International Real Estate and @properties. @properties was the eighth-largest brokerage in the country before the acquisition, according to RealTrends. Robert Reffkin’s firm also scooped up local brokerages in Tennessee and the Gulf Coast last year.\nCompass’ deals for smaller firms and large teams have contributed to its headcount and private listings network. In the firm’s most recent earnings call, Reffkin said 7,500, or 35 percent of the company’s listings, were off-MLS. In February, more than half of new Compass listings started as private exclusives or were available only on Compass.com, which are part of the company’s latest\nconsumer marketing strategy\n.\n\nThe firm also notched its most successful financial year since going public in 2024,  with its share price more than doubling in the last 12 months as it reported its first cash-flow positive year.\nBHHS had 820 brokerage offices and 270 franchises at the end of 2024.\nThe real estate arm of Warren Buffett’s conglomerate entered the New York City market in 2017 but has had a difficult time gaining a foothold since then, ranking 18th in the\nTRD\n’s most recent brokerage rankings.\nElsewhere in the United States, BHHS Chicago boasts a roster of more than 1,300 real estate professionals.\nBerkshire Hathaway HomeServices acquired Ron Shuffield’s EWM Realty International in 2003. The Coral Gables, Florida-based firm, now called BHHS EWM, has more than 700 agents and employees across seven offices in South Florida.\nHomeServices made headlines last year when it\nagreed to pay $250 million\nto settle antitrust lawsuits accusing it of colluding with the National Association of Realtors and other major brokerages to hike agents’ pay. The settlement was the largest payout offered by the brokerage defendants, outpacing the $58 million deal reached by Compass.",
    "related_links": [
      "https://therealdeal.com/national/2025/03/14/compass-bhhs-deal-gino-blefari-denied/",
      "https://www.wsj.com/real-estate/compass-in-talks-to-buy-warren-buffetts-real-estate-brokerage-unit-5eab82e5",
      "https://therealdeal.com/company/compass/",
      "https://therealdeal.com/national/2024/12/02/compass-is-acquiring-properties-christies-real-estate/",
      "https://therealdeal.com/national/2025/02/06/how-compass-new-consumer-platform-adds-to-inventory-push/",
      "https://therealdeal.com/national/2024/04/26/homeservices-of-america-strikes-250m-settlement/"
    ],
    "market": "National",
    "published": "Thu, 13 Mar 2025 20:30:45 +0000",
    "published_dt": "2025-03-13T20:30:45+00:00",
    "author": "Jake Indursky"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/family-sells-waterfront-coral-gables-teardown-for-17m/",
    "title": "Family sells waterfront Gables Estates teardown for $17M",
    "subhead": "1.7-acre compound hit market for $21.5M last year",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 13, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-13T16:30:00",
    "content": "Family members sold their late parents’ waterfront teardown in Gables Estates for $17.3 million, a year after listing it for $21.5 million.\nRecords show Ricardo Pines Altuna, Gustavo Pines Altuna and Francisco Pines Altuna sold the mansion at 8805 Arvida Drive to Arvida Hilltopper LLC, a Florida entity managed by Ammer Cabrera.\nLourdes Alatriste with Douglas Elliman had the listing, and Dexter Brandao with Chez Realty brought the buyer.\nThe sellers are the sons of the late Ricardo Pines and Elba Altuna de Pines, Venezuelans who immigrated to Miami in 1980 and invested in real estate and agricultural businesses, according to their obituaries. They died in 2023 and 2024, respectively.\n\nThey bought the waterfront Gables Estates mansion for $1.4 million in 1982, property records show. It was built on 1.7 acres in 1959 and spans 10,200 square feet, with six bedrooms and six bathrooms, according to records. It was marketed as an opportunity to renovate or build a new home.\nThe family listed it for $21.5 million last year, selling it at a $4.2 million discount, according to Zillow.\nIt marks the latest pricey closing in\nGables Estates\n, a gated neighborhood favored by luxury buyers in Coral Gables. In August, Goya Foods scion Francisco R. Unanue sold a 1-acre waterfront lot to\nspec developer Alex Pirez for $18.5 million\n. In July, the CEO of a lending firm and a cosmetics mogul sold their mansion in the neighborhood for\n$27.5 million\n. The month prior, magnetics heir Geert-Jan Bakker\ndropped $23.5 million\non a mansion, after selling his Indian Creek Village estate for $64.5 million.",
    "related_links": [
      "https://therealdeal.com/tag/gables-estates/",
      "https://therealdeal.com/miami/2024/08/20/goya-foods-scion-sells-gables-estates-lot-for-19m/",
      "https://therealdeal.com/miami/2024/07/12/andre-hakkak-marissa-shipman-sell-gables-estates-mansion/",
      "https://therealdeal.com/miami/2024/06/28/magnetics-heir-downsizes-to-24m-coral-gables-mansion/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 20:30:32 +0000",
    "published_dt": "2025-03-13T20:30:32+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/ae-finally-takes-full-control-of-ues-rental-building/",
    "title": "A&E finally takes over Soloviev’s UES luxury rental building",
    "subhead": "$116M purchase of 179-unit Rivers Bend building comes after legal drama",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 4:11 PM",
    "pub_date_dt": "2025-03-13T16:11:00",
    "content": "More than two years after Douglas Eisenberg’s A&amp;E Real Estate originally agreed to purchase the majority of an Upper East Side rental building from the Soloviev Group, A&amp;E finally closed this week on the whole thing.\nA&amp;E paid $116.5 million to purchase the 179-unit Rivers Bend building at 501 East 87th Street, PincusCo\nreported\n. Stefan Soloviev’s sale price works out to $547,000 per unit.\n“We are pleased to complete this complex transaction, which required a collaborative approach by both parties over the past year,” Eisenberg said in a statement.\nThe “collaborative” appeared more combative at first.\nIn late 2023, Soloviev\nsued A&amp;E\n, alleging it tried to sell a majority stake of the building to Eisenberg’s firm, which would have then assumed the same stake in the $60.5 million of debt Soloviev had at the building.\nSoloviev claimed A&amp;E wrongly backed out of the sale — allegedly agreed to in February 2023 — and alleged the presence of asbestos; Soloviev claimed Eisenberg was trying to back out of the deal because he couldn’t finance the acquisition.\n\nThat sale was supposed to close in April 2023, only to be repeatedly pushed back. A day before the scheduled closing of the $121 million deal, A&amp;E allegedly terminated the deal, claiming it received no approval to assume its share of the debt and citing the asbestos as grounds for backing out.\nThat drama appears to be behind the two sides, as A&amp;E picked up a 100 percent interest in the property. It’s also assuming the $60 million Freddie Mac loan while financing the rest of the deal with its own equity, according to the\nCommercial Observer\n. A&amp;E plans to invest further in the property.\nThe 22-story luxury building, situated near Gracie Mansion, was developed by Soloviev founder Sheldon Solow in the 1960s. Today, the building includes a parking garage, a rooftop terrace with a glass-encased indoor swimming pool, a fitness center, wood-burning fireplaces and 24-hour doorman service.\nA&amp;E recently put the 413-unit Holland complex on the Upper West Side up for sale,\nThe Real Deal\nreported. The multifamily landlord is\nlooking for a price\naround $200 million, about a third less than the\n$287 million\nthe company paid seven years ago, reflecting how the 2019 rent laws are hindering the value of rent-regulated properties.\nA&amp;E is also\nfacing foreclosure\non a 3,500-unit spread across Harlem, Queens, Brooklyn and the Bronx. A spokesperson told\nTRD\nlast month that the company was in negotiations with its lenders and planned to resolve the issue within 45 days.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.pincusco.com/ae-pays-116-5m-to-soloviev-group-for-179-unit-rivers-bend-in-yorkville/",
      "https://therealdeal.com/new-york/2023/12/29/soloviev-ae-fight-over-yorkville-rental-building/",
      "https://commercialobserver.com/2025/03/ae-real-estate-buys-ues-apartment-building-soloviev-116m/",
      "https://therealdeal.com/new-york/2025/03/06/ae-real-estate-eyes-200m-for-upper-west-side-apartments/",
      "https://therealdeal.com/new-york/2018/04/02/ae-closes-on-287m-purchase-of-stonehenge-village/",
      "https://therealdeal.com/new-york/2025/02/04/ae-real-estate-faces-foreclosure-on-3500-unit-portfolio/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2023/12/29/soloviev-ae-fight-over-yorkville-rental-building/",
      "https://therealdeal.com/new-york/2025/03/06/ae-real-estate-eyes-200m-for-upper-west-side-apartments/",
      "https://therealdeal.com/new-york/2025/02/04/ae-real-estate-faces-foreclosure-on-3500-unit-portfolio/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 20:11:44 +0000",
    "published_dt": "2025-03-13T20:11:44+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/13/steve-witkoff-divesting-from-eponymous-real-estate-firm/",
    "title": "Steve Witkoff divesting from eponymous real estate firm",
    "subhead": "Trump’s Middle East envoy transferring holdings to sons",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:45 PM",
    "pub_date_dt": "2025-03-13T15:45:00",
    "content": "As Steve Witkoff dives deeper into the diplomatic world, he’s pulling back on his real estate ties.\nThe business man and President Donald Trump’s special envoy to the Middle East\ndisclosed to Bloomberg\nthat he’s in the process of divesting from the Witkoff Group and World Liberty Financial, the cryptocurrency platform co-founded by Alex and Zach Witkoff. Alex has already assumed day-to-day responsibilities of the development firm, which Steve founded almost 30 years ago.\nWhen Witkoff joined the administration, ethics questions quickly followed considering how much of his business can be tied to places all over the world. In divesting from his firm and crypto assets, Witkoff is hoping to be judged on his diplomatic results going forward.\n“How do you ensure you’re not using the special envoy role to skew policy your way?” Harold Hongju Koh, a former legal adviser to the State Department, told Bloomberg.\nWitkoff and Trump were already enmeshed, business-wise. Both of their families have stakes in World Liberty Financial. Witkoff was also an investor in Elon Musk’s Twitter takeover; Musk leads Trump’s Department of Government Efficiency today.\nNow Witkoff is following Trump’s lead by installing progeny atop a real estate company when entering the political fray, though ethics questions about Trump’s businesses continue to linger.\n\nFederal ethics law mandates senior Cabinet officials divest individual stock holdings and assets that could bring about conflict of interest concerns. Commerce Secretary Howard Lutnick is divesting his business interests, recently\nnaming one of his sons\nas the chair of Cantor Fitzgerald.\nWitkoff’s fortune is estimated to be around $782 million, according to the Bloomberg Billionaires Index, though one person familiar with his finances suggested it could be double that.\nWitkoff has been especially busy internationally during the first couple of months of Trump’s second administration, and even before then, despite his lack of diplomatic experience. He helped negotiate the fragile ceasefire between Israel and Hamas. He also\nmet with Russian president Vladimir Putin\nlast month and will soon do so again.\nIn some ways, he’s following in the footsteps laid out by Trump’s son-in-law, Jared Kushner. Ivanka Trump’s husband jumped from real estate to politics — negotiating the Abraham Accords — before jumping back into business. Kushner’s private equity firm, Affinity Partners, counts $4.6 billion in assets, essentially all\nfrom foreign investors\n.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bloomberg.com/news/articles/2025-03-12/who-is-steve-witkoff-trump-s-longtime-real-estate-friend-set-to-talk-with-putin",
      "https://therealdeal.com/new-york/2025/02/20/howard-lutnick-installs-sons-atop-cantor-fitzgerald/",
      "https://therealdeal.com/national/2025/02/24/steve-witkoff-boasts-meeting-with-putin-in-russia/",
      "https://therealdeal.com/new-york/2022/04/11/jared-kushner-raised-2b-from-saudi-prince-mbs/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2025/02/24/steve-witkoff-boasts-meeting-with-putin-in-russia/",
      "https://therealdeal.com/new-york/2025/02/20/howard-lutnick-installs-sons-atop-cantor-fitzgerald/",
      "https://therealdeal.com/new-york/2022/04/11/jared-kushner-raised-2b-from-saudi-prince-mbs/"
    ],
    "market": "National",
    "published": "Thu, 13 Mar 2025 19:45:00 +0000",
    "published_dt": "2025-03-13T19:45:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/tm-real-estate-nabs-construction-loan-for-boynton-rentals/",
    "title": "TM Real Estate scores $54M construction loan for 250-unit Boynton Beach complex, amid South Florida multifamily supply overhang",
    "subhead": "City commission approved project in 2022",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 13, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-13T15:30:00",
    "content": "A developer scored a $53.5 million construction loan for a 250-unit apartment complex in Boynton Beach, amid a multifamily supply overhang in South Florida.\nTM Real Estate Group plans the Shalimar at Boynton Beach project with 10 three-story and four-story buildings, a nearly 10,000-square-foot clubhouse and 4,300 square feet of retail in two additional buildings at 3570 West Boynton Beach Boulevard, according to a city commission meeting agenda from 2022, when the project was approved.\nCharlotte, North Carolina-based Truist Bank is the lender of the construction loan.\nTM Real Estate, based in Coconut Grove, paid $16 million for the 12.5-acre development site in 2021, records show.\nFounded in 2005, TM is a development, investment and management firm focused on South Florida multifamily and mixed-use properties, according to its website. Matthew Pellar is CEO of TM.\n\nIts portfolio includes the 240-unit Shalimar at Davie complex at 4901 Shalimar Lane in Davie, and the 240-unit Shalimar at Plantation West at 8500 Cleary Boulevard in Plantation.\nIn 2021, TM sold the Lincoln Square office complex consisting of a pair of five-story buildings at  18405 Northwest Second Avenue in Miami Gardens for\n$15.4 million\n.\nSouth Florida’s multifamily market has slowed compared to the boom years of 2021 and 2022 when the tri-county region experienced an influx of out-of-state residents and record rent hikes. After developers seized on the bonanza, they completed a record 18,600 units last year, outpacing 15,000 in new leases, according to CoStar Group data. This led to\nslower lease-ups and increased concessions\n. Median monthly rent hit $2,328 in January, down nearly 2 percent, year-over-year, according to Realtor.com.\nDemand could catch up to supply late this year or next year, partly due to a drop in construction starts, experts said.\nConstruction loans\nhave flowed, including for multifamily projects. Last month, White Oak Development scored\n$67 million\nto build a pair of four-story buildings with 286 apartments at 4181 and 4233 Davie Road in Davie. That came on the heels of the Caltagirone brothers’ Calta Group scoring a\n$53.7 million\nconstruction loan for 251 apartments in two Hollywood projects, at 2750 Van Buren Street, and at 2217-2239 Jackson Street.\n",
    "related_links": [
      "https://therealdeal.com/miami/2021/04/07/tm-real-estate-sells-miami-gardens-office-park-for-15m/",
      "https://therealdeal.com/miami/2025/01/24/after-record-south-florida-rental-completions-lease-ups-slow/",
      "https://therealdeal.com/tag/construction-loans/",
      "https://therealdeal.com/miami/2025/02/27/white-oak-ares-management-plan-davie-apartment-project/",
      "https://therealdeal.com/miami/2025/02/11/calta-group-nabs-construction-loan-for-hollywood-rentals/",
      "https://therealdeal.com/miami/2024/12/26/estate-nabs-construction-loan-for-davie-rentals-from-banesco/",
      "https://therealdeal.com/miami/2024/12/16/terra-lands-170m-loan-for-1b-upland-park-first-phase/",
      "https://therealdeal.com/miami/2024/11/19/jenny-bernells-clearline-nabs-construction-loans-for-rentals/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-13T19:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/texas/fort-worth/2025/03/13/conrad-suszynski-named-sole-ceo-of-crescent-real-estate/",
    "title": "Crescent names Conrad Suszynski sole CEO amid development push",
    "subhead": "Fort Worth-based firm promoted several people to executive positions",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:30 PM",
    "pub_date_dt": "2025-03-13T15:30:00",
    "content": "A Fort Worth power player made changes at the top.\nCrescent Real Estate named Conrad Suszynski as its sole CEO following the retirement of co-CEO Jason Anderson, the Dallas Business Journal\nreported\n.\nSuszynski steps into the role after almost 20 years at the company. He joined Crescent in 2006 when it operated as Goff Capital Partners before its conversion to Crescent Real Estate in 2016.\nThe firm has also promoted several internal leaders. These include Christopher Goff — Chairman John Goff’s son — to senior managing director, head of capital formation; Andrew Lombardi, who will remain CFO, to senior managing director; Noelle Garsek to managing director, general counsel; and Ben Molk to managing director, office. Joseph Pitchford, managing director of development, will join Crescent’s senior management committee.\nThe leadership shift comes as Crescent expands its footprint across North Texas. The firm manages $4.4 billion in assets and oversees about $225 million in development.\n\nCrescent is raising $250 million for its fourth GP Invitation Fund as it strengthens its development pipeline. The firm’s portfolio includes marquee assets like The Crescent in Uptown Dallas — a 1.3 million-square-foot property with office, retail and hotel components — and the Robert L. Crandall corporate campus for American Airlines in Fort Worth.\nIts development activity is also expanding. Crescent is advancing a\nsecond office tower in Fort Worth\n, constructing the 30-story, 215-unit\nCrescent Point Tower\nin Uptown Dallas and preparing to open a 31-story\nluxury apartment building\nat 2811 Maple in May, where rents start at $4,000 a month.\nIt recently started development on its 92-home\nhigh-end housing project in Horseshoe Bay\nnear Marble Falls, northwest of Austin. Groundwork and infrastructure at the 114-acre site is expected to be completed in March 2026.\nSuszynski said the company is deepening its focus on high-quality development, particularly in Uptown Dallas and Fort Worth, where Crescent is looking to cultivate environments that mirror the success of its flagship properties.\nThe leadership team has an average tenure of over 12 years, Suszynski said.\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/crescent-real-estate-promotes-new-ceo-leaders.html",
      "https://therealdeal.com/texas/fort-worth/2024/03/28/crescent-to-develop-another-office-building-in-fort-worth/",
      "https://therealdeal.com/texas/dallas/2024/04/01/crescent-real-estate-adding-resi-tower-to-uptown-dallas/",
      "https://www.wfaa.com/article/money/business/uptown-dallas-2811-maple-luxury-apartments/287-11fc9cf0-199c-4f3c-825e-92c9af05ff06",
      "https://therealdeal.com/texas/austin/2025/03/07/crescent-real-estate-targets-upscale-central-texas-homebuyers/",
      "https://therealdeal.com/texas/austin/2025/03/07/crescent-real-estate-targets-upscale-central-texas-homebuyers/",
      "https://therealdeal.com/texas/fort-worth/2024/03/28/crescent-to-develop-another-office-building-in-fort-worth/",
      "https://therealdeal.com/texas/2025/03/04/movers-landsea-names-stewart-parker-dfw-president/"
    ],
    "market": "Texas",
    "published": "Thu, 13 Mar 2025 19:30:00 +0000",
    "published_dt": "2025-03-13T19:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/extell-scores-debt-deals-on-tel-aviv-stock-exchange/",
    "title": "Extell scores two massive debt deals for Manhattan trophy properties",
    "subhead": "Developer lands $1.3B financing for “Torch,” $270M refi for Central Park Tower",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-13T15:00:00",
    "content": "Gary Barnett is getting a big assist on notable Manhattan developments from the Israeli markets.\nExtell Development scored or agreed to multiple financing deals solicited on the Tel Aviv Stock Exchange, Bisnow\nreported\n. A spokesperson for the company did not immediately respond to requests for comment on either debt deal.\nFirst, Extell entered into a memorandum of intent with an unnamed bank to provide as much as $1.3 billion in financing for The Torch, a supertall mixed-use hotel at 740 Eighth Avenue in Times Square. The financing would include a senior construction loan and mezzanine debt, according to a Feb. 25 filing with the exchange and translated through Google.\nExtell also signed a letter of intent with an unnamed hotel chain. The operator would invest in construction and provide a guarantee that could help Barnett secure another $150 million in mezzanine debt.\nWork is already underway on the 1,067-foot-tall hotel, which will span 875,000 square feet and include 825 rooms. The most notable — and\ncontroversial\n— feature is a 300-foot transparent tube that will contain a drop ride, which has already passed the Department of Buildings’ muster.\nConstruction is expected to take four and a half years.\nThe developer also attempted to raise roughly $299.4 million from TASE bondholders to refinance 18 unsold condominium units at Central Park Tower. Barnett didn’t hit that number, but came close\nwith a $270 million closing\n, according to an offering report translated with Google.\n\nThe collateral features a first lien on the 18 sponsor units at 217 West 57th Street. As of the end of last year, the units were valued at more than $557 million combined, according to an investor presentation.\nExtell previously landed a $500 million inventory loan from JPMorgan Chase and the Reuben Brothers in 2023, which was secured by 87 apartments.\nBarnett has been forced to accept discounted deals at the world’s tallest residential building. As of late December, 114 sponsor sales recorded in an analysis by\nThe Real Deal\nhave sold\nfor a combined $1.8 billion\n, 25 percent less than the $2.4 billion in total volume listing in the project’s original offering plan for those units.\nSales launched in 2018 for the building’s 178 units.\nIn case Barnett didn’t seem busy enough, Extell just\nsnapped up three buildings\nnext to his planned Madison Avenue residential tower from Sol Goldman’s Solil Management for $103 million.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bisnow.com/new-york/news/hotel/extell-arranges-nearly-13b-for-hotel-supertall-128460",
      "https://therealdeal.com/new-york/2023/06/27/extell-740-eighth-ave-project-with-thrill-ride-is-legal/",
      "https://www.bisnow.com/new-york/news/capital-markets/gary-barnett-raises-270m-for-central-park-tower-refi-on-israeli-stock-exchange-128449",
      "https://therealdeal.com/new-york/2024/12/28/extells-central-park-tower-sells-unit-for-45m/",
      "https://therealdeal.com/new-york/2025/03/12/extell-buys-midtown-east-properties-from-solil-management/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2023/06/27/extell-740-eighth-ave-project-with-thrill-ride-is-legal/",
      "https://therealdeal.com/new-york/2024/12/28/extells-central-park-tower-sells-unit-for-45m/",
      "https://therealdeal.com/new-york/2025/03/12/extell-buys-midtown-east-properties-from-solil-management/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-13T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/13/backlash-rises-over-sands-vision-for-irving-casino-resort/",
    "title": "Sands suggests killing massive Irving development if no casino",
    "subhead": "Backlash from residents over zoning proposal for Mavericks stadium, entertainment district, gambling resort",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 3:00 PM",
    "pub_date_dt": "2025-03-13T15:00:00",
    "content": "Las Vegas Sands’ vision for a destination resort in Irving is facing growing public resistance, with concerns over the proposed casino dominating recent discussions.\nMore than 30 Irving residents spoke against the proposal, criticizing the casino element and raising concerns about the city’s planning process in a Planning and Zoning Commission meeting last week, the Dallas Business Journal\nreported\n.\nThe commission is\nconsidering a proposal\nto rezone the 182-acre site owned by Sands to allow for high-density, mixed-use development. Sands acquired 259 acres near the former Texas Stadium in mid-2023.\nThe changes would pave the way for a destination resort featuring a potential casino — pending state legalization — as well as a 15,000-seat arena for the Dallas Mavericks, plus a hotel, retail and entertainment spaces.\nThe debate comes amid broader speculation about the future of the Dallas Mavericks, co-owned by Sands’\nnewly promoted CEO Patrick Dumont\n. Sands bought Mark Cuban’s majority stake in the Mavericks for $3.5 billion at the end of 2023.\nThe rezoning would also establish a baseline development framework, though Sands would need to submit detailed plans for approval later. The proposal is still moving through the early stages. The commission scheduled to revisit it on Monday before a possible city council vote next Thursday.\n\nResidents argued that discussions were being rushed and lacked transparency, with some claiming they first learned of the zoning amendments just 48 hours before the meeting. Others questioned why city leaders would consider approving zoning for a casino while gambling is illegal in Texas.\nSands has said that a casino is essential for the project’s financial viability. Casino revenue is necessary to support other resort amenities like convention space and entertainment venues, the company said.\nThe company plans to have representatives at the upcoming meetings and maintained Sands is committed to “ongoing engagement and collaboration,” spokesman Ron Reese said.\nRemoving casino gaming from the zoning could force Sands to reconsider the development altogether, he said.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/12/las-vegas-sands-irving-destination-resort-zoning.html",
      "https://therealdeal.com/texas/dallas/2025/02/28/irving-talks-zoning-changes-for-las-vegas-sands-owned-land/",
      "https://therealdeal.com/texas/dallas/2025/03/10/dallas-mavericks-owner-patrick-dumont-promoted-to-sands/",
      "https://therealdeal.com/texas/dallas/2025/03/10/dallas-mavericks-owner-patrick-dumont-promoted-to-sands/",
      "https://therealdeal.com/texas/dallas/2025/02/28/irving-talks-zoning-changes-for-las-vegas-sands-owned-land/",
      "https://therealdeal.com/texas/2024/01/03/adelson-family-buys-dallas-design-district-acreage-from-mark-cuban/"
    ],
    "market": "Texas",
    "published": "Thu, 13 Mar 2025 19:00:00 +0000",
    "published_dt": "2025-03-13T19:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/new-york/2025/03/13/nys-senate-assembly-make-hochuls-bad-housing-plan-worse/",
    "title": "Three hacks in a room: How Albany is messing up real estate",
    "subhead": "Senate, Assembly make bad Hochul plan even worse",
    "authors": "ByErik Engquist",
    "pub_date": "Mar 13, 2025, 2:33 PM",
    "pub_date_dt": "2025-03-13T14:33:00",
    "content": "If you’re in the business of writing about Albany making things worse for the real estate industry and all New Yorkers, you never run out of material.\nRecently I wrote about Gov. Kathy Hochul’s proposal to crack down on an\nentirely nonexistent problem\n: large investors cornering the market on single-family and two-family homes in New York.\nGovernors are supposed to be the adults in the room — executives with a broad purview who can stop the wackiest bills advanced by clueless or ideological legislators.\nIn this case, Hochul did the opposite: Her plan was like dangling crack cocaine in front of a drug-addicted legislature.\nPredictably, the Assembly and Senate\nsmoked that rock\nand came back for a much larger hit, as my colleague Kathryn Brenzel reported Wednesday.\nSenate Democrats’ formal 2025 agenda includes the\nEnd Hedge Fund Control of New York Homes Act\n, a truly Orwellian name because hedge funds do not control homes in New York. How can you end something that has not even started, probably never will, and even if it did, wouldn’t necessarily be bad?\nThe bill covers homes with up to four units, instead of Hochul’s two. Even more extreme, it slaps a\n50 percent tax\non investor purchases of homes. That is the equivalent of a ban. It’s probably unconstitutional and is definitely bad policy.\n\nMost investors who buy, renovate and flip (or rent out) houses are mom-and-pops, the kind of folks who have become popular on HGTV. You’d think state lawmakers would want to encourage this kind of thing, especially now that\nrenting is more economical than buying\nin every metro area in the U.S., as a LendingTree analysis found.\nYet the Assembly defines an institutional investor as anyone with a net worth of $5 million or more. That means if you own a townhouse in the city, or just have a co-op and a decent-sized 401(k), the Assembly would impose a 10 percent tax on your next home purchase.\nChances are, you wouldn’t even be able to make an offer: The Assembly’s\nagenda\nalso calls for not allowing sellers to receive bids for 90 days from potential buyers who have $5 million to their names.\nJust imagine an agent telling an affluent home shopper, “I cannot share your offer with the seller because the state legislature defines you as a hedge fund.”\nYou cannot make this stuff up. And there’s no need to, because politicians provide an endless stream of senseless ideas.\nThe vast majority of bills do not pass, but this one actually might because the governor, Assembly and Senate each have a version of it in their budget proposals.\nThe days of “three men in a room” are technically over, because now two of the three leaders are women. What Albany really needs in the room is at least one adult.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/03/hochuls-populist-fight-against-real-estate-investors/",
      "https://therealdeal.com/new-york/2025/03/12/ny-senate-assembly-release-budget-bills/",
      "https://assembly.state.ny.us/leg/?default_fld=&leg_video=&bn=A01818&term=2025&Summary=Y&Memo=Y&Text=Y",
      "https://therealdeal.com/new-york/2025/03/12/bankruptcy-auction-to-end-eli-karps-development-nightmare/",
      "https://nyassembly.gov/Reports/WAM/AssemblyBudgetProposal/2025/2025AssemblySummary.pdf?t=1741877918",
      "https://therealdeal.com/new-york/2025/03/05/gov-hochul-says-investors-may-corner-housing-market-huh/",
      "https://therealdeal.com/new-york/2025/02/11/californias-wildfire-response-is-lesson-for-housing-crisis/",
      "https://therealdeal.com/new-york/tristate/2025/02/19/arilex-realtys-good-cash-flow-bad-debt-in-cliffside-park/"
    ],
    "market": "New York",
    "published": "Thu, 13 Mar 2025 18:33:20 +0000",
    "published_dt": "2025-03-13T18:33:20+00:00",
    "author": "Erik Engquist"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/doral-officials-approve-21m-settlement-for-land-purchase/",
    "title": "Botched $11M land deal costs city of Doral nearly double the price six years later",
    "subhead": "Elected officials approved settlement to pay property owner $21M for using vacant site as a staging area before completing purchase",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 13, 2025, 2:31 PM",
    "pub_date_dt": "2025-03-13T14:31:00",
    "content": "Six years after allegedly trashing a vacant property it intended to buy for $10.7 million, the city of Doral will pay the landowner nearly double the originally agreed purchase price.\nOn Wednesday, the\nDoral\nCity Council approved a settlement agreement that will pay Doral 10, an entity managed by Lizbeth Arencibia of Hialeah Gardens, $21 million to drop a 2019 civil lawsuit in Miami federal court. The settlement includes $17 million to buy the 9.6-acre site, with the remainder paying for Doral 10’s losses from not being able to use the property and attorney fees, said Raul Gastesi, a private lawyer representing the city.\nArencibia is the daughter of the late\nLowell Dunn\n, a developer whose family members are among the largest landowners in northwest\nMiami-Dade County\n. The 9.6 acres are between Northwest 102nd Avenue and 104th Avenue just north of 68th Street.\n“The market has changed dramatically since [the lawsuit was filed],” Gastesi told the city council. “And we were not doing well in court. [Doral 10] has not been able to develop the land or do anything on the land due to contamination that they allege we caused.”\nDoral 10’s attorney, Alejandro Brito, did not respond to requests for comment. The property owner sought $30 million in damages when Doral 10 initially filed its complaint in Miami-Dade Circuit Court. The lawsuit was transferred to federal court, where the city won a dismissal in 2020, court records show. The ruling was overturned on appeal in 2023.\n\nThe lawsuit also named three contractors, JVA Engineering Contractor, EE&amp;G Environmental Services and BBC Engineering, as defendants. But Doral 10 voluntarily dismissed the counts against the three firms, which were hired by\nDoral\n, court records show.\nBetween January and May 2019, the city and its trio of contractors used the site as a staging area for a roadway project without Doral 10’s consent, the complaint alleges. Yet, city officials allegedly “falsely and knowingly represented” to JVA and Miami-Dade County’s environmental permitting department that they had obtained the property owner’s permission.\nDoral 10 also accused JVA of taking clean fill from the vacant site to recycle contaminated soil that was excavated for the roadway project. The contractor then deposited contaminated soil mixed with clean fill onto Doral 10’s property, the lawsuit states.\nFour months into using the site as a staging area and without informing Doral 10, city officials informed the property owner that a required environmental remediation of the land would cost a minimum of $2.8 million, according to the complaint. As a result,\nDoral\nofficials opted to terminate the deal to buy the land, which the city planned to convert into a park.\nGastesi provided city council members with a grim outlook if Doral took the case to trial. “I would rather recommend you purchase the land rather than pay the damages,” he said. “The court is likely to find against Doral.”",
    "related_links": [
      "https://therealdeal.com/tag/doral/",
      "https://therealdeal.com/miami/2016/08/10/dunn-family-seeks-to-sell-off-remaining-miami-lakes-cow-land-30m/",
      "https://therealdeal.com/tag/miami-dade-county/",
      "https://therealdeal.com/miami/2025/01/06/glp-capital-sells-doral-warehouses-to-terreno-realty/",
      "https://therealdeal.com/miami/2025/01/16/trump-scores-final-ok-for-condo-expansion-at-trump-doral/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 18:31:10 +0000",
    "published_dt": "2025-03-13T18:31:10+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/13/lease-rates-plummet-for-chicago-housing-voucher-holders/",
    "title": "Lease rates plummet for Chicago housing voucher holders",
    "subhead": "Discrimination, low inventory, bureaucratic red tape are among the hurdles",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-13T14:30:00",
    "content": "Voucher recipients across Illinois are struggling to find housing as challenges in subsidized housing programs grow, the Chicago Tribune\nreported\n.\nMost subsidies come through the U.S. Department of Housing and Urban Development’s Housing Choice Voucher Program, which allows recipients to pay about 30 percent of their income toward rent while local housing authorities cover the rest.\nYet many recipients are unable to lease units due to hurdles including landlords\nrefusing to accept vouchers\n, often due to discrimination, and a lack of inventory.\nThe Chicago Housing Authority’s lease-up rates fell to 31 percent last year, down from 45 percent in 2023. The figure ranged from 61 percent to 77 percent between 2019 and 2022.\nSimilarly, the North Chicago Housing Authority reported a 50 percent lease-up rate last year, while the Lake County Housing Authority logged 62 percent. Some recipients are still searching for homes, meaning these rates could shift.\nThe struggle to find housing can be grueling for voucher holders, who may have to sleep in their cars or couch surf, shower at the gym and store personal items at work. Once they are approved for vouchers, the clock is ticking, and time can run out before they find housing.\n\nSome housing authorities are adopting strategies to address the problems. Housing authorities in Waukegan, North Chicago and Lake County last year agreed to allow voucher holders to lease units in any of their jurisdictions, aiming to expand options and increase lease-up rates.\nWaukegan and Lake County have also received HUD approval to offer monetary incentives to landlords.\nMeanwhile, landlords cite barriers like bureaucratic delays, inspections and a lack of standardization across housing authorities. Some housing providers have called for streamlining the process through faster unit approvals and more consistent administrative standards.\nNationally, about 60 percent of voucher holders are able to lease units, according to New York University’s Furman Center for Real Estate and Urban Policy.\nThe rates are lower in markets with older housing stock and among recipients of color — two conditions that especially apply in Chicago.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagotribune.com/2025/03/11/housing-voucher-recipients-lease-up-rates/",
      "https://therealdeal.com/chicago/2025/01/20/slew-of-brokerages-landlords-agents-hit-with-discrimination-complaints/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2025/01/20/slew-of-brokerages-landlords-agents-hit-with-discrimination-complaints/",
      "https://therealdeal.com/chicago/2024/01/15/apartment-fees-burden-chicago-renters/"
    ],
    "market": "Chicago",
    "published": "Thu, 13 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-13T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/former-salesforce-executives-superhero-lair-condo-for-sale/",
    "title": "Former Salesforce exec eyes West SOMA resi deal record with “superhero lair”",
    "subhead": "Listing price still millions below 2022 ask",
    "authors": "ByEmily Landes",
    "pub_date": "Mar 13, 2025, 2:13 PM",
    "pub_date_dt": "2025-03-13T14:13:00",
    "content": "When Tony Prophet joined Salesforce as its chief equality officer in 2016, he wanted the “real urban experience of living in San Francisco,” which he didn’t associate with the city’s\ntraditional high-end neighborhoods\non the north side of town. Instead he went into\nSoMa\n, “eyes wide open,” buying a 7,000-square-foot top-floor condo at 9 Bernice Street for just over $7 million in November 2016.\n“No surprises,” he said of his time living with his then-wife and their son at the semi-industrial location near Rainbow Grocery and the DNA Lounge. “We knew everything—all the good and the challenges that we were in for—and saw some real improvements along the way.”\nNearly a decade later and with more than $1 million poured into creating a wind-shielded roof deck with astroturf and a fire pit, Prophet is hoping his condo will break West SOMA residential records, with an asking price of $8.8 million.\nA price of about $1,250 per square foot is not out of step for the neighborhood. But because there are not many condos or even single-family homes as big as 9 Bernice, there are seldom sales above $5 million. So while it’s “impossible to replicate what’s been done here,” according to Compass agent Butch Haze, who is listing the skylit two-level loft with three bedrooms, 3.5 baths, a wine room, and a glass-enclosed gym, it’s also nearly impossible to find comps.\n“You really have to compare it to buying a warehouse and what it would take to do the TIs,” he said, adding that the turnkey aspect is “baked in” to the asking price.\nThere are added perks as well. The condo includes the elaborate light fixtures and large-scale furniture, almost entirely from Restoration Hardware, including a 16-seat dining table that was craned in by the previous owner, luxury retailer Wilkes-Bashford co-owner Tyler Mitchell.\n\n“Not everyone loves Restoration Hardware, but nobody hates it,” said Prophet, who built on interior designer Ken Fulk’s work for Mitchell.\nThe new price marks a big drop from the last time the condo was on the market in 2022, when it was listed at just under $11 million. The home didn’t find a buyer at the time, but Prophet had already moved to Florida so his son could attend IMG, a sports academy about an hour south of Tampa. For the last two years, he has rented it to a foursome of entrepreneurs from the start up world. Haze said the new price had to speak to today’s “value-driven buyer.”\n“We wanted to price it where the price per square foot is just too attractive,” Haze said.\nThere are a lot of early stage businesses walking distance from the property, Prophet added, which borders the Mission, Potero Hill and the Design District. The “perfect fit” would be someone who is excited by the idea of walking to work and entertaining in the enormous space, he said.\nProphet said he hosted everything from fundraisers for London Breed and the Women’s HIV Program at UCSF to media events for Salesforce during his time there. He left Salesforce in 2021, and now sits on the board at Dolby Labs and is an investor and board member for an AI-assisted sales platform called Aviso.\nThe likely buyer for this home probably also sits on a lot of boards, Haze said, and is in their 50s or 60s but still active in tech or finance. They probably already own more traditional homes outside the city, but are looking for something different. It may be somebody that has “flirted with” the north side of the city or Noe Valley, but can’t pass up the outside-the-box offering.\n“They want to have fun in a really cool, almost superhero lair in San Francisco that wows all their friends,” he said.\nThat’s a very specific buyer profile, but Prophet said he can be patient until the right person comes along.\n“It’s super special for someone who sees that opportunity,” he said. “It was the same situation when we bought it: a unique property and a high price point.”\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2024/12/27/blockbuster-71m-home-sale-ranks-as-sfs-top-deal-of-year/",
      "https://therealdeal.com/san-francisco/2024/07/24/san-francisco-could-rezone-soma-office-sites-for-housing/",
      "https://therealdeal.com/san-francisco/2024/07/24/san-francisco-could-rezone-soma-office-sites-for-housing/",
      "https://therealdeal.com/san-francisco/2024/10/18/where-are-new-hot-spots-in-san-francisco-office-market/",
      "https://therealdeal.com/san-francisco/2024/12/27/blockbuster-71m-home-sale-ranks-as-sfs-top-deal-of-year/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 18:13:07 +0000",
    "published_dt": "2025-03-13T18:13:07+00:00",
    "author": "Emily Landes"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/13/la-canada-flintridge-ditches-appeal-to-builders-remedy-project/",
    "title": "La Cañada Flintridge ditches appeal to builder’s remedy project",
    "subhead": "Joins Beverly Hills in acceptance instead of $14M bond to pursue case",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 2:07 PM",
    "pub_date_dt": "2025-03-13T14:07:00",
    "content": "The first to retreat was Beverly Hills, which laid down its arms in the battle against the state builder’s remedy.  And now La Cañada Flintridge, which threw in the towel after a two-year fight.\nThe La Cañada Flintridge City Council voted to withdraw from its campaign to block a five-story apartment-hotel-office project proposed by Cedar Street Partners under the anti-NIMBY law at 600 Foothill Boulevard, the\nLos Angeles Daily News\nand\nBisnow\nreported.\nThe reason: the foothill city chose to quit an uphill legal battle after a Los Angeles judge ordered it pay a $14 million bond to appeal\na court decision to greenlight the project\n.\n“Continuing the lawsuits is no longer in the best interest of the city,” Mayor Mike Davitt said in a\nstatement\nsaying that the financial costs of its appeal outweighed its potential outcome.\nThe decision by La Cañada Flintridge to back down may mark a Waterloo for opponents of the builder’s remedy, a once-obscure provision in state housing law that has empowered developers while frustrating cities and counties across the state.\nThe builder’s remedy allows housing developers to skirt local zoning\nin cities such as Beverly Hills\nthat failed to certify their state-mandated housing plans, provided their projects include 20 percent affordable housing.\nBeverly Hills, which had vigorously fought a slew of state-sanctioned builders remedy projects,\nbroached a compromise\nwith developers last month.\nNow La Cañada Flintridge must come to terms with Cedar Street, led by Jonathan Curtis, a former city councilman and mayor who bought the property during his term in office.\nThe locally based developer had employed the 35-year-old legal loophole to allow the 80-unit complex with 16 hotel rooms and 7,300 square feet of offices, with 16 apartments set aside for low-income households.\n\nThe project, designed by Mid-City-based Riley Projects, would replace a former First Church of Christ Scientist, blocks from a large commercial district.\nCedar Street Partners had filed a\nlawsuit in July 2023\n, after a yearlong back-and-forth with the city and repeated denials. Gov. Gavin Newsom and Attorney General Rob Bonta\nasked a court\nto support the project, as well as the state builder’s remedy provision.\nThe decision by the city to back down sends a disquieting message to cities trying to push back against housing laws, Ryan Leaderman, a partner at Holland &amp; Knight, who previously represented the 600 Foothill project, told Bisnow.\n“The message is: stop playing games with housing,” Leaderman said. “There’s going to be a price to pay when a city unlawfully denies a project.”\nDespite the city’s decision to abandon its appeal, the Foothill Boulevard project must still clear several hurdles before winning local approval. While the builder’s remedy waives zoning rules, such projects still must comply with environmental, infrastructure and health and safety standards, according to the Daily News.\n“The City and community will need to chart a pathway forward that integrates the 600 Foothill project as reasonably as possible, and we hope going forward the developer will work with us to minimize any detrimental impacts on the City,” Mayor Davitt said in his statement.\n“The ball’s in their court,” Cedar Street partner Jonathan Curtis told Bisnow.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.dailynews.com/2025/03/05/la-canada-flintridge-abandons-builders-remedy-appeal/?utm_email=248C957204922421C572753277&lctg=248C957204922421C572753277&active=yesD",
      "https://www.bisnow.com/los-angeles/news/multifamily/la-canada-flintridge-builders-remedy-cedar-street-128413",
      "https://therealdeal.com/la/2024/03/04/la-court-looks-to-validate-builders-remedy-project-in-la-canada-flintridge/",
      "https://lcf.ca.gov/la-canada-flintridge-city-council-moves-to-conclude-legal-wrangling-on-600-foothill-fiscal-reality-requires-responsible-choice-to-end-appeals-process/",
      "https://beverlyhillscourier.com/2023/09/14/court-rules-against-beverly-hills-in-housing-element-case/",
      "https://therealdeal.com/la/2025/02/05/beverly-hills-retreats-in-fight-against-builders-remedy/",
      "https://therealdeal.com/la/2023/07/27/bad-faith-la-canada-flintridge-builders-sue-for-project-approval/",
      "https://therealdeal.com/la/2023/12/12/newsom-slams-la-canada-flintridge-in-housing-case/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2023/07/27/bad-faith-la-canada-flintridge-builders-sue-for-project-approval/",
      "https://therealdeal.com/la/2024/03/04/la-court-looks-to-validate-builders-remedy-project-in-la-canada-flintridge/",
      "https://therealdeal.com/la/2024/03/07/can-california-make-builders-remedy-work/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 18:07:07 +0000",
    "published_dt": "2025-03-13T18:07:07+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/13/meta-platforms-spending-3m-on-austin-office-buildout/",
    "title": "Meta drops $3M on office buildout, but for whom?",
    "subhead": "Tech giant previously marketed space at 300 West 6th for sublease",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 1:34 PM",
    "pub_date_dt": "2025-03-13T13:34:00",
    "content": "Meta Platforms has plans for some of the 120,000 square feet of downtown Austin office space that it put up for sublease in 2023.\nThe Facebook and Instagram owner filed plans for a $2.9 million buildout at 300 West 6th Street, the Austin Business Journal\nreported\n. The project for 25,000 square feet pencils out to $116 per square foot.\nIt’s unclear whether the project is intended for Meta’s own use or for a subtenant. The company hasn’t commented. It put the space up for\nsublease\nin June 2023 as it shifted toward\nan emphasis on remote work\n.\nThe building is one of three in downtown Austin where Meta holds leases, although its presence is in flux.\nThe tech giant has yet to occupy the 589,000 square feet it leased in the Sixth and Guadalupe tower, at 400 West 6th Street just across the street, a sublease it\nput on the market in November 2022\n. Meta occupies Third + Shoal, at 607 West 3rd Street, about four blocks away, as the anchor tenant.\n\nCEO Mark Zuckerberg\nadjusted\nthe company’s remote work policy in 2023, calling more employees back to work, with most required to come to the office at least three days a week, but few adjustments to Meta’s Austin real estate plans have been made.\nMeta’s effort to reconfigure or backfill office space mirrors broader trends in Austin, where high-profile tech tenants like Google are also facing questions about long-term office plans. Google still hasn’t occupied the 804,000-square-foot\nSail Tower\n, at 601 West 2nd Street, which it leased in 2019.\nIBM\ndid the opposite\nin September, agreeing to assume Meta’s lease for the 320,000-square-foot Domain 12 building in North Austin, with plans to take occupancy in January 2026 and extend the lease through 2040.\nAustin’s office vacancy rate hit an all-time high of 22.5 percent in the fourth quarter 2024, according to Colliers. It has the second-biggest office pipeline for this year, behind Boston, with 3.6 million square feet of space under development set to boost office stock by 4 percent, according to\nCommercialCafe\n.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/austin/news/2025/03/12/meta-downtown-austin-office.html",
      "https://therealdeal.com/texas/austin/2023/06/07/meta-subleases-another-100k-sf-in-austin/",
      "https://therealdeal.com/national/2023/07/31/meta-poised-to-make-more-real-estate-cuts-this-year/",
      "https://therealdeal.com/texas/austin/2022/11/02/meta-backs-out-of-plan-to-occupy-589k-sf-in-austin/",
      "https://www.cnbc.com/2023/09/05/meta-employees-are-back-in-office-three-days-a-week-.html",
      "https://therealdeal.com/texas/austin/2024/12/10/trammell-crow-company-selling-google-leased-austin-sail-tower/",
      "https://therealdeal.com/texas/austin/2024/09/09/cousins-properties-leases-full-building-to-ibm-in-austin/",
      "https://www.commercialcafe.com/blog/office-pipeline-report/",
      "https://therealdeal.com/texas/austin/2023/06/07/meta-subleases-another-100k-sf-in-austin/",
      "https://therealdeal.com/texas/austin/2024/09/09/cousins-properties-leases-full-building-to-ibm-in-austin/",
      "https://therealdeal.com/texas/austin/2025/02/20/loan-for-fortis-property-in-austin-heads-to-special-servicing/"
    ],
    "market": "Texas",
    "published": "Thu, 13 Mar 2025 17:34:28 +0000",
    "published_dt": "2025-03-13T17:34:28+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/san-francisco-apartment-sales-longtime-owners-sell-major-buildings/",
    "title": "Two longtime owners sell major SF apartment buildings",
    "subhead": "Normandy Apartments in Cathedral Hill sells for $35 million, Nob Hill building sells for $14.5 million",
    "authors": "ByEmily LandesResearch byAbigail Nehring",
    "pub_date": "Mar 13, 2025, 12:00 PM",
    "pub_date_dt": "2025-03-13T12:00:00",
    "content": "Two major San Francisco apartment building trades by longtime owners have closed in the first few months of the year, including the $35 million sale of the block-long Normandy Apartments, just behind the famed St. Mary’s Cathedral.\nThe early spring sales are further signs of\nnew life in the market\nthat agents saw beginning in the latter half of last year.\nThe seller of the 1968-built 108-unit complex at 1135-1175 Ellis Street was a partnership called Normandy Apartments that goes back to at least the 1990s, according to city records. The buyer was affordable housing developer Tenderloin Neighborhood Development Corporation, which bought the property with funding from the San Francisco Mayor’s Office of Housing and Community Development and is planning a major renovation. The MOHCD confirmed the $35 million price.\nThe Jan. 31 acquisition will create “permanently affordable units in the City’s Western Addition neighborhood for families, individuals, couples, older adults, and long-term residents within a variety of ethnic and racial backgrounds,” according to a TNDC announcement. With the exception of one manager’s unit, all apartments will be restricted to households not to exceed 120 percent of the city’s area median income with an average of 80 percent of the city’s AMI. In 2024, 80 percent of AMI would mean that a single person making up to $83,900 would be eligible, for example, while a household with three people could make up to $107,900, according to the MOHCD website.\nA November 2024 MOHCD memo about TNDC’s request for just over $52 million in permanent financing for the purchase and rehabilitation of the nearly 70,000-square-foot property said the building is in “good condition” and 90 percent occupied. The planned rehabilitation will focus on fire and life safety upgrades and accessibility and ADA upgrades and requirements.\nColliers agent Brad Lagomarsino represented the sellers and said that TNDC and MOHCD “seized the rare opportunity to purchase 108 units in the heart of San Francisco”. He added that the nearly 1.5-acre lot  “offers tremendous development potential that justifies the price paid for the asset.”\n\nIn another early spring sale after a decades-long hold, a 36-unit Nob Hill apartment building traded for the first time since it was built in 1954, according to public records. The price was $14.5 million, or just over $400,000 per unit, according to the transfer tax on the sale. That’s above the average of about $340,000 per unit in San Francisco in 2024, according to Colliers data.\nColliers listing agent Dustin Dolby said he could not comment on the Feb. 18 sale due to a non-disclosure agreement, but he posted on LinkedIn that, “With its proximity to Grace Cathedral, Huntington Park, and the Financial District, 1330 Jones exemplifies the enduring desirability of Nob Hill real estate.”\nThe sellers were the descendants of the developer, Theo G. Meyer and Sons, which built the seven-story building, according to the deed and probate records. The buyer was Otrera Real Estate, LLC, a Delaware-created entity that lists its address as a P.O. Box at the Rincon Finance Center in downtown San Francisco, according to the deed. The buyers’ agent is unknown.\nThe six-story building at 1330 Jones has 18 one-bedroom, one-bath units, six two-bedroom, one-bath units, and 12 two-bedroom, two-bath units, as well as 23 dedicated parking spots and onsite laundry.\nThe building was first listed as part of a\nthree-building portfolio\nthat was all developed by the Meyer family and came to market at an undisclosed price last summer. It is the smallest building of the three, and the only one to sell thus far. The other two buildings are a 62-unit, 13-story building at 1000 Green Street in Russian Hill and the 56-unit, 13-story Crest Royal at 1310 Jones, which is next door to the building that sold.\nAt least two other San Francisco apartment buildings asking over $10 million are also in contract but are still pending. Magnolia Place, which has 27 apartment units at 3322 Buchanan in the Marina, came to market at the end of September with an asking price of $18 million. The 2001-built non-rent-controlled building with two commercial units fronting Lombard Street has been pending as of Nov. 22, according to Redfin. At 1745 Market, a property with 48 apartment units and eight commercial spaces, including local favorite piano bar Martuni’s, went into contract on Jan. 27, according to Redfin. It is owned by\nMosser Properties\nand has been\non and off the market for the last few years\n, with a starting price of $25 million in 2022. It came back to market most recently last September, with an asking price of $14 million. That ask dropped to $13 million in November, just $1 million more than Mosser paid for it back in 2017.\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2024/12/30/newbuyers-enter-sf-apartment-market-to-snap-up-deals/",
      "https://therealdeal.com/san-francisco/2024/06/20/portfolio-of-1950s-era-san-francisco-apartments-list-for-first-time/",
      "https://therealdeal.com/san-francisco/2024/05/20/sf-landlord-neveo-mosser-sees-disruption-in-multifamily/",
      "https://therealdeal.com/san-francisco/2023/01/26/mosser-lists-downtown-sf-apartment-building-for-25m/",
      "https://therealdeal.com/san-francisco/2024/12/30/newbuyers-enter-sf-apartment-market-to-snap-up-deals/",
      "https://therealdeal.com/san-francisco/2024/06/20/portfolio-of-1950s-era-san-francisco-apartments-list-for-first-time/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 16:00:00 +0000",
    "published_dt": "2025-03-13T16:00:00+00:00",
    "author": "Emily Landes, Abigail Nehring"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/13/inside-chicagos-crackdown-on-deeply-indebted-land-speculators/",
    "title": "“Land speculation becomes problematic”: Chicago cracks down on more debtors",
    "subhead": "How distressed real estate strategies of suburban firms Goldmine Investments and QCD Financial led to legal peril with $9M in fines and interest owed to the city",
    "authors": "ByKelli Duncan",
    "pub_date": "Mar 13, 2025, 11:38 AM",
    "pub_date_dt": "2025-03-13T11:38:00",
    "content": "A Grayslake-based real estate company whose manager reportedly paid an unhoused Chicagoan to take over the deeds of run-down properties it picked up in bulk and later sought to offload has become the latest target of the city.\nThe company, Goldmine Investments, and another Hinsdale-based investor, QCD Financial, follow a pattern of owners being pursued by a city task force that’s designed to pin down Chicago’s most indebted landowners. Both firms are alleged large-scale “land speculators” that bought up heavily distressed properties, often vacant lots, purchasing them under the names of various LLCs used to muddy the ownership of the properties, according to complaints filed by the city in Cook County Circuit Court.\nThey collectively owe $9 million in fines to the city from municipal code violations related to neglect and environmental hazards at their properties, which are predominantly concentrated in disadvantaged neighborhoods on the South and West sides of the city.\nThis is when “land speculation becomes problematic,” the city said in the case brought against QCD.\nFor its most negligent landowners, the Chicago Department of Law’s special collections unit is moving to consolidate judgements made against owners in city administrative hearings into lawsuits filed with the Circuit Court — as it did for QCD, Goldmine and\ninfamous Chicago landowner Suzie Wilson\nin recent months. The city recently reached a tentative, $11.5 million settlement agreement with Wilson to resolve an estimated $49 million in legal claims it brought against her and her companies.\nAfter bringing down Wilson, the city “seized an opportunity once we learned that there was an individual — individuals — who are accumulating property in a particularly unique way around these title structures that allow them to constantly change the titles without anyone in the city or the county noticing that was happening,” Chicago’s top lawyer Mary Richardson-Lowry said.\nNow, the unit is doing more research to track ownership and moving aggressively when they can bring legal action against the people behind the landlord LLCs — and officials are open to seeking to freeze personal assets in some circumstances as a “motivator,” said the city’s deputy attorney David Holtkamp, who runs the unit.\nNext on the city’s list of troubling landowners: Grayslake resident Keith Moll, the manager of Goldmine, according to court filings and business registry information.\nDigging into Goldmine\nThe city says that Goldmine owns hundreds of properties in Chicago and is just “one of many shell companies created by (Moll) to hold title to real estate in distressed neighborhoods.” Goldmine allegedly owes the city over $5.2 million in fines from more than 1,500 counts of blight-related code violations, according to city litigation.\nThis is not the first time that an LLC managed by Moll has been sued by the city, according to a\nChicago Tribune report from 2015\n. The city sued Z Financial Illinois G Properties, LLC a decade ago to force the company to repair, demolish or cover the cost of demolishing unsafe structures on its properties.\nShortly thereafter, Moll transferred ownership of several of the properties to an unhoused man named Abana Tabb, who told the newspaper Moll paid him to take the five properties.\n“(He said) ‘I wanna dump a couple of houses on you. Don’t worry about it. You’re not gonna get in trouble, blah, blah, blah … sign here,’” Tabb told the newspaper.\nAs a result, Tabb was added as a defendant in the city’s cases against the properties and Z Financial was let off the hook in nearly every case. The Cook County Sheriff’s Office later investigated the transfers, but ultimately closed the case without filing any charges.\nZ Financial acquired the properties through the county’s delinquent tax and scavenger sales — a high-risk, high-reward investment arena.\nTax buyers used to be able to earn double-digit interest rates as residents paid back taxes — they can still earn significant interest after state law was\nrecently reformed\nto lower the maximum rates to cut a break to homeowners who fall behind. But when those taxes aren’t repaid and the deed is turned over to the taxbuyer, investors like Moll can end up with a lot of properties that are worth less — or would cost more to repair — than they paid for them.\nMoll didn’t return requests for comment made by\nThe Real Deal\nvia phone and email.\nTransferring property in this way is not illegal and Moll told the Tribune that he gave the properties to Tabb because the man expressed a desire to rehabilitate and live in them. But a co-defendant in a recent city lawsuit filed against Goldmine, Damien Garrett Chiodo, said this instance of it is unethical, if true.\n“I don’t know these guys. For all I know, they’re good guys and got themselves in just a pickle,” Chiodo said. “But I do know it smells bad.”\nChiodo said he became aware of Goldmine when he received notice that he was named in a city lawsuit filed against Goldmine, Moll, himself and Novacore, LLC — an Arizona-based company, now inactive, formerly managed by Chiodo and others, according to court records and business registry information.\nThe complaint, which came in December as the city restarted gunning for Moll, centers around two neighboring properties in the South Shore neighborhood that the city claimed owners allowed to become “an illegal parking lot and dumping ground for abandoned vehicles and refuse.”\n\nNow, this is where things get tricky.\nUntil 2014, a single-family home straddled the line between the two properties at 7543 and 7545 South Oglesby, so they were typically bought and sold together, but had two separate property identification numbers with the county.\nIn 2003, the then-owner of the property transferred the ownership to someone new and signed a deed for both properties that was only recorded against the property identification number for 7543 South Oglesby. The other property, 7545 South Oglesby, was later sold at a scavenger sale, creating a whole different chain of ownership for that parcel.\nMoll’s other company, Z Financial Illinois G Properties, bought 7545 South Oglesby in 2011 and then transferred it to Goldmine via quit claim deed in 2017, property records show. Novacore acquired 7543 S. Oglesby through a quit claim deed in 2014, a deed that also included the property description of the neighboring lot.\nThe two properties have been in a state of neglect that the city claims is an environmental hazard to the neighborhood since 2023. So, when notices of code violations weren’t met with compliance, the city filed suit against both companies and the people they could tie to them, including Chiodo.\nChiodo, who is now the president of KeyLink, a company that helps manage distressed real estate assets for clients like banks and hedge funds, said he did not receive notice of the violations sent to the business because it has been dissolved. Arizona business registry information shows that the LLC has been inactive since 2019.\nThe city asked the court to order that the defendants in the case clean up the properties immediately and is seeking $4.35 million in damages, based on complaints that the owners of the properties used it as an illegal parking lot for abandoned vehicles and failed to put up required fencing or take down a falling tree, creating an environmental hazard for residents in the area.\nWhen he received notice of the suit, Chiodo said he paid to clean up the sites as requested and is hoping to clear things up with the city as soon as possible.\n“We had no idea we even owned the thing, and we’re just trying to make it right and get out from under this mess,” Chiodo said.\nMeanwhile, Moll is unlikely to be absolved anytime soon as the city has moved to consolidate three cases brought against Goldmine Investments to be litigated together in Circuit Court.\nQCD Financial\nHinsdale-based investor QCD Financial has been found liable “at least 1,618 times” for municipal code violations across 125 properties it owns, allegedly amassing over $3.8 million in fines and interest since 2013, according to court records.\nQCD has been operating in Chicago for at least the last 11 years, and the city has been slapping the landowner with health and safety violations ever since, court records show. The company currently owns at least 123 properties across the South and West sides of the city, according to a map compiled by the city.\nA Circuit Court judge granted a city motion that was filed in December to consolidate past judgements made against QCD into a single case. In the coming months, the court will weigh in on the central question that remains before the two parties: how will QCD pay its debts to the city?\nAttempts to reach QCD weren’t successful.\nA spokesperson for the Chicago Department of Law declined to comment on the specifics of the cases brought against QCD and Goldmine in recent months, but confirmed that the city’s special collections unit had taken “additional enforcement actions” against the two companies.\nThe city’s special collections unit is a group of attorneys housed under the Law Department’s Collections, Ownership, and Administrative Litigation Division that evolved out of lessons the division learned while tracking and enforcing the debt racked up by another Chicago landowner Suzie Wilson, Holtkamp said.\nWilson racked up over $15 million in fines for municipal property violations and may be barred from ever investing in Chicago real estate again as part of any settlement that might be reached in a bankruptcy case filed by her businesses in the fall, Holtkamp said. The two sides will meet to discuss the proposed settlement on April 1. It remains uncertain whether the final agreement will include a ban on investing in Chicago.\nAs the city’s special task force ramps up its work, it will start by focusing on about 10 more landowners that hit a certain threshold of unpaid fines and fees with the city, including QCD and Goldmine.\n",
    "related_links": [
      "https://therealdeal.com/chicago/2025/03/10/chicago-plots-next-moves-against-suzie-wilson-more-negligent-landowners/",
      "https://www.chicagotribune.com/2015/10/26/tax-buyer-deeds-abandoned-properties-to-homeless-man/",
      "https://therealdeal.com/chicago/2023/05/26/lawmakers-crack-down-on-givebacks-in-cook-county-property-tax-sale/",
      "https://therealdeal.com/chicago/2025/03/10/chicago-plots-next-moves-against-suzie-wilson-more-negligent-landowners/",
      "https://therealdeal.com/chicago/2025/01/22/infamous-chicago-landlord-lists-bankruptcy-sale-of-over-800-lots/",
      "https://therealdeal.com/chicago/2024/04/29/chicago-sues-citys-worst-landowner-for-10m/"
    ],
    "market": "Chicago",
    "published": "Thu, 13 Mar 2025 15:38:58 +0000",
    "published_dt": "2025-03-13T15:38:58+00:00",
    "author": "Kelli Duncan"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/related-nonprofit-win-approval-for-affordable-block-in-oakland/",
    "title": "Related California, nonprofit win approval for affordable block in Oakland",
    "subhead": "City overlay zone fasttracked nod to build 192 apartments in Jack London Square",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 10:40 AM",
    "pub_date_dt": "2025-03-13T10:40:00",
    "content": "Related California and East Bay Asian Local Development Corporation have employed an Oakland overlay zone for affordable housing to win approval for a 192-unit complex in Jack London Square.\nThe Irvine-based builder and locally based nonprofit developer used\nS-13 zoning\nto approve the five-story affordable apartments around a central plaza at 430 Broadway, the\nSan Francisco Business Times reported\n.\nThe joint venture had\nsought permits last fall\nto build the three-building, block-size project on land owned by Alameda County, south of Interstate 880 between 5th Street, 4th Street, Broadway and Franklin Street. The two-phase project will replace former county probation offices.\nIt also may be first of its kind to use S-13 to streamline approvals and shorten development, according to the Business Times.\nThe S-13 zone allows 100 percent affordable housing projects to bypass environmental and discretionary review, while allowing an additional bonus height, if they meet certain objectives.\nWhile it can help developers get projects approved a year sooner than state streamlining laws like Senate Bill 35 and Assembly Bill 2011, it’s three years faster than a traditional planning application.\nThe three buildings are part of a larger plan to remake Jack London Square with hundreds of affordable homes around a plaza containing a playground, public art and seating.\n\nThe developers plan to spend the next two years raising money to build the project, likely from Measure U Affordable Housing Infrastructure Bond funds, local funding and state financing in tax credits and bonds, according to the Business Times.\nA cost and timeline for the development were not disclosed.\nA later phase, also by Related and East Bay Asian Local Development, would add two affordable apartment buildings and a market-rate complex at 401 Broadway. A rendering suggests two seven- or eight-story buildings and a 20-story tower overlooking I-880.\nRelated California, founded in 1989, is a unit of New York-based Related Companies. The California subsidiary has developed 20,700 apartments, and owns and manages more than 13,000 affordable and workforce housing units across the Golden State, according to its website.\nEast Bay Asian Local Development, founded in 1975 by a group of Asian Pacific Islander college students and young professionals, owns and manages more than 35 residential and commercial developments, according to its website.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.oaklandca.gov/topics/housing-projects",
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/11/oakland-jack-london-square-ebaldc-related.html",
      "https://therealdeal.com/san-francisco/2024/10/29/related-california-eyes-affordable-housing-in-oaklands-jack-london-square/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/10/29/related-california-eyes-affordable-housing-in-oaklands-jack-london-square/",
      "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
      "https://therealdeal.com/san-francisco/2024/04/03/east-bay-asian-local-development-to-build-oakland-apartments/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 14:40:47 +0000",
    "published_dt": "2025-03-13T14:40:47+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/vivian-dimond-reviving-stalled-north-bay-village-condos/",
    "title": "Developer Vivian Dimond to revive stalled waterfront North Bay Village condo project",
    "subhead": "54-unit Tula Residences will mark first new condo building in the city in more than a decade",
    "authors": "ByKatherine Kallergis",
    "pub_date": "Mar 13, 2025, 10:36 AM",
    "pub_date_dt": "2025-03-13T10:36:00",
    "content": "Developer Vivian Dimond took over the stalled condo building in North Bay Village, a 15-story shell on Harbor Island,\nThe Real Deal\nhas learned.\nThe planned\n54-unit building\nat 7918 West Drive will now be called Tula Residences.\nDimond’s\nBayshore Grove Capital is now the sole managing member of the LLC that owns the property, she said. Malaysian developer Pacific &amp; Orient, led by CEO Thye Seng Chan, will remain a partner in the project, but is no longer involved in construction or the development.\nDimond declined to share financial terms of the deal, but said the agreement was finalized last year.\nConstruction of the building, which will rise to 21 stories once completed, stalled in late 2023,\nTRD\npreviously reported. Liens piled up against the developer, including a nearly $7 million lien filed by Thornton Residential, the former general contractor. A cooling company also filed a lawsuit against Pacific &amp; Orient.\nDimond said construction will resume “very soon” and will likely be completed within 18 months, sometime in 2026.\nThe new team made some changes to the floor plans and amenities, Dimond said.\n\n“We just got approved for some changes we made with the city,” Dimond said, referring to the floor plans. “The number of units didn’t change, but the layouts changed.”\nThe lobby will now be on the first floor; it was previously planned for the sixth floor. Dimond said the amenities, like the gym and pool, were enhanced with an emphasis on wellness. Some of the windows are also larger, offering better views.\nSales will launch this spring with\nEllis Bachman\n, who recently joined Brown Harris Stevens from Douglas Elliman’s Eklund-Gomes team, Pedro Cuberos and Madison Napoles. Bachman said the project was a “major factor” in deciding his move to BHS.\nThe units will range from two- to three-bedroom condos, as well as six five-bedroom penthouses. The two-bedroom units will start at just under $2 million; the three-bedrooms at nearly $3 million and the penthouses at close to $6 million. They’ll each have large outdoor terraces and waterfront views.\nSales will launch soon, Bachman said, calling the project “accessible luxury.”\nThe developer is also negotiating construction financing, Dimond said. Dimond, a broker and developer, has 1,500 residential units in the pipeline through her Coconut Grove-based Bayshore Grove Capital. Bayshore’s projects include\nLe Parc at Lauderhill\n, a 330-unit apartment development in Broward County, and a mixed-use project with about\n900 workforce housing units\nnear Miami’s Allapattah.\nDespite the delay with the previous developer, the\nNorth Bay Village\nproject will still mark the first new condo building to be completed in the city in more than a decade. The town has attracted major investment in recent years, with a number of projects in the pipeline. Last year, Mikael Hamaoui’s Riviera Horizons\nlaunched sales\nof a Pagani-branded condo project in North Bay Village; other developments include a phased megaproject by the billionaire Ansin family’s Sunbeam Properties, and the\nEichner family’s\nplanned Continuum Club &amp; Residences.\n“I like the fact that it is way ahead of everyone else,” Dimond said.\nP&amp;O’s Chan had been working on plans for the project for almost a decade. The developer paid $8.3 million for the 0.8-acre site in 2015. Construction was set to begin in 2018, but the firm broke ground years later, in 2023.\nSales launched\nthat same year. One of two presales from before Dimond’s involvement will remain, she said.\n",
    "related_links": [
      "https://therealdeal.com/miami/2024/02/01/construction-stalled-at-pacific-orients-condo-tower/",
      "https://therealdeal.com/tag/vivian-dimond/",
      "https://therealdeal.com/miami/2025/02/24/movers-shakers-elliman-taps-new-development-marketing-vp/",
      "https://therealdeal.com/miami/2022/07/14/lauderhill-fattens-tax-break-for-le-parc-vivian-dimons-planned-330-unit-multifamily-development/",
      "https://therealdeal.com/miami/2023/12/11/vivian-dimond-plans-metrorail-housing-project-in-miami/",
      "https://therealdeal.com/tag/north-bay-village/",
      "https://therealdeal.com/miami/2024/03/06/riviera-horizons-to-launch-sales-of-pagani-residences/",
      "https://therealdeal.com/tag/ian-bruce-eichner/",
      "https://therealdeal.com/miami/2023/08/03/pacific-orient-taps-bhhs-for-north-bay-village-condo-sales/",
      "https://therealdeal.com/miami/2024/02/01/construction-stalled-at-pacific-orients-condo-tower/",
      "https://therealdeal.com/miami/2025/02/07/bh-pays-83m-for-north-bay-village-multifamily-project/",
      "https://therealdeal.com/miami/2025/01/09/elliman-sues-eichner-over-continuum-north-bay-village/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 14:36:58 +0000",
    "published_dt": "2025-03-13T14:36:58+00:00",
    "author": "Katherine Kallergis"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/13/broward-county-weekly-condo-report-22/",
    "title": "Solemar closing tops Broward weekly condo sales",
    "subhead": "Top 10 sales ranged from $879K to $2.7M",
    "authors": "ByKate Hinsche",
    "pub_date": "Mar 13, 2025, 9:45 AM",
    "pub_date_dt": "2025-03-13T09:45:00",
    "content": "Broward County’s condo sales and dollar volume fell in the first week of March.\nBrokers closed 128 condo sales totaling $46 million from Mar. 2 to Mar. 9. The previous week, brokers closed 152 condo sales totaling\n$57 million\n.\nLast week’s units sold for an average of $359,456, lower than the $374,763 average price from the previous week. The average price per square foot fell to $289 from $295, according to data from Redfin.\nFor the top 10 sales, prices ranged from $879,000 to $2.7 million.\nUnit LPH05 at\nSolemar\n, at 1116 North Ocean Boulevard in Pompano Beach, took the top spot with a $2.7 million closing. The sale closed at $1,413 per square foot after 82 days on the market.\nMegan Probst with Compass and Michelle Nunez with Fortune International Realty had the listing. Vince Spadea with Douglas Elliman brought the buyer.\nUnit 1502 at\nL’Hermitage\n, at 3100 North Ocean Boulevard in Fort Lauderdale, closed for the second highest amount, $2.3 million, or $1,103 per square foot, after 61 days on the market.\nPatricia Post with Post &amp; Post handled both sides of the deal.\n\nHere’s a breakdown of the top 10 sales from Mar. 2 to Mar. 9:\nMost Expensive\nSolemar, 1116 North Ocean Boulevard, unit LPH05, in Pompano Beach | Price: $2,725,000 | $1,413 psf | Listing agents: Megan Probst with Compass and Michelle Nunez with Fortune International Realty | Buyer’s agent: Vince Spadea with Douglas Elliman\nLeast Expensive\nBeach Club, 1850 South Ocean Drive, unit 407, in Hallandale Beach | Price: $879,000 | $560 psf | Listing agent: Lidiya Tretyak with Douglas Elliman | Buyer’s agent: Lincoln Migandi with Prive Luxury Realty Group\nHighest Price Per Square Foot\nSolemar, 1116 North Ocean Boulevard, unit LPH05, in Pompano Beach | Price: $2,725,000 | $1,413 psf | Listing agents: Megan Probst with Compass and Michelle Nunez with Fortune International Realty | Buyer’s agent: Vince Spadea with Douglas Elliman\nLowest Price Per Square Foot\nMeritage, 48 Hendricks Isle, unit 2B-A, in Fort Lauderdale | Price: $1,100,000 | $488 psf | Listing agent: Marsha Wachman with Coldwell Banker Realty | Buyer’s agent: Judith Jordan with Berkshire Hathaway HomeServices EWM Realty",
    "related_links": [
      "https://therealdeal.com/miami/2025/03/06/broward-county-weekly-condo-report-21/",
      "https://therealdeal.com/miami/2020/09/29/related-group-launches-sales-of-first-sofla-condo-project-since-2016/",
      "https://therealdeal.com/miami/2024/12/12/broward-county-weekly-condo-report-11/"
    ],
    "market": "South Florida",
    "published": "Thu, 13 Mar 2025 13:45:00 +0000",
    "published_dt": "2025-03-13T13:45:00+00:00",
    "author": "Kate Hinsche"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/13/community-college-district-pays-67m-for-silicon-valley-multifamily/",
    "title": "Community college district pays $67M for Silicon Valley multifamily",
    "subhead": "District chose to buy  94-unit complex at $710M per unit, rather than build student housing",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 13, 2025, 9:24 AM",
    "pub_date_dt": "2025-03-13T09:24:00",
    "content": "A Silicon Valley community college district has decided to pay more than $60 million for affordable apartments in Cupertino, rather than build them for student housing.\nThe Foothill-De Anza Community College District board voted to spend $66.7 million for the 94-unit McClellan Terrace Apartments at 7918 McClellan Road,\nthe Silicon Valley Business Journal reported.\nThe seller is Prometheus Real Estate Group, based in San Mateo, which signed a non-binding letter of intent with the district, which serves students from Palo Alto to San Jose.\nThe pending off-market purchase works out to $709,574 per unit. Colliers is handling the sale.\nFoothill-DeAnza budgeted $28 million for renovations, according to a memo, which will make the complex accessibility compliant and add safety features to the swimming pool.\nIt will finance the acquisition and renovations from an $898 million bond measure approved in 2020.\n\nThe college district had considered building its own student housing until soaring construction costs and a potential delay in plans to move in by 2028 move-in date pushed the district board to opt to buy instead. The cost of a proposed apartment development was not disclosed.\nThe 100,000-square-foot McClellan Terrace Apartments, built in 1971 on 5 acres, has one- and two-bedroom units. The 94-unit property has the potential for 332 beds, not far from the 144-unit and 376-bed apartment building the school had considered building.\nIt’s also closer to Foothill-De Anza Community College than the proposed building site, a seven-minute walk from the college compared to the 4 miles students would have to drive from the undisclosed building site.\nFoothill-DeAnza intends to start renting the apartments to students in August and September, prior to the fall semester.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanjose/news/2025/03/11/foothill-deanza-college-student-housing-cupertino.html",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/08/16/speedy-throckmorton-delivers-san-jose-hotel-housing-project/",
      "https://therealdeal.com/san-francisco/2024/09/23/hawkins-way-pays-46m-for-apartment-complex-in-berkeley/",
      "https://therealdeal.com/san-francisco/2024/07/26/core-spaces-moves-ahead-with-housing-tower-in-berkeley/"
    ],
    "market": "San Francisco",
    "published": "Thu, 13 Mar 2025 13:24:09 +0000",
    "published_dt": "2025-03-13T13:24:09+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/13/crowdstreet-exec-leaves-crowdfunding-platform/",
    "title": "Another CrowdStreet exec heads for the exit",
    "subhead": "Former head of capital markets leaves amid fallout from Nightingale fiasco",
    "authors": "ByKeith Larsen",
    "pub_date": "Mar 13, 2025, 8:00 AM",
    "pub_date_dt": "2025-03-13T08:00:00",
    "content": "Another CrowdStreet executive has left the company.\nBrendan Sparrough, CrowdStreet’s former head of capital markets, has departed the embattled crowdfunding platform for a new position with a real estate private equity firm, according to a post on LinkedIn.\nSparrough is now the second high-level executive to leave CrowdStreet, a platform that allows everyday investors to invest in real estate, in recent weeks.\nCrowdStreet’s former chief investment officer\nIan Formigle\nrecently announced on LinkedIn that he accepted a new role.\nFive employees working as investment managers or analysts left CrowdStreet in February, according to a review of FINRA’s BrokerCheck.\n“Personnel change is inevitable when you are expanding your value proposition and it is no secret CrowdStreet is actively structuring our business model to expand to other asset classes, including with several new executive hires over the past several months. CrowdStreet is evolving,” said a spokesperson for CrowdStreet.\nSparrough played a key role in CrowdStreet’s relationships with institutional clients, leading the company’s capital markets team that sourced and selected deals for the platform.\nSparrough oversaw the origination and closing of over $1.7 billion in equity across more than 100 real estate investments, according to his LinkedIn. He accepted a new position with O’Connor Capital Partners as the head of capital formation.\n\nThe platform has come under pressure from investors because of the Elie Schwartz fiasco. Nightingale Properties CEO Elie Schwartz recently pleaded\nguilty\nto one count of wire fraud where Schwartz acknowledged misappropriating $54 million of CrowdStreet investor funds designated for an acquisition of an office complex in Atlanta and a commercial property in Miami Beach. Schwartz faces up to 20 years in prison.\nInvestors have turned their eye on CrowdStreet in light of Schwartz’s guilty plea. A group of about\n125 investors\nin a Nightingale office project in Chicago filed a claim in arbitration demanding CrowdStreet cover $7.2 million in losses, alleging the firm failed to see clear issues with Nightingale and Schwartz, according to Bisnow.\nCrowdStreet has claimed to be a victim of Schwartz’s fraud and alerted authorities about the wrongdoing.\nIn the summer of 2023, an independent manager for investors in Nightingale’s projects announced in a webinar that most of their money had been misappropriated. Schwartz allegedly used that money for personal expenses and other Nightingale projects. He used $12 million of investor funds to bet on First Republic\nbank’s stock\nand options prior to the bank’s seizure by regulators.\nCrowdStreet came under scrutiny because it failed to require Schwartz to hold the money in a designated escrow account.\nCrowdStreet’s long-time CEO\nTore Steen\nleft the firm weeks after the news of the Nightingale scandal broke. Last year, the firm hired John Imbriglia as the CEO who replaced an interim chief executive.\nSparrough did not return a request to comment.\nCorrection\n:\nA previous version of the story\nmisidentified the name of CrowdStreet’s former chief investment officer\n.\n",
    "related_links": [
      "https://therealdeal.com/new-york/2025/03/11/crowdstreet-chief-investment-officer-leaves/",
      "https://therealdeal.com/new-york/2025/02/13/nightingales-elie-schwartz-pleads-guilty-in-crowdfunding-fiasco/",
      "https://therealdeal.com/chicago/2025/03/07/investors-come-for-crowdstreet-loop-office-deal-as-elie-schwartz-fallout-mushrooms/",
      "https://therealdeal.com/national/2023/09/16/nightingales-elie-schwartz-used-12m-of-investor-funds-to-buy-first-republic-stocks-options/",
      "https://therealdeal.com/national/2023/07/28/tore-steen-out-as-crowdstreet-ceo/",
      "https://therealdeal.com/national/2023/07/18/crowdstreet-responds-after-nightingale-fiasco/",
      "https://therealdeal.com/chicago/2025/03/07/investors-come-for-crowdstreet-loop-office-deal-as-elie-schwartz-fallout-mushrooms/",
      "https://therealdeal.com/new-york/2025/03/11/crowdstreet-chief-investment-officer-leaves/"
    ],
    "market": "National",
    "published": "Thu, 13 Mar 2025 12:00:00 +0000",
    "published_dt": "2025-03-13T12:00:00+00:00",
    "author": "Keith Larsen"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/12/survey-suggests-swap-more-urban-density-for-restrictions-on-wildfire-zones/",
    "title": "Survey suggests swap: more urban density for restrictions on wildfire zones",
    "subhead": "Poll: 55% of voters backed high-density housing in cities in exchange for fewer homes  in fire-prone areas",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 8:00 PM",
    "pub_date_dt": "2025-03-12T20:00:00",
    "content": "Los Angeles County voters favor building dense apartments in urban areas in exchange for allowing fewer homes in fire-prone areas.\nTo compensate for restricting homebuilding in fire-prone communities, county voters backed greater production of high-density housing in urban areas, with 55 percent in support compared to 30 percent opposed,\nthe Los Angeles Times reported\n, citing a new poll.\nThe poll, conducted by the UC Berkeley Institute of Governmental Studies and co-sponsored by the newspaper, found that voters favored boosting funding for fire protection, even if it increased their taxes.\nAn overwhelming majority of county voters also supported strengthening building codes and imposing greater restrictions on home construction in high-risk areas after the January firestorm burned more than\n12,000 homes\nbetween Altadena and the Pacific Palisades.\nSome 80 percent of those polled backed tougher building codes to make homes more fire resistant, even if it added costs.\nSeven out of 10 wanted more regulations to curb homebuilding in wildfire-prone neighborhoods.\n“This is a huge event in L.A. history,” Mark DiCamillo, poll director at UC Berkeley Institute of Governmental Studies, told the Times. “It’s having a major effect on what people think needs to be done in terms of making housing safer.”\nState and local officials have not decided if there will be any building code changes for homes rebuilt from the fires. Codes for new and rebuilt properties in high-risk fire zones now\nrequire significant measures\n, including ignition-resistant materials and multipaned or window upgrades.\n\nThe Berkeley IGS poll found broad backing for a number of policy ideas, including those that would increase taxes to pay for fire protection and build higher-density housing in urban areas.\nThe most popular proposal, with 84% support, was for policymakers to prioritize assistance for low- and middle-income families displaced by the fires.\nNearly two-thirds of voters polled wanted to provide greater funding for city and county fire departments even if that meant raising taxes.\nThe Berkeley IGS poll was conducted online in English and Spanish on Feb. 17-26 among 5,184 registered voters in L.A. County. The survey’s estimated margin of error is 2 percentage points, and larger for demographic subgroups.\nA 2019 Berkeley IGS poll\nsaw support from three-quarters of California voters\n, including 79 percent in L.A. County, for imposing limits on growth in wildfire areas, according to the Times.\nA poll last year from the Los Angeles Business Council Institute\nfound 81 percent of city voters\nbacked speeding approvals for apartment buildings with some affordable housing near public transit and existing high-density, urban areas.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.latimes.com/california/story/2025-03-12/most-angelenos-back-tougher-building-codes-restrictions-on-homebuilding-in-wildfire-zones-poll-finds",
      "https://www.latimes.com/california/story/2025-02-21/real-estate-losses-from-palisades-and-eaton-fires-top-30-billion",
      "https://www.latimes.com/environment/story/2025-02-09/cal-fires-updated-fire-hazard-maps",
      "https://www.latimes.com/politics/la-pol-ca-california-wildfire-housing-rules-poll-20190618-story.html",
      "https://www.latimes.com/homeless-housing/story/2024-05-09/los-angeles-voters-want-more-housing-but-worry-it-wont-help-them-poll-finds",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/03/12/floodgates-open-on-lot-sales-in-la-burn-zones/",
      "https://therealdeal.com/la/2025/03/08/does-recall-effort-against-karen-bass-have-legs/",
      "https://therealdeal.com/la/2025/03/06/industry-navigates-permitting-maze-as-fire-rebuild-begins/"
    ],
    "market": "Los Angeles",
    "published": "Thu, 13 Mar 2025 00:00:00 +0000",
    "published_dt": "2025-03-13T00:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/atlanta/2025/03/12/jamestown-takes-stake-in-atlantas-inman-quarter/",
    "title": "Jamestown’s retail buying spree takes piece of Inman Quarter",
    "subhead": "Atlanta market is experiencing record-low vacancy",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 7:00 PM",
    "pub_date_dt": "2025-03-12T19:00:00",
    "content": "Jamestown’s latest investment move in Atlanta gives it a minority stake in a key mixed-use development.\nThe firm acquired a stake in Inman Quarter, which anchors Inman Park, from TriBridge Residential, the Atlanta Business Chronicle\nreported\n.\nThe 208,000-square-foot development includes 200 apartments and 40,000 square feet of retail, with restaurants like BeetleCat, MF Sushi and Bread &amp; Butterfly.\nTerms of the deal were not disclosed, but the transaction establishes a joint venture with TriBridge, which purchased Inman Quarter for $72.5 million in 2015 alongside Coro Realty Advisors. Coro later sold its stake, leaving TriBridge as the sole owner. At that time, the apartments were 90 percent leased, and the retail was about 85 percent occupied.\nA block from the Atlanta Beltline’s Eastside Trail, Inman quarter has become a popular destination, drawing about 500,000 visitors annually, according to Jamestown, citing property software company Placer.ai.\nJamestown, the firm behind major projects like Ponce City Market and Colony Square, plans to lease out vacant retail spaces and to program events to activate its courtyard.\nAtlanta’s retail market is booming, with a\nrecord-low vacancy\nrate of 3.4 percent, according to Colliers.\n\nDeveloped by JPX Works and South City Partners, Inman Quarter opened over a decade ago, coinciding with the early growth of the Beltline’s Eastside Trail and rising demand for walkable, urban living.\nThe investment reflects a broader strategy in Atlanta, where investors are targeting intown districts for redevelopment.\nRecent deals include Canvas Company’s $6.6 million acquisition of a 17-space portfolio in East Atlanta Village last month and Third &amp; Urban’s $13.75 million acquisition of more than 35,000 square feet at the Virginia-Highlands retail district in December. That deal pencils out to $393 per square foot.\nMeanwhile, New City Properties is\nadvancing its redevelopment\nof the Neuhoff meat-packing plant site, backed by $550 million from JPMorgan and Cousins Properties, adding apartments, office and retail space as part of a significant mixed-use project.\nJamestown has been expanding its footprint in Atlanta. Most recently in August, it\nacquired the local office of North American Properties\n, taking on assets like Colony Square, The Forum Peachtree Corners and Avenue East Cobb.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/atlanta/news/2025/03/10/jamestown-inman-quarter.html",
      "https://therealdeal.com/national/atlanta/2024/03/20/retail-vacancies-fall-to-record-low-in-atlanta-as-rents-soar/",
      "https://therealdeal.com/national/nashville/2025/03/06/germantown-neuhoff-redevelopments-next-phase-revealed/",
      "https://therealdeal.com/national/atlanta/2024/08/14/jamestown-lp-acquires-north-american-properties-atlanta-office/",
      "https://therealdeal.com/national/atlanta/2024/08/14/jamestown-lp-acquires-north-american-properties-atlanta-office/",
      "https://therealdeal.com/national/nashville/2025/03/06/germantown-neuhoff-redevelopments-next-phase-revealed/",
      "https://therealdeal.com/national/atlanta/2025/03/10/atlantas-rg-real-estate-scores-bargain-on-foreclosed-office/"
    ],
    "market": "National",
    "published": "Wed, 12 Mar 2025 23:00:00 +0000",
    "published_dt": "2025-03-12T23:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/12/las-condo-market-drives-luxury-resi-contract-activity/",
    "title": "Condos lead LA luxe resi out of slump",
    "subhead": "West Hollywood unit with $16M ask topped the week’s contracts",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-12T18:30:00",
    "content": "Contract activity in Los Angeles County staged a comeback, with the condominium market last week leading the way out of a sluggish period.\n“This week’s report is all about condos, with our return to normal volumes being bolstered by the $48.2 million in condo contracts signed last week,” said agent Marcy Roth about the Douglas Elliman Eklund Gomes team’s weekly contracts report.\nEklund Gomes’ roundup counts listings on the MLS of $4 million or more.\nCondos, while typically commanding a large share of contracts on any given week, managed to “dominate the market,” said Roth, an Eklund Gomes team member, with an average price listing price of $9.6 million last week across five properties.\nThat compared with single-family residential’s $99.9 million in volume across 17 contracts, according to the Eklund Weekly Luxury Report Los Angeles.\nOn an average price-per-square-foot basis, the condo segment continued to maintain its edge over single-family homes. Condos that went into contract last week had an average price per square foot of $2,277. Single-family contracts last week equated to an average of $1,344 per square foot.\nIn all, last week ended with 22 properties going into contract, totaling $148.2 million in asking dollar volume. That’s up from the slowdown of the past couple weeks, with the prior seven-day period ended March 2\nyielding 13 contracts good for $75.8 million\nin listing price volume.\nWest Hollywood’s\n8899 Beverly residences\nsaw the combined units of 7B/7E go into contract. The property is listed at just under $16 million.\n\nProperty and state records indicate the seller is a San Mateo, Calif.-registered LLC named after the building’s address.\nBrett Oppenheim of Oppenheim Real Estate holds the listing.\nThe property has three bedrooms and five bathrooms across 5,370 square feet, according to the listing. Standouts of the space include panoramic views, 11-foot sliding glass doors, wraparound balconies and over $1 million pumped into upgrades.\nLast week’s second-largest contract based on listing price was another condo, unit 2302 inside The Carlyle.\nColdwell Banker Realty’s\nJade Mills\nand Emanuele Rizzo have the listing located at 10776 West Wilshire Boulevard with a $14.5 million asking price.\nRecords show the unit was last sold in 2014, when Richard and Roselee Benaron bought the property for $7.9 million.\nThe three-bed, five-bath home in L.A.’s Westwood neighborhood is nearly 5,200 square feet and commands a half floor at the building. The unit touts views of the city and ocean, a private elevator, 10- to 12-foot ceilings and a veranda.\n",
    "related_links": [
      "https://therealdeal.com/la/2025/03/04/la-luxury-residential-contract-activity-slows-to-76m/",
      "https://therealdeal.com/la/2023/09/25/eklund-gomes-contract-ends-to-sell-luxe-condos-in-weho/",
      "https://therealdeal.com/la/2024/06/20/qa-with-coldwell-bankers-jade-mills/",
      "https://therealdeal.com/la/2025/03/04/la-luxury-residential-contract-activity-slows-to-76m/",
      "https://therealdeal.com/la/2025/02/25/la-inks-120m-in-signed-resi-contracts/",
      "https://therealdeal.com/la/2025/02/19/will-los-angeles-luxury-real-estate-become-a-buyers-market/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 12 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-12T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/12/can-governments-return-to-office-save-chicago-real-estate/",
    "title": "Will public employees ever come all the way back to the Loop?",
    "subhead": "Government agencies are Chicago’s largest employers but are still mum on return-to-office plans",
    "authors": "ByEmma Whalen",
    "pub_date": "Mar 12, 2025, 5:52 PM",
    "pub_date_dt": "2025-03-12T17:52:00",
    "content": "The push to get public employees back to offices in Chicago is being led by the private sector — and landlords anxious to resuscitate the streets of the Loop aren’t getting much help from City Hall.\nThe Building Owners and Managers Association of Chicago is lobbying Mayor Brandon Johnson to take a clearer stance on the subject and the Chicago Loop Alliance is leading by example, having called its staff back to the office five days a week at the start of the year.\nBut there isn’t much political pressure being levied at City Hall, as downtown aldermen are staying quiet for now. Aldermen who represent the Loop — the 42nd Ward’s Brendan Reilly and Lamont Robinson of the 4th Ward — didn’t respond to requests for comment. Alderman Bill Conway, who also represents part of the Loop, declined to comment.\nThat leaves the industry on its own, with Farzin Parang, head of BOMA in Chicago, trying to rally allies by tying the cause to other concerns of the mayor’s constituents. Elsewhere, mayors are taking the lead on the issue. Most recently, San Francisco\nMayor Daniel Lurie\nordered city desk workers to return to the office at least four days per week by April 28.\n“We urge the mayor to promote a downtown return across all sectors and support policies that boost office occupancy, including reducing the reliance on property tax and improving public transit,” Parang said.\nThe impact of any additional in-office days for government workers could be significant. The City of Chicago alone employs about 10,000 people at offices, with many located in the Loop. Cook County has another 9,000 or so desk employees in the city, and the State of Illinois accounts for thousands more.\nExpecting office occupancy to reach pre-pandemic levels in any city is a stretch, but an influx of thousands of more workers on any given day could have a ripple effect on struggling retailers and support multifamily development, industry insiders say.\nA concerted effort by public sector leadership would supplement the private sector’s push, which has notched some gains for the area but leaves plenty of room for improvement, said John Vance of Chicago retail brokerage Stone Street Real Estate.\n“It would be unfair and wrong to blame the struggles of the Loop on just city of Chicago employees or state of Illinois employees who work in Chicago,” he said. “But they are working for an employer who has a vested interest in making sure that the city of Chicago, and therefore the state of Illinois, does well.”\nWhere RTO policies stand now\nOffice policies across all levels of government in Chicago vary and can be subject to any of the dozens of union contracts dictating certain terms for employers. Representatives of the city of Chicago and the state of Illinois did not respond to repeated requests for comment about work-from-home policies.\nA representative of Cook County said all county employees must work in office at least three days per week. Employees can, however, request exceptions to the schedule from the human resources chief. The county didn’t return a request for the number of exemptions granted.\nAs of January, government office use in Chicago is at 73 percent of pre-pandemic levels according to an Avison Young analysis.\nWith over 48,000 employees, the federal government is the largest employer in the city of Chicago. But tracking various agencies’ office policies is complicated by the current presidential administration’s expansive effort to lay off workers and cut office space by as much as 50 percent.\n\n“These reductions, including the recent planned disposal of the SEC lease at 175 West Jackson Boulevard, could mean a busier government footprint in Chicago, but also a smaller one,” Avison analyst Sean Boyd said.\nThe LaSalle-Wacker corridor, a retail submarket that includes many government buildings and law firms, is one of the lowest performing in the Loop with a 36 percent retail vacancy rate in 2024, Stone Street Real Estate found.\n“[Retailers] need the streets to have a vibrancy and energy and people feeling good because there is a healthy buzz that people create when they are physically here,” Stone Street Real Estate’s Vance said.\nOther areas of the Loop bordering the West Loop and River North have had a faster recovery.\n“Chicago is recovering very unevenly, and if a segment of office that is concentrated recovers dramatically, it’s going to have a huge immediate impact on that submarket,” said Greg Kirsch, founder of retail brokerage Kirsch Agency.\nSeeking other solutions\nMultifamily development also plays a key role in the Loop’s recovery.\nIncreasing its full-time residents will improve retail traffic on evenings and weekends, create easier commutes for some workers and diversify the tax base, said Rob Karr, CEO of the Illinois Retail Merchants Association.\nKarr’s organization isn’t fully on board with requiring in-office schedules; Stone Street Real Estate recently studied three boutique retail corridors through North Side neighborhoods that are flourishing, with little to no vacancy on stretches of Damen, Southport and Armitage avenues.\n“While it’s important we find ways to bring shoppers and workers back downtown throughout the week, we don’t support in-office mandates as no one approach fits the needs of all employers and employees,” Karr said. “It will take collaboration between the business community and policymakers to find creative ways to make downtown a destination once again.”\nA transformation is already underway. Between 2000 and 2022, the Loop’s population grew by 154 percent, according to the Chicago Metropolitan Agency for Planning. Meanwhile, the total population of Chicago declined by 6 percent during the same time period.\nIf the city’s plan to subsidize\noffice-to-multifamily conversions on LaSalle Street\nsucceeds, it will add to the Loop’s residential growth trajectory; developer\nMike Reschke\non Wednesday won Chicago City Council approval for the conversion of five floors of vacant former office space at 208 South LaSalle into 168 apartments with up to $26 million in tax increment financing support from the city, one of several such projects moving forward in the area.\n“The ultimate survival of the Loop as an office destination is going to happen because people live there,” Kirsch said. “There are other markets in the country that have less residential use and they’re going to have a harder time recovering.”\n",
    "related_links": [
      "https://therealdeal.com/san-francisco/2025/02/25/lurie-wants-sf-city-workers-back-4-days-a-week/?cx_testId=9&cx_testVariant=cx_1&cx_artPos=0&utm_source=piano-recommended&utm_medium=after-article#cxrecs_s",
      "https://therealdeal.com/chicago/2024/03/04/chicago-mayor-moving-ahead-with-lasalle-street-redo/",
      "https://therealdeal.com/magazine/june-2024/the-closing-mike-reschke/",
      "https://therealdeal.com/national/seattle/2025/02/14/amazon-return-to-office-boosts-sidewalk-traffic-in-seattle/",
      "https://therealdeal.com/national/2025/01/20/remote-work-and-real-estate-five-years-after-pandemic/"
    ],
    "market": "Chicago",
    "published": "Wed, 12 Mar 2025 21:52:30 +0000",
    "published_dt": "2025-03-12T21:52:30+00:00",
    "author": "Emma Whalen"
  },
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/12/houstons-texas-tower-hits-99-leased-with-law-firm-signing/",
    "title": "Law firm lease brings Hines’ Texas Tower to 99 percent occupied",
    "subhead": "47-story building co-owned by Ivanhoe Cambridge was delivered in 2021",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 5:45 PM",
    "pub_date_dt": "2025-03-12T17:45:00",
    "content": "A law firm lease will bring Hines’ Texas Tower to 99 percent leased.\nSkadden, Arps, Slate, Meagher &amp; Flom leased 52,000 square feet spanning two full floors at 845 Texas Avenue, the Houston Business Journal\nreported\n. The lease will begin in April 2026, but the terms weren’t otherwise disclosed.\nThe deal leaves just 18,000 square feet available in the 47-story, 1.2 million-square-foot tower, which is co-owned by Houston-based Hines and Ivanhoe Cambridge. Savills’ Mark O’Donnell represented the tenant, and Michael Anderson of Cushman &amp; Wakefield represented the landlords.\nThe lease follows Hines’\nlanding a rare $450 million refinancing\nearlier this month, marking the first time in two years a multi-tenant office tower outside New York City was financed through the CMBS single-asset, single-borrower market.\nSkadden will move from its 24,000-square-foot space at 1000 Louisiana Street, Wells Fargo Plaza.\nThat 71-story tower was built in 1983. Its owner, MetLife, plans to spend $138,000 to remodel its 900-square-foot\namenity space\nfor an arcade game room to lure tenants after adding a golf simulator last year. It is also adding a restaurant, bar and tenant lounge, according to the building’s website.\nTexas Tower opened in 2021 and is among the city’s most leased Class A office towers. Other tenants, with Hines’ global headquarters, include law firms Vinson &amp; Elkins, Clifford Chance and DLA Piper as well as Cheniere Energy, Morgan Stanley and coworking space The Square.\n\nThe tower includes two restaurants managed by Berg Hospitality Group. The Sylvie, a French bistro, opened last year. Seafood restaurant Dune Road was set to open last year but hasn’t yet delivered.\nIt also features amenities like underfloor air conditioning, private terraces and a 9,600-square-foot amenity center with a lounge and conference space.\nThe tower’s leasing success highlights the “flight-to-quality” trend, Hines senior managing director John Mooz said.\nClass A inventory has tightened in the city as tenants opt to lease where amenities are enticing enough to lure and retain workers. Older buildings have suffered as a result. The office vacancy rate remains high; it was up to 25.7 percent in the fourth quarter, according to CoStar.\nHouston’s office pipeline has 1.9 million square feet of space under development, about tied with Los Angeles as of January, according to data from CommercialEdge cited by\nCommercialCafe\n. Dallas has 2.8 million square feet underway, and Austin has 3.6 million, the second-most in the nation behind Boston.\nThe drop in office output from previous years across southern markets will likely have a positive effect on occupancy rates, especially as more employers initiate return-to-office mandates, the site said.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/houston/news/2025/03/12/texas-tower-signs-lease-law-firm-sadden-arps.html",
      "https://therealdeal.com/texas/houston/2025/03/03/hines-texas-tower-lands-450-million-refinancing/",
      "https://www.bizjournals.com/houston/news/2025/02/26/wells-fargo-plaza-to-add-arcade-suite.html",
      "https://www.commercialcafe.com/blog/office-pipeline-report/",
      "https://therealdeal.com/texas/houston/2025/03/03/hines-texas-tower-lands-450-million-refinancing/",
      "https://therealdeal.com/texas/houston/2025/02/27/granite-properties-office-tenant-doubles-energy-corridor-lease/",
      "https://therealdeal.com/texas/houston/2025/03/12/skanskas-houston-tower-lands-law-firm-headquarters-lease/"
    ],
    "market": "Texas",
    "published": "Wed, 12 Mar 2025 21:45:00 +0000",
    "published_dt": "2025-03-12T21:45:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/12/bh3-proposes-844-units-for-dna-towers-in-flagler-village/",
    "title": "BH3 adds 200-plus units to its planned two-tower DNA project in Fort Lauderdale’s Flagler Village",
    "subhead": "Developer now proposes 844 units, up from 612",
    "authors": "ByLidia Dinkova",
    "pub_date": "Mar 12, 2025, 5:30 PM",
    "pub_date_dt": "2025-03-12T17:30:00",
    "content": "BH3 Management proposes 844 units at its two-tower project in Fort Lauderdale’s Flagler Village, up 38 percent from its previous plan.\nFort Lauderdale-based BH3 raised the number of units from 612 and made both towers 45 stories, rather than one 45-story tower and one 40-story tower, according to the city’s Development Review Committee meeting agenda. As a whole, the project’s overall square footage remains the same, as BH3 added more units but decreased the average unit size. The commercial space also was scaled down to 12,200 square feet from 72,200 square feet.\nThe Development Review Committee evaluated the new proposal at its meeting on Tuesday. Next, BH3 will incorporate feedback from the committee and the city’s planning department into its site plan, which will be filed to the city, according to a source familiar with the process. City commissioners will have a final say on the changes at a yet unscheduled meeting.\nBH3 hasn’t yet decided if the units will be condos or apartments, according to the source.\n\nThe DNA project has been in the works since at least 2022. Records show BH3 owns the development site, having paid $23.1 million for it in 2019.\nBH3\n–– led by co-founders Daniel Lebensohn and Gregory Freedman and executive chairman Eric Edidin –– is a real estate development firm. Its projects include the two-tower, 16-story, 160-unit\nPrivé at Island Estates\non an 8-acre island in Aventura.\nDevelopers have seized on downtown Fort Lauderdale, including the\nFlagler Village\narea.\nIn December, BAM Property Development scored approval for a pair of 14-story buildings with\n257 apartments\n, combined, at 650 North Andrews Avenue.\nElsewhere in downtown Fort Lauderdale, developers Steve Hudson and Charlie Ladd plan the 12-story\nWhitfield\nboutique project with 81 hotel keys and 17 penthouse condos at 1007 East Las Olas Boulevard. Penthouses start at $15 million.",
    "related_links": [
      "https://therealdeal.com/tag/bh3/",
      "https://therealdeal.com/miami/2020/06/26/prive-at-island-estates-developer-sues-suffolk-construction-over-defects/",
      "https://therealdeal.com/tag/flagler-village/",
      "https://therealdeal.com/miami/2024/12/20/bam-advances-257-unit-multifamily-project-in-fort-lauderdale/",
      "https://therealdeal.com/miami/2025/01/10/hotel-and-condos-planned-for-fort-lauderdales-las-olas/"
    ],
    "market": "South Florida",
    "published": "Wed, 12 Mar 2025 21:30:00 +0000",
    "published_dt": "2025-03-12T21:30:00+00:00",
    "author": "Lidia Dinkova"
  },
  {
    "url": "https://therealdeal.com/miami/2025/03/12/flagstar-bank-targets-south-beach-store-in-foreclosure/",
    "title": "Collins Avenue retail storefront targeted in $6M foreclosure",
    "subhead": "Flagstar Bank alleges Brooklyn-based landlord missed monthly payments since January",
    "authors": "ByFrancisco Alvarado",
    "pub_date": "Mar 12, 2025, 5:00 PM",
    "pub_date_dt": "2025-03-12T17:00:00",
    "content": "The retail woes along a stretch of Collins Avenue in South Beach have sparked a foreclosure lawsuit against a storefront owner that allegedly owes $5.5 million to a lender.\nLast week, Troy, Michigan-based Flagstar Bank sued Brooklyn resident Zipporah Goldstein and her entity that owns nine ground-floor commercial units of a three-story condominium at\n751 Collins Avenue\n, records show. The commercial space spans 3,615 square feet.\nGoldstein, an Auschwitz concentration camp survivor according to published reports, bought the storefront in 2015 for $10 million, partially financing the purchase with a $6.3 million mortgage from New York Community Bank, records show. Last year, the financial institution rebranded as Flagstar Bank.\nGoldstein and Flagstar Bank’s lawyer did not respond to requests for comment.\n\nGoldstein’s entity bought the commercial units from Aldo Shoes, which leased back the property until 2020, when the shoe retailer moved out. The space has been vacant since the landlord placed the units on the market in December with an undisclosed asking price. The storefront is being marketed by Miami Beach-based\nInHouse Commercial Sales\n.\nGoldstein’s entity allegedly defaulted on the loan by allegedly missing payments since January, as well as failing to pay property insurance and property taxes, the complaint alleges. The borrower also allegedly failed to notify the bank about the death of co-guarantor Leon Goldstein, Zipporah Goldstein’s husband.\nThe $5.5 million mortgage debt includes interest and fees, the lawsuit states.\nCompleted in 1952, the building also includes seven residential condo units that are not targeted in the foreclosure and are owned by entities unrelated to Goldstein, records show.\nInHouse Commercial is marketing the retail space as a possible package deal for six storefronts in\nArt Deco\nbuildings on a six-block stretch of Collins Avenue from Sixth Street to 12th Street. The asking price for the assemblage is more than\n$50 million\n.",
    "related_links": [
      "https://therealdeal.com/miami/2015/12/22/aldo-sells-retail-condo-on-collins-avenue-leases-back-space/",
      "https://therealdeal.com/miami/2022/05/31/movers-shakers-inhouse-commercial-launches-i-sales-division-more/",
      "https://therealdeal.com/tag/art-deco/",
      "https://therealdeal.com/miami/2024/12/04/collins-avenue-assemblage-hits-market-for-50m/"
    ],
    "market": "South Florida",
    "published": "Wed, 12 Mar 2025 21:00:00 +0000",
    "published_dt": "2025-03-12T21:00:00+00:00",
    "author": "Francisco Alvarado"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/12/jamison-scores-50m-refi-for-koreatown-apartment-complex/",
    "title": "Jamison scores $50M refi for Koreatown apartment complex",
    "subhead": "Affinius provides loan for 157-unit building that opened two years ago",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-12T16:30:00",
    "content": "Jamison Services has landed a $50 million loan to refinance a 157-unit apartment building in Koreatown.\nThe unit of locally based Jamison Realty led by Jaime Lee secured the refinancing for The Roya, the six-story complex that opened two years ago at 760 Serrano Avenue,\nCommercial Observer reported.\nThe lender was Affinius Capital. Terms of the deal, as well as any brokers involved in the transaction, were not disclosed.\nThe Roya complex is expected to benefit from a tailwind of strong demand, mainly due to its walkable location within central Los Angeles and nearby shopping options, according to Tom Burns, managing director for Affinius.\n“The property has already been well received by the market, and we expect it to continue to perform,” he told CO.\nThe Roya, 3.8 miles west of Downtown Los Angeles, has 157 studios, and one- and two-bedroom apartments. The complex has a resident lounge, coworking areas, a fitness center, karaoke room, pool deck and spa and a roof deck with fire pits.\nJamison Services, founded in 2006 by Dr. David Lee, is among the largest multifamily investors in Los Angeles.\n\nThe Jamison family of companies has $3 billion in assets under management, including 18 million square feet of commercial and medical office, retail, multifamily and mixed-use properties, according to its website.\nWithin the past year, the firm has hit financial headwinds.\nIn December, a 163,170-square-foot office complex owned by Jamison Properties at 16530 Ventura Boulevard in Encino was\nheaded toward receivership\n,\nThe Real Deal\nreported.\nA month earlier, a  $35.4 million commercial mortgage-backed securities loan tied to a 340,000-square-foot office building owned by Jamison at 811 Wilshire Boulevard in Downtown was\nsent to special servicing\n, according to\nTRD\n.\nAt the same time, Koreatown’s biggest office landlord\ndefaulted on an $86.5 million commercial mortgage-backed securities loan\ntied to a 34-story office tower at 3435 Wilshire Boulevard, in Koreatown.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://commercialobserver.com/2025/03/affinius-50m-refi-los-angeles-multifamily-apartment/",
      "https://therealdeal.com/la/2024/12/12/judge-could-send-jamisons-the-atrium-to-receivership/",
      "https://therealdeal.com/la/2024/11/15/jamisons-35m-loan-on-la-building-goes-to-special-servicing/",
      "https://therealdeal.com/la/2024/11/05/jamison-defaults-on-85m-loan-for-ktowns-equitable-plaza/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/12/12/judge-could-send-jamisons-the-atrium-to-receivership/",
      "https://therealdeal.com/la/2024/11/15/jamisons-35m-loan-on-la-building-goes-to-special-servicing/",
      "https://therealdeal.com/la/2024/11/05/jamison-defaults-on-85m-loan-for-ktowns-equitable-plaza/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 12 Mar 2025 20:30:41 +0000",
    "published_dt": "2025-03-12T20:30:41+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/12/suburban-chicagos-pie-house-quickly-sells-for-asking-price/",
    "title": "Deerfield’s “Pie House” brings in dough",
    "subhead": "Home famous for wedge design quickly sold for asking price",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 4:30 PM",
    "pub_date_dt": "2025-03-12T16:30:00",
    "content": "An offbeat home sale in Deerfield shows there’s always appetite for a slice of something different.\nThe suburb’s famous “pie house,” named for its wedge-shaped design, sold for its $350,000 asking price, $55,000 more than it asked\ntwo years ago\n, the Chicago Tribune\nreported\n.\nThe 1,100-square-foot home gained national fame in August 2020 when a TikToker pointed out its triangular design. It has since earned sporadic media attention, including a shout-out from Jimmy Fallon on “The Tonight Show.”\nBuilt in 2003, the home’s unusual shape was a necessity born from its 0.09-acre lot. It initially drew some complaints from neighbors but later became a local curiosity. The house has an unconventional design despite appearing fairly traditional from the front, with its seven windows and a door. A view from the side reveals a wall only 3 feet wide, from which the remaining walls extend outward at an acute angle, like a slice of pie.\nIt was developed by Greg Weissman, then-owner of Advantage Properties, now a broker for @properties Christie’s International Real Estate in Northbrook. It has finally hit above the $325,000 price point\nWeissman hoped to sell it for in 2003\n.\nIt hit the market in September, finding a buyer just two days later.\n\nThe buyer was Tanaka Littlepaige, a manager at the world’s largest derivatives exchange, Chicago-based CME Group, according to county records.\nThe seller was Abigail Drazner, an operations project manager at insurance and financial services firm Alera Group, who bought the home in 2020. For a few months in 2020 it was listed as a short-term rental, offering free pizza for the first booker.\nTed Pickus and Lisa Schulkin had the listing, and Beth Wexler represented Littlepaige, all agents with @properties Christie’s.\nThe two-bedroom, 2.5-bathroom house includes 9-foot ceilings, hardwood floors, stainless steel appliances and a paver brick walkway. It also features a storage shed and a parking pad that accommodates up to four cars, though it lacks a garage. The home has one bedroom upstairs and another in the basement.\nThe property has changed hands multiple times over the years, with the latest sale price comfortably topping its 2021 price of $295,000. Previous sale prices included $300,000 in 2004, $284,500 in 2007, and $260,000 in 2020. Its property taxes for 2023 were $8,014.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/chicago/2022/01/31/suburban-deerfield-pie-house-sells-for-300k/",
      "https://www.chicagotribune.com/2025/03/10/deerfield-pie-house/",
      "https://www.chicagotribune.com/2003/09/25/pie-house-half-baked-some-think/",
      "https://therealdeal.com/chicago/2022/01/31/suburban-deerfield-pie-house-sells-for-300k/",
      "https://therealdeal.com/la/2025/02/11/studio-shamshiri-designed-brentwood-property-asks-40m/",
      "https://therealdeal.com/chicago/2024/02/08/deerfield-oks-effective-ban-on-large-industrial-developments/"
    ],
    "market": "Chicago",
    "published": "Wed, 12 Mar 2025 20:30:00 +0000",
    "published_dt": "2025-03-12T20:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/12/d-r-hortons-forestar-buys-land-for-home-lots-near-galveston/",
    "title": "DR Horton’s Forestar targets Gulf Coast population growth",
    "subhead": "Bought acreage between Houston and Galveston",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 12, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-12T16:00:00",
    "content": "Forestar is planning 90 homes between Houston and Galveston after its latest land buy.\nThe subsidiary of Arlington-based homebuilder D.R. Horton picked up a 30-acre parcel along Davis Road in League City, according to a news release from Colliers.\nThe seller was Houston-based Broad Reach Capital, deed records show. Colliers’ Chris Hutcheson, Harrison Kane and James Kadlick represented Broad Reach Capital.\nThe purchase came on the heels of a\ntender offer\nfrom Forestar. The company offered shareholders cash to purchase outstanding 3.85 percent senior notes due. Forestar received offers for 83 percent of the notes, amounting to $329.4 million.\nOther big names in development have also been turning dirt for single-family development in League City.\nHillwood Communities started construction on Legacy by Hillwood, between Interstate 45 and FM 528, a year ago. It was the Dallas-based developer’s third community in the Houston area.\n\nAt full build-out, the 805-acre community will feature 1,600 homes, an elementary school and amenities like pools, a recreation center and launch areas for kayaks and paddleboards.\nLike other far-flung suburbs of major Texas cities, League City is experiencing a wave of growth. In 15 years, its population has nearly tripled to 122,000 people; 40 percent of the city is still undeveloped.\nThe city is preparing for an influx of development with drainage improvements to address flooding and by upgrading the League City waterline, which comes from Houston.\nForestar sold more than 15,000 residential lots last year. The company operates in 24 states, according to its website, but its focus is on communities in the Sunbelt. D. R. Horton acquired a majority stake in Forestar in 2017.\n",
    "related_links": [
      "https://www.businesswire.com/news/home/20250312913496/en/Forestar-Group-Inc.-Announces-Expiration-and-Final-Results-of-Tender-Offer-for-Any-and-All-of-its-3.850-Senior-Notes-due-2026",
      "https://therealdeal.com/texas/houston/2024/11/26/satya-is-breaking-ground-on-galvestons-first-condo-in-15-years/",
      "https://therealdeal.com/texas/dallas/2024/01/26/stillwater-forestar-buy-former-storybuilt-site-in-dallas/"
    ],
    "market": "Texas",
    "published": "Wed, 12 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-12T20:00:00+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/national/phoenix/2025/03/12/kenco-takes-up-642k-sf-warehouse-outside-phoenix/",
    "title": "Kenco leases 642K sf distribution warehouse outside Phoenix",
    "subhead": "Southwest Valley submarket around Buckeye “attracting a lot of high-quality, national tenants”",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-12T16:00:00",
    "content": "Kenco has leased a 641,900 square-foot warehouse west of Phoenix, where the logistics market is booming.\nThe Tennessee-based logistics firm inked a deal for the industrial building at 440 North 215th Avenue, in Buckeye, about 35 miles from Phoenix,\nthe Phoenix Business Journal reported\n.\nTerms of the deal with landlord EQT Exeter, based in Pennsylvania, were not disclosed.\nKenco was represented in the lease by brokers Barrett Bufkin, William Martin and Eric Walker of Cresa. Brokers Michael Haenel, Andy Markham and Phil Haenel of Cushman &amp; Wakefield represented EQT Exeter.\nThe renter will use the two-year-old building for warehousing and distribution across the western U.S.\nIn August, Kenco and a division of British Petroleum won\npermission to store petroleum products\nat a 168,000-square-foot facility in Surprise, about 22 miles northwest of Phoenix.\nIn April, EQT Exeter bought the Buckeye warehouse now known as I-10 Gateway for $60.1 million, or $94 per square foot.\nThe Southwest Valley’s industrial submarket “is really, really favorable and attracting a lot of high-quality, national tenants,” Scott Guo, investment and leasing officer for EQT Exeter, told the Business Journal.\n\nHe said large firms such as Kenco are looking to either relocate from California’s Inland Empire, the heart of the Western U.S. industrial distribution market, or are looking to expand their footprints.\nProximity to California ports was “really important for these guys,” Guo said, while the Buckey warehouse’s direct access to Interstate 10 was a “very, very big competitive advantage when they were weighing other buildings that they could have otherwise leased.”\nAcross all submarkets, the Southwest Valley outside Phoenix had the\nmost industrial square footage\ncompleted or under construction in the fourth quarter, according to CBRE.\nSome 87 percent of the 3.2 million square feet of industrial warehouses completed last quarter was in the southwest region. At the same time, 9.7 million square feet were under construction, or 61 percent of the 15.9 million square feet being built across greater Phoenix.\nEQT Exeter, founded in 2006 as Exeter Property Group, has more than $30 billion in assets under management, including more than 2,000 properties and 375 million square feet of warehouses, office and life sciences buildings and homes, according to its website.\nIn early 2021, Swedish private equity manager EQT AB acquired Exeter Property Group and renamed it EQT Exeter, which serves as its real estate arm.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/phoenix/news/2025/03/11/new-west-valley-industrial-lease.html",
      "https://www.bizjournals.com/phoenix/news/2024/07/29/evergreen-surprise-az-bp-kenco-petroleum-storage.html",
      "https://mktgdocs.cbre.com/2299/3359a5c3-2c45-411b-8a98-9ff3fb9f481c-150757114/Phoenix_Industrial_Figures_Q4_.pdf",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/national/phoenix/2025/03/05/mayo-clinic-goes-big-with-1-9b-phoenix-hospital-expansion/",
      "https://therealdeal.com/national/phoenix/2025/02/03/cypress-eyes-234k-spec-medical-office-campus-in-phoenix/",
      "https://therealdeal.com/national/phoenix/2025/01/29/aeneas-pays-17-million-for-phoenix-warehouse-in-foreclosure/"
    ],
    "market": "National",
    "published": "Wed, 12 Mar 2025 20:00:00 +0000",
    "published_dt": "2025-03-12T20:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/12/doge-cancels-affordable-housing-deals-in-anti-dei-push/",
    "title": "DOGE cancels affordable housing deals in anti-DEI push",
    "subhead": "Millions of dollars in contracts withdrawn under Elon Musk’s initiative",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 3:33 PM",
    "pub_date_dt": "2025-03-12T15:33:00",
    "content": "The Trump administration’s anti-DEI crusade is hitting affordable housing groups across the country.\nAfter a review by Elon Musk’s Department of Government Efficiency, millions of dollars of federal contracts in the sector were canceled, Bloomberg\nreported\n. DOGE staff determined which contracts to cut by searching nonprofit websites and LinkedIn pages for terms associated with diversity, equity and inclusion.\nThe contracts were cut in February after DOGE directed the U.S. Department of Housing and Urban Development to inform nonprofits if they were “not in compliance with the Executive Order titled ‘Ending Radical and Wasteful Government DEI Programs and Preferencing.’”\nProjects in more than 1,000 communities were affected by the canceled contracts. The projects involved addressing homelessness, disaster recovery, persistent poverty and more housing issues.\nAt least eight national organizations saw technical assistance contracts canceled, taking away grants for consulting on tools, coordination and systems. Two of the three groups that administer Section 4 — which provides support for capacity-building and community development and requires recipients to “advance housing justice” and “support underserved communities,” according to HUD — had awards eliminated too.\nThe nonprofit\nLocal Initiatives Support Corporation\nhad all of its technical assistance and Section 4 awards canceled, according to the organization. The $30 million in lost contracts included providing first-time homebuyer support in the Mississippi Delta to local teachers.\n\nEnterprise Community Partners, a national nonprofit\nrun by former HUD secretary Shaun Donovan\n, had four contracts canceled, including a $32 million reward under Section 4, for which the nonprofit would redistribute funds to groups that build and preserve affordable housing.\nDonovan said the cuts “will raise costs for families, hobble the creation of affordable homes, forfeit local jobs, and sap opportunity from thousands of communities in all 50 states.”\nThe third group that administers Section 4, Habitat for Humanity, did not appear to be affected by the cuts; its website describes the group as a nonprofit ecumenical Christian organization.\nWhile HUD acquiesced to the cuts, the agency said it was planning to allow appeals and is now communicating that process with grantees.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.bloomberg.com/news/articles/2025-03-11/doge-cuts-contracts-to-affordable-housing-groups-who-mention-dei-words?srnd=phx-industries-real-estate",
      "https://therealdeal.com/new-york/2024/10/23/hpd-launches-renovation-loan-program-for-new-york-city/",
      "https://therealdeal.com/new-york/2023/06/05/shaun-donovan-named-ceo-of-major-housing-nonprofit/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/new-york/2024/10/23/hpd-launches-renovation-loan-program-for-new-york-city/",
      "https://therealdeal.com/new-york/2023/06/05/shaun-donovan-named-ceo-of-major-housing-nonprofit/",
      "https://therealdeal.com/miami/2019/10/18/minority-real-estate-professionals-still-fight-racial-and-gender-barriers-trd-miami-showcase-forum/"
    ],
    "market": "National",
    "published": "Wed, 12 Mar 2025 19:33:17 +0000",
    "published_dt": "2025-03-12T19:33:17+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/12/mansion-in-chicagos-lincoln-park-sells-at-steep-loss/",
    "title": "Lincoln Park mansion sells for $2.3M loss",
    "subhead": "Sale of Dirk Lohan-designed home is still among this year’s priciest transactions",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 3:04 PM",
    "pub_date_dt": "2025-03-12T15:04:00",
    "content": "A mansion in Chicago’s Lincoln Park has sold for $5.8 million, marking a $2.3 million loss for its sellers just three years after they purchased it, Crain’s\nreported\n.\nThe five-bedroom home at 1856 North Mohawk Street, designed by architect Dirk Lohan,\nsold for $8.1 million in March 2022\n. Spanning 8,700 square feet on less than a quarter acre, it sold then for about $931 per square foot, and now for about $667 per square foot.\nThe sellers listed it\n14 months after they bought it for $8.2 million\n, but price cuts over time brought the asking price down to $6.39 million.\nThe property went under contract in February and closed last week. The sellers’ names are hidden behind a land trust.\nThe buyers, not yet revealed in public records, were represented by Compass agents Eudice Fogel and Jayme Slate. Emily Sachs Wong of @properties Christie’s International Real Estate had the listing.\nThe sale price still ranks as the seventh-highest for a Chicago-area home so far this year.\n\nIt includes a four-car garage, elevator, rooftop deck with a metal pergola and a walled courtyard.\nA highlight is the staircase, designed as a modern homage to the iconic metal staircase legendary Chicago architect Ludwig Mies van der Rohe created for the Arts Club. Lohan, the home’s architect, is Mies’ grandson.\nLohan designed the house for lumber scion Harry Seigle, who sold his family’s lumber and home supply business in 2005 for $121 million. The architect is known for designing prominent structures like the former\nMcDonald’s headquarters in Oak Brook\nand the Shedd Aquarium’s Abbott Oceanarium.\nOthers among Chicago’s top home sales so far this year include a Gold Coast penthouse at Elm &amp; State that sold for over $10 million. It was previously owned by former Fortune Brands CEO Bruce Carbonari. In Winnetka, two $12 million homes\nsold last week\nin addition to a\n$35 million mansion at 419 Sheridan Road\n, sold by former Goldman Sachs partner Muneer Satter in February.\nLuxury homes in Chicago often sell for less than their last transaction. Most of the market’s\npriciest homes last year\ntraded for under their previous price.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/residential-real-estate/lincoln-park-mansion-sells-23m-its-2022-price",
      "https://therealdeal.com/chicago/2022/03/25/lumber-scion-harry-seigle-sells-lincoln-park-mansion-for-8-1-million/",
      "https://therealdeal.com/chicago/2023/05/18/mohawk-street-mansion-asks-8-2m-a-year-after-last-sale/",
      "https://therealdeal.com/chicago/2019/06/05/billionaire-john-paul-dejoria-picks-up-80-acre-former-mcdonalds-campus-in-oak-brook/",
      "https://therealdeal.com/chicago/2025/03/10/two-12-million-mansions-sell-in-chicago-suburb-winnetka/",
      "https://therealdeal.com/chicago/2025/02/04/35-million-listing-in-suburban-chicago-has-a-buyer/",
      "https://therealdeal.com/chicago/2024/12/26/chicagos-most-expensive-home-sales-of-2024/",
      "https://therealdeal.com/chicago/2022/03/25/lumber-scion-harry-seigle-sells-lincoln-park-mansion-for-8-1-million/",
      "https://therealdeal.com/chicago/2025/03/10/two-12-million-mansions-sell-in-chicago-suburb-winnetka/",
      "https://therealdeal.com/chicago/2025/02/04/35-million-listing-in-suburban-chicago-has-a-buyer/"
    ],
    "market": "Chicago",
    "published": "Wed, 12 Mar 2025 19:04:05 +0000",
    "published_dt": "2025-03-12T19:04:05+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/12/floodgates-open-on-lot-sales-in-la-burn-zones/",
    "title": "Floodgates open on lot sales in LA burn zones",
    "subhead": "49 burned lots up for sale in Pacific Palisades, 32 in Altadena: Zillow",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-12T14:30:00",
    "content": "The owners of scores of torched homes from Altadena to the Pacific Palisades are cashing out.\nA forecast landslide of listings related to the January firestorms that burned more than\n12,000 homes\nin Los Angeles County has picked up speed,\nthe Los Angeles Times reported\n.\nIn late January, the first vacant lot was put up for sale in Altadena. Then more than a dozen lots were listed last month in the Pacific Palisades for\nbetween $2 million and $8 million\n, with the first lot closing at $1.2 million.\nNow the floodgates appear to have opened, according to the Times. Owners of blackened lots are increasingly choosing to sell rather than slog through the time-consuming and costly task of rebuilding.\n“There [are] so many to choose from,” Jeremy Hardy, a broker with Craig Estates &amp; Fine Properties, told the Times.\nAs of early Monday, there were 49 burned lots listed in Pacific Palisades, and 32 up for sale in Altadena, according to Zillow.\nThe reasons for choosing to sell are varied, real estate agents say. Some owners don’t think they have the money to rebuild, while others are aging and don’t want their last years tied up with construction.\n\nSome with rental properties concluded that keeping them wasn’t worth the hassle.\nMost of those interested in acquiring the burned lots are developers, agents say. Builders generally have the cash to buy vacant land. They can also put up with time, aggravation and costs associated with construction.\n“Building a house is one of the most complex and highly regulated activities you possibly can engage in,” Brock Harris, a Keller Williams agent with the first scorched lot listing in Altadena, which sold to a builder, told the Times.\nA rush by developers could help neighborhoods build back quicker.\nThey’re also raising concerns about gentrification and whether longtime owners are getting a fair price for their lots. In\nmiddle-class Altadena\n, residents proclaimed, “Altadena is not for sale.”\nAt least eight burned lots have been sold in the area with most selling for between $500,000 and $600,000, according to Zillow. Agents said the lots are going for two-thirds of what the typical land fetched before the fire.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.latimes.com/california/story/2025-02-21/real-estate-losses-from-palisades-and-eaton-fires-top-30-billion",
      "https://www.latimes.com/california/story/2025-03-12/burned-lot-sales",
      "https://therealdeal.com/la/2025/02/21/estimate-pegs-palisades-land-listings-to-rise-as-high-as-750/",
      "https://www.latimes.com/california/story/2025-02-11/altadena-faces-a-crossroads-to-rebuild-or-to-leave",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2025/02/21/estimate-pegs-palisades-land-listings-to-rise-as-high-as-750/",
      "https://therealdeal.com/la/2025/03/08/does-recall-effort-against-karen-bass-have-legs/",
      "https://therealdeal.com/la/2025/03/06/industry-navigates-permitting-maze-as-fire-rebuild-begins/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 12 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-12T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/12/westfield-to-list-two-office-buildings-next-to-sf-mall/",
    "title": "Westfield to sell two office buildings next to DTSF zombie mall",
    "subhead": "French firm marketing vacant buildings as redevelopment play for housing tower",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 2:30 PM",
    "pub_date_dt": "2025-03-12T14:30:00",
    "content": "Unibail-Rodamco-Westfield, which walked away rather than pay the tab for the beleaguered Westfield San Francisco Centre mall, wants to sell the office buildings next door for housing.\nThe French conglomerate is about to list the 77,000-square-foot building at 814 Mission Street and the 28,000-square-foot building at 818 Mission Street near Union Square for an undisclosed price,\nthe San Francisco Chronicle reported\n.\nNearly 20 years ago, Westfield bought the side-by-side buildings between Jessie and Fourth streets for a combined $42 million, or $400 per square foot.\nThe vacant buildings are set to hit the market this month, and could sell for less than half their last traded price. Recent office sales in the area have reset the market at between\n$100 to $200 per square foot\n.\n“Pricing will be in line with other office buildings that have recently sold in Mid-Market,” broker Darren Kuiper of Colliers, working to sell the buildings for Westfield, told the Chronicle. The  listing is shared by brokers Tony Crossley and Robert Gilley of Colliers, and Bruce Carlson of Kennedy Wilson.\nKuiper said Westfield hired Chicago-based SOM to evaluate the combined sites for redevelopment into housing, saying that under current density bonus laws, a 365-foot tower with 400 units was possible.\nBrokers said the Mission Street buildings can be sold separately or together and could be paired with the former Westfield mall next door,\nnow operated by a receiver\n. Its foreclosure auction was\ncanceled last month\nand is now slated for March 27.\nIt was in June 2023 that Paris-based Unibail-Rodamco-Westfield and New York-based Brookfield Properties abandoned the city’s largest mall rather than pay its $558 million mortgage loan.\n\nThe owners of the nine-story, 1.5 million-square-foot mall with 170 stores at 865 Market Street pointed to a plunge in shoppers and sales post-pandemic.\nAt the same time, Seattle-based Nordstrom was poised to pull out of the half-empty mall, citing “unsafe conditions” for leaving a\n312,000-square-foot\nhole.\nThe part of downtown surrounding the mall has been\nchallenged\nwith quality-of-life and safety issues in the wake of the pandemic. A Denny’s on the ground floor of 818 Mission for nearly two decades\nclosed last year\n, adding to its vacant storefronts.\nA purchase of the vacant offices owned by Westfield would be a long-term play, brokers say.\nDespite the area’s challenges, it has “a lot of great infrastructure,” Carlson of Kennedy Wilson told the Chronicle, highlighting nearby parking, bus and BART stations, museums and the Moscone Convention Center. “The bones are there.”\n“The question is, are people OK with grabbing a big site like this and then waiting?” Kuiper of Colliers posed to the newspaper. “Because it may take five-plus years for the development world to come back, maybe longer.\n“But there are not a lot of high-rise opportunities in this kind of location with the ability for the builder to go really tall and do housing.”\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/realestate/article/sf-westfield-centre-housing-20210497.php",
      "https://www.sfchronicle.com/realestate/article/sf-office-prices-downtown-20034708.php",
      "https://therealdeal.com/san-francisco/2023/10/11/judge-names-receiver-for-westfield-san-francisco-centre/",
      "https://therealdeal.com/san-francisco/2025/02/24/lenders-delay-foreclosure-auction-for-san-francisco-centre/",
      "https://therealdeal.com/sanfrancisco/2023/05/02/nordstrom-to-close-two-stores-in-downtown-san-francisco/",
      "https://www.sfchronicle.com/sf/article/sf-downtown-crossroads-20054279.php",
      "https://www.sfchronicle.com/bayarea/article/dennys-sf-closed-19656669.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/02/24/lenders-delay-foreclosure-auction-for-san-francisco-centre/",
      "https://therealdeal.com/san-francisco/2023/06/13/westfield-and-brookfield-to-surrender-san-francisco-centre-mall/"
    ],
    "market": "San Francisco",
    "published": "Wed, 12 Mar 2025 18:30:00 +0000",
    "published_dt": "2025-03-12T18:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/national/2025/03/12/howard-lutnick-blamed-for-trumps-tariff-chaos/",
    "title": "White House officials blame Howard Lutnick for Trump’s tariffs chaos",
    "subhead": "“He’s trying to be a mini-Trump. Only Trump gets to be Trump.”",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 2:00 PM",
    "pub_date_dt": "2025-03-12T14:00:00",
    "content": "Howard Lutnick may have the president’s ear, but some in the administration and around Donald Trump are coming for his head.\nThe Commerce Secretary and former Cantor Fitzgerald head is bearing the blame for the tariff situation embroiling the nation, Politico\nreported\n. Lutnick is drawing increasing frustration from administration officials and Trump allies alike due to his close proximity with the president and economic counsel.\nLutnick hasn’t helped matters by seemingly overstepping on a number of occasions, sometimes contradicting the White House’s planned messaging. For instance, Lutnick said on “Meet the Press” that Americans should “absolutely not” brace for a recession, even though a taped interview where Trump refused to rule out the potential of a recession was about to air.\nHe also hinted on CNBC about a potential pause in\ntariffs\nfor Canada and Mexico while the administration was still negotiating with the countries.\n“He’s trying to be a mini-Trump. I don’t think he got the memo that only Trump gets to be Trump,” an administration source told Politico. “It just reinforces that he doesn’t really know how to do the job.”\n\nA White House spokesperson defended Lutnick as “an integral addition to the Trump administration’s trade and economic team,” pointing to the February jobs report as a feather in his cap. Lutnick did not comment.\nIt’s unclear if Trump is feeling the same frustration towards Lutnick that his allies are, given that  the latter joined the president on Air Force One over the weekend.\nBut it wasn’t long ago when Lutnick fell out of favor with others in Trump’s orbit during the transition, which Lutnick co-chaired. His control of the information flow to the president-elect reportedly\ndampened his chances\nto be Treasury Secretary.\nThe Dow fell substantially on both Monday and Tuesday as economic uncertainty ruled, along with a switch regarding tariffs on Canadian goods being flipped on and off at a nauseating pace. Lutnick helped negotiate a deal with Ontario Premier Doug Ford to suspend a threatened tariff on energy exports.\n—\nHolden Walter-Warner\n",
    "related_links": [
      "https://www.politico.com/news/2025/03/11/trump-allies-lutnick-tariff-turmoil-00225137",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/national/2024/11/18/trump-reconsiders-howard-lutnick-for-cabinet-role/",
      "https://therealdeal.com/author/holden-walter-warner/",
      "https://therealdeal.com/national/2025/02/26/trump-floats-gold-card-to-replace-eb-5-program/",
      "https://therealdeal.com/national/2025/03/11/homebuilders-resort-to-desperate-measures-as-tariffs-loom/",
      "https://therealdeal.com/national/2024/11/18/trump-reconsiders-howard-lutnick-for-cabinet-role/"
    ],
    "market": "National",
    "published": "Wed, 12 Mar 2025 18:00:00 +0000",
    "published_dt": "2025-03-12T18:00:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/houston/2025/03/12/skanskas-houston-tower-lands-law-firm-headquarters-lease/",
    "title": "Law firm spends $4M on buildout as Skanska targets flight-to-quality",
    "subhead": "Hicks Johnson leased 17,500 square feet in Houston’s newest office building",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 1:30 PM",
    "pub_date_dt": "2025-03-12T13:30:00",
    "content": "A headquarters tenant at downtown Houston’s newest office building is investing in its lease.\nLaw firm Hicks Johnson is spending $4.3 million to build out its 17,500-square-foot space at the Norton Rose Fulbright Tower, the Houston Business Journal\nreported\n.\nSkanska delivered the building last year; it was previously known as 1550 on the Green. It is the first major office building to open downtown since\nHines’ Texas Tower\nin 2021.\nHicks Johnson signed for a 13-year lease on the 19th floor of the tower in September. The buildout — including offices, meeting rooms and a mock courtroom — will begin this summer and wrap in the fall. Houston-based Kirksey Architecture is designing the space with O’Donnell/Snider Construction as general contractor.\nThe 28-story building is 50 percent leased between Hicks Johnson, Norton Rose Fulbright and\nBoston Consulting Group\n. The remaining space is being marketed to tenants looking for modern, amenity-rich office environments downtown.\n\nThe building has 375,000 square feet of office space and 7,000 square feet of ground-floor retail. It features three landscaped terraces and a 9,600-square-foot amenity center with lounge areas, a bar and conference space.\nThe move aligns with the firm’s plan to double its headcount from 20 to 40 lawyers over the next five years, Managing Partner Andrew Hicks said.\nThe firm is exiting TC Energy Center, at 700 Louisiana Street, whose ownership includesM-M Properties and an affiliate of the General Electric Pension Trust. It was built in 1983, and buildings of that era contribute the largest share of vacancy in Houston. Buildings constructed in the 1970s, ’80s and ’90s average about 30 percent vacant, while those built since 2010 have an average vacancy under 14 percent as tenants seek new buildings with amenities to attract workers.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/houston/news/2025/03/11/hicks-johnson-norton-rose-fulbright-tower-buildout.html",
      "https://therealdeal.com/texas/houston/2025/03/03/hines-texas-tower-lands-450-million-refinancing/",
      "https://therealdeal.com/texas/houston/2024/06/17/skanskas-downtown-houston-office-tower-lures-another-tenant/",
      "https://therealdeal.com/texas/houston/2024/06/17/skanskas-downtown-houston-office-tower-lures-another-tenant/",
      "https://therealdeal.com/texas/houston/2025/03/03/hines-texas-tower-lands-450-million-refinancing/",
      "https://therealdeal.com/texas/houston/2025/02/27/granite-properties-office-tenant-doubles-energy-corridor-lease/"
    ],
    "market": "Texas",
    "published": "Wed, 12 Mar 2025 17:30:00 +0000",
    "published_dt": "2025-03-12T17:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/chicago/2025/03/12/investor-pitches-conversion-for-chicagos-pittsfield-building/",
    "title": "Investor pitches office-to-resi for embattled Pittsfield Building",
    "subhead": "Tom Liravongsa plans 214 apartments for building at center of developer’s lawsuit",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 1:01 PM",
    "pub_date_dt": "2025-03-12T13:01:00",
    "content": "Another historic office tower in downtown Chicago could soon join the city’s wave of residential conversions.\nAn investor group led by Tom Liravongsa has proposed converting the vacant office space in the Pittsfield Building into 214 residential units, Crain’s\nreported\n, citing a zoning application.\nLiravongsa, an investor based in Grand Rapids, Michigan,\nacquired 30 of the building’s 40 floors\nthrough a foreclosure sale in April 2023. His investment firm is L’Cre Global.\nThe conversion plan is aimed at upper office floors of the building at 55 East Washington Street, leaving untouched the 177 apartments already owned by Marc Realty on floors 13 to 21. Marc Realty has authorized the zoning application so long as the existing residential units remain unaffected. The building was the city’s tallest when it was constructed in 1927.\nIt would be the latest conversion in a trend that’s touched underutilized downtown office properties as the city grapples with remote work-driven office vacancies and\nstrong residential rental demand\n.\nOther projects in the pipeline, which have won city approval, include Campari Group’s conversion of\n79 West Monroe Street\n, two New York developers’\nplans for the Lightner Building\nat 1006 South Michigan Avenue, and Riverside Investment &amp; Development, DL3 Realty and AmTrust RE’s\nconversion at 135 South LaSalle Street\n.\n\nReviving the iconic Pittsfield Building will require overcoming a tight lending environment and the complexities of redeveloping historic properties.\nBesides that, the building is at the center of a\nlegal battle\nbetween a developer and the city.\n​​The building’s former owner, Miami-based Morgan Reed Group, filed for bankruptcy in 2017 and later sued the city, alleging that illegal downzoning stripped the property of value. The case was\nrecently set for trial\n.\nFurther complicating the building’s history, Chinese-Canadian investor Xiao Hua “Edward” Gong purchased Morgan Reed’s stake during bankruptcy proceedings but faced securities fraud charges in Canada, which froze his assets and stalled redevelopment.\nGong eventually\ndropped his yearslong lawsuit\ncontesting the foreclosure sale in November.\n— Judah Duke\n",
    "related_links": [
      "https://www.chicagobusiness.com/commercial-real-estate/pittsfield-building-investor-pitches-office-residential-redo",
      "https://therealdeal.com/chicago/2023/05/16/mysterious-grand-rapids-investor-seizes-pittsfield-building/",
      "https://therealdeal.com/chicago/2025/03/11/downtown-chicago-apartment-rents-reach-new-peak/",
      "https://therealdeal.com/chicago/2024/09/05/campari-r2-advancing-loop-office-to-housing-project/",
      "https://therealdeal.com/chicago/2025/01/16/jk-equities-time-equities-take-on-chicago-office-conversion/",
      "https://therealdeal.com/chicago/2024/11/08/chicagos-office-to-residential-subsidy-backs-another-conversion/",
      "https://therealdeal.com/chicago/2025/01/28/morgan-reed-groups-chicago-zoning-lawsuit-going-to-trial/",
      "https://therealdeal.com/chicago/2025/01/28/morgan-reed-groups-chicago-zoning-lawsuit-going-to-trial/",
      "https://therealdeal.com/chicago/2023/11/14/gong-backs-off-loop-landmarks-receiver-dodges-sanctions/",
      "https://therealdeal.com/chicago/2023/05/16/mysterious-grand-rapids-investor-seizes-pittsfield-building/",
      "https://therealdeal.com/chicago/2025/01/28/morgan-reed-groups-chicago-zoning-lawsuit-going-to-trial/",
      "https://therealdeal.com/chicago/2025/01/16/jk-equities-time-equities-take-on-chicago-office-conversion/"
    ],
    "market": "Chicago",
    "published": "Wed, 12 Mar 2025 17:01:52 +0000",
    "published_dt": "2025-03-12T17:01:52+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/12/hoque-global-has-60-days-to-buy-southern-dallas-acreage/",
    "title": "Hoque Global has 60 days to buy land for University Hills project",
    "subhead": "Developer executed agreement with city on time and is under scrutiny to hit landmarks in ambitious Southern Dallas development",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 12, 2025, 12:05 PM",
    "pub_date_dt": "2025-03-12T12:05:00",
    "content": "Hoque Global moved the needle on its ambitious University Hills mixed-use development in Southern Dallas, gaining momentum for the delayed project.\nThe Dallas-based firm executed a development agreement with the city for the 270-acre site, and it now has 60 days to buy the land, the Dallas Business Journal\nreported\n.\nThe Dallas City Council\napproved amendments to the development agreement\nin December, extending deadlines and increasing the public subsidy to $35.9 million. The firm’s minimum investment requirement rose to $62 million, and it was tasked with selling an additional 50 lots to third-party builders.\nHoque must purchase the site by May 12 and secure construction funding by August 10. Arthur Santa-Maria, vice president at Hoque, said the firm is on track.\nUniversity Hills, near the University of North Texas at Dallas and Interstate 20, is envisioned as a transformative project for Southern Dallas.\nPlans call for thousands of residential units, 1.5 million square feet of commercial space and more than 50 acres of green space. The project could create a commercial hub in an area where median income levels are about 60 percent of the Dallas-Fort Worth average.\n\nHoque faced scrutiny from delays on other projects, and Dallas officials said the city would terminate the agreement if the firm missed any deadlines.\nIt missed a deadline last year for vertical construction at its\n$50 million mixed-use project\nin Mansfield, and it was\nremoved as the master developer\nfor the Evans and Rosedale Urban Village in Fort Worth last April, after the city cited “unacceptable delays.”\nHoque contested those claims but did not reapply for the project.\nThe firm last year sold 580 lots in University Hills to D.R. Horton and Lennar for townhome and single-family development. It is also a partner in the proposed\n$350 million redevelopment\nof downtown Dallas’ Bank of America Plaza with Mike Ablon of PegasusAblon.\n— Judah Duke\n",
    "related_links": [
      "https://www.bizjournals.com/dallas/news/2025/03/11/hoque-global-university-hills-deadline-dallas.html",
      "https://therealdeal.com/texas/dallas/2024/12/13/dallas-approves-hoque-globals-university-hills-agreement/",
      "https://therealdeal.com/texas/fort-worth/2025/01/21/hoque-global-misses-deadline-for-mansfield-development/",
      "https://therealdeal.com/texas/fort-worth/2024/04/15/fort-worth-drops-hoque-global-as-developer-for-southside-project/",
      "https://therealdeal.com/texas/dallas/2024/09/20/buyers-plan-hotel-conversion-for-part-of-dallas-tallest-tower/",
      "https://therealdeal.com/texas/fort-worth/2025/01/21/hoque-global-misses-deadline-for-mansfield-development/",
      "https://therealdeal.com/texas/dallas/2024/12/13/dallas-approves-hoque-globals-university-hills-agreement/",
      "https://therealdeal.com/texas/dallas/2024/12/06/hoque-global-under-fire-for-stalled-dallas-development/"
    ],
    "market": "Texas",
    "published": "Wed, 12 Mar 2025 16:05:09 +0000",
    "published_dt": "2025-03-12T16:05:09+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/11/megalisting-asks-175m-for-site-once-eyed-for-bulgari-hotel/",
    "title": "Benedict Canyon site once set for Bulgari hotel hits market for $175M",
    "subhead": "Property with ties to Reuben brothers one of the priciest on the market in LA County",
    "authors": "ByKari HamanakaResearch byMatthew Elo",
    "pub_date": "Mar 11, 2025, 8:00 PM",
    "pub_date_dt": "2025-03-11T20:00:00",
    "content": "A megalisting priced at $175 million has hit the market in what’s been a drawn-out saga for a piece of Benedict Canyon once slated for a\nBulgari-branded hotel\n.\nThe 15-parcel listing includes the 9712 West Oak Pass Road address among several others in the hillside of Los Angeles. The listing states the property is located in Beverly Hills Post Office, a Los Angeles neighborhood north of the city of Beverly Hills. It also includes two single-family residences at 9800 Wanda Park Drive and 2534 Hutton Drive.\nRecords through PropertyShark and listing sites note the property is in pre-foreclosure after a notice of default was sent in November, alleging a $49.7 million unpaid balance at that time.\nThe notice of default indicates Motcomb Estates Ltd. provided a $30 million loan to 9712 Oak Pass Road LLC, which Florida state records show is tied to developer Gary Safady.\nMotcomb handles property investments for real estate investment and development firm Reuben Brothers, which is helmed by billionaires David and Simon Reuben.\nThe Agency’s Adam Rosenfeld and Feroz Taj have the listing and declined, through a brokerage spokesperson, to comment on the property outside of confirming only one seller is involved. Also marketing the property is Compass’ Carl Gambino.\nDavid Reuben Jr., Reuben Brothers principal and co-founder of Blackship Advisors, declined to comment. The Reubens’ attorney, Eric Orenstein of Rosenberg &amp; Estis, did not respond for comment.\nLuxe Ambitions\nThe mega-property was a point of contention a few years ago when Safady planned for a Bulgari-branded hotel.\nAn initial study for the project, when it was known as The Retreat at Benedict Canyon, called for a 59-room hotel along with eight single-family residences. The latter were to each total anywhere from 12,000 to 48,000 square feet, according to city planning documents.\nThe project drew the ire of some locals who were against the expected impacts of the large-scale construction project.\n\n“I believe we’ve taken the time to address all those issues,” Safady, who could not be immediately reached for comment Tuesday, told\nVoyageLA\nin April 2023.\nA few months after that interview ran, then-\nCity Planning Director Vincent Bertoni\nwrote to Safady that the project’s impact to the area was far greater than originally expected, effectively ending the entitlement process for the resort.\nMike Gatto, an attorney for Safady, told the\nLos Angeles Times\nfollowing the city’s decision to axe the project it sent “a message to all looking to invest in Los Angeles that the city can’t be trusted to follow its own rules.”\nGatto, reached Tuesday afternoon, said he wasn’t aware of any backup development plans following the city’s 2023 decision, which is when his retainer agreement with Safady ended.\n“Usually when there is a presence of a NIMBY group in an area, they make it so that whatever somebody proposes is going to be tough. Those factors would have made it very hard to build anything there,” Gatto told\nThe Real Deal\n.\nPricey Properties\nOak Pass Road now ranks as the third-priciest property on the market within Los Angeles County, according to Zillow records.\nThe county’s most expensive property currently for sale is Westside Estate Agency’s listing at 1261 Angelo Drive in Beverly Hills, which has a $195 million price tag. WEA founders Kurt Rappaport and Stephen Shapiro are marketing the property.\nAngelo Drive, also known as the\nPritzker Estate\n, gets its name from Hyatt Hotel heir Anthony Pritzker who built the 50,000-square-foot mega mansion with his now ex-wife Jeanne Pritzker. It has 16 bedrooms and 27 bathrooms.\nThe next priciest property on the market is 607 Siena Way, which is priced at $177 million by The Beverly Hills Estates’ Branden Williams and Rayni Williams. The eight-bed, 25-bath Villa Siena estate spans 35,000 square feet and hit the market in February.\n",
    "related_links": [
      "https://therealdeal.com/magazine/national-august-2023/bulgari-hotel-and-the-clash-in-benedict-canyon/?mod=article_inline",
      "https://voyagela.com/interview/check-out-gary-safadys-story/",
      "https://therealdeal.com/la/2023/09/07/la-planning-director-kills-bulgari-hotel-entitlement/",
      "https://www.latimes.com/california/story/2023-09-06/l-a-city-planning-rescinds-initial-approval-for-benedict-canyons-bulgari-hotel",
      "https://therealdeal.com/la/2024/10/10/divorced-pritzkers-list-beverly-crest-estate-for-195m/",
      "https://therealdeal.com/la/2023/09/07/la-planning-director-kills-bulgari-hotel-entitlement/",
      "https://therealdeal.com/la/2023/08/16/la-city-council-vote-a-setback-to-bulgari-hotel-project/",
      "https://therealdeal.com/la/2022/09/20/planned-bulgari-resort-in-benedict-canyon-celebrity-brouhaha/"
    ],
    "market": "Los Angeles",
    "published": "Wed, 12 Mar 2025 00:00:00 +0000",
    "published_dt": "2025-03-12T00:00:00+00:00",
    "author": "Kari Hamanaka, Matthew Elo"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/11/newport-beach-complex-to-expand-at-a-cost-of-800k-per-unit/",
    "title": "Newport Beach apartment complex to expand at a cost of $800K per unit",
    "subhead": "Park Newport Apartments plans to add 366 units at a total cost of $293M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-11T19:30:00",
    "content": "The owners of a Newport Beach apartment complex by the Back Bay want to expand it by 366 units — at $800,000 a pop.\nDallas-based Park Newport LP has filed plans to expand its Park Newport Apartments at 1 Park Newport,\nthe Orange County Business Journal reported.\nThe 1,306-unit complex on 52 acres would expand by 366 apartments at a cost of $800,000 each. The total outlay: $293 million.\nThe sprawling complex along the bluffs of Upper Newport Bay sits across Jamboree Road from the Fashion Island mall. The complex, built a half century ago by Gerson Bakar &amp; Associates, has 44 two- and three-story buildings, plus seven pools, a clubhouse and 10 sport courts.\nResidents of Park Newport have included actors Telly Savalas and Raquel Welch, and athletes Joe Torre, Bobby Riggs and Dennis Rodman.\nThe property is now owned by San Francisco-based Prado Group, according to the Business Journal. It’s not clear how Park Newport, or a Park Newport Land it said was involved in the expansion, are tied.\nPlans for the 6-acre expansion call for demolishing a leasing building, reflecting pool, tennis court and a 260-vehicle parking structure, as well as six apartments.\nThe landlord would then build 360 new apartments, including 285 market-rate units and 15 set aside for low-income tenants. The other 60 new apartments are “density bonus” residences, an indication of affordable housing units, according to the Business Journal.\n\nThe project would include 40 studio, 138 one-bedroom, 151 two-bedroom and 31 three-bedroom apartments, with an average size of 950 square feet. It would also include a 12,000-square-foot amenity space and 7,000 square feet of shops.\nThe expansion of the largest apartment complex near Fashion Island is the latest development among other multifamily projects in the works.\nLocally based Irvine Company recently proposed a combined 800 apartment units at Villas of Fashion Island at 1000 San Joaquin Plaza and Newport Center’s Block 100, a four-building multifamily project at 11 Newport Center Drive.\nThe firm also wants to convert part of an office campus at MacArthur Court near John Wayne Airport into\n700 homes\n.\nThe upscale coastal city has a state-mandated plan to build\n4,845 homes by 2029\n, of which 2,386 would be affordable for very low-income and low-income households.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.ocbj.com/oc-homepage/newport-beach-apartment-complex-could-get-366-more-units/",
      "https://therealdeal.com/la/2024/12/17/irvine-company-to-build-700-apartments-in-newport-beach/",
      "https://ceqanet.opr.ca.gov/2023060699/4",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/la/2024/12/17/irvine-company-to-build-700-apartments-in-newport-beach/",
      "https://therealdeal.com/la/2024/12/31/related-california-eyes-140-condos-in-newport-beach/",
      "https://therealdeal.com/la/2024/12/10/irvine-company-to-spend-24m-to-revamp-oc-office-campuses/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 11 Mar 2025 23:30:43 +0000",
    "published_dt": "2025-03-11T23:30:43+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/la/2025/03/11/will-la-rise-to-single-stair-challenge/",
    "title": "Will LA rise to single-stair challenge?",
    "subhead": "Motion calls upon city to follow Seattle, New York and Europe, allowing larger apartment units",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 7:30 PM",
    "pub_date_dt": "2025-03-11T19:30:00",
    "content": "Los Angeles may soon lower the cost of building apartments by allowing just one single stairway.\nCouncil member Nithya Raman filed a motion to scrub requirements for double stairwells and dual-loaded corridors as early 20th century planning relics that prevent larger, family-sized apartments with more natural ventilation and light,\nUrbanize Los Angeles reported\n.\nLos Angeles, like many cities, requires buildings higher than three stories to have two stairwells that can be used as fire exits.\nThe code requirement forces architects to design buildings around a double-loaded corridor, or long central hallways with apartments on either side, similar to a hotel.\nThe requirement also requires a hallway connecting the stairwells, resulting in dual-loaded corridor buildings that limit the size of apartments and allow windows only one side, preventing natural sunlight and cross-ventilation.\nSuch corridor design is inefficient and costly, opponents say. They claim a fire exit on a centrally located stair, as practiced in Europe, is a far more manageable and “economically defensible” design.\n\nWhile common practice in European cities,\nSeattle has led the charge on single-stair reform\nin the U.S. Decades ago, the city tweaked its building code to allow for single-stair buildings up to six stories.\nWhile New York followed suit, Raman pointed out that\nSan Francisco\nand San Diego are also exploring single-stair rules after the passage of\nAssembly Bill 835\n, which directs the state fire marshal to develop standards for single-stair buildings by 2028.\nRaman’s motion seeks numerous reports on a single-stair regulation from the Los Angeles Department of Building and Safety, Fire Department and the Planning Department, as well as the Livable Cities Initiatives and the American Institute of Architects.\nLikewise, the motion asks the Planning Department to report back on existing regulations in cities where single-stair buildings are allowed.\n“While the requirement for two stairwells was originally adopted for fire safety, developments over the past two to three decades have made such requirements obsolete,” explains\na landing page on the California YIMBY website\n. “Modern buildings across the U.S. and Europe have fire safety ratings that greatly exceed buildings with two staircases — even though they only have one staircase.”\n—\nDana Bartholomew\n",
    "related_links": [
      "https://la.urbanize.city/post/los-angeles-could-be-next-city-take-single-stair-reform",
      "https://www.theurbanist.org/2021/12/20/seattles-lead-on-single-stair-buildings/",
      "https://therealdeal.com/san-francisco/2024/10/25/san-francisco-considers-allowing-six-story-walkups-with-one-stairway/",
      "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB835",
      "https://cayimby.org/legislation/ab-835/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/10/25/san-francisco-considers-allowing-six-story-walkups-with-one-stairway/",
      "https://therealdeal.com/la/2025/03/10/la-to-temporarily-ban-evictions-for-substantial-remodeling/",
      "https://therealdeal.com/la/2025/01/13/real-estate-agents-call-to-loosen-regulations-in-california/"
    ],
    "market": "Los Angeles",
    "published": "Tue, 11 Mar 2025 23:30:00 +0000",
    "published_dt": "2025-03-11T23:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/austin/2025/03/11/dc-partners-brings-mixed-use-to-affluent-central-texas-town/",
    "title": "DC Partners expanding affluent Fredericksburg’s Main Street",
    "subhead": "22-acre project in upscale tourism town to bring retail, hotel, wine-tasting rooms",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 6:30 PM",
    "pub_date_dt": "2025-03-11T18:30:00",
    "content": "A mixed-use development is set to expand Fredericksburg’s Main Street.\nDC Partners, the developer behind Houston’s\nResidences at The Allen\nand the\nThompson San Antonio\nhotel, plans to develop The Meuse, a 22-acre project featuring retail, restaurants, tasting rooms and a small luxury hotel, the Austin Business Journal\nreported\n.\nThe development will rise near the intersection of Highway 290 and Main Street, adjacent to the city’s historic Klingelhoeffer House. Construction starts this spring, with completion anticipated by the end of 2027.\nThe project targets 73,200 square feet of destination and retail experiences designed to blend with Fredericksburg’s aesthetic appeal. The hotel brand hasn’t been revealed. Colliers’ Wade Green and Hannah Schiro are handling retail leasing.\nDallas-based Merriman Anderson Architects, the firm behind Dallas’ Statler Hotel revitalization, is leading design efforts, with Chicago-based Curioso handling the hotel interiors. Satterfield &amp; Pontikes, from Houston, is the construction manager.\nFredericksburg officials signaled their support for the project, saying it especially aligns with the city’s efforts to boost midweek tourism.\n\nThe Hill Country town has long been known for its small-town charm and robust tourism fueled by its wineries and German heritage. It was named one of the “most picturesque towns in America” by Reader’s Digest last year and received $1.4 million in American Rescue Plan funding in 2022 for infrastructure updates to accommodate swelling tourism.\nThe town was dubbed\n“the new Aspen”\nby Texas Monthly in 2021 for its high population of wealthy people and its part-time residents.\nCentral Texas is growing rapidly, and the Austin/San Antonio region is merging into a massive metro area.\nCrescent Real Estate is capitalizing on growing demand for upscale homes in the Texas Hill Country by developing a luxury residential project called Atten Hill in Horseshoe Bay, featuring 92 custom home sites on 114 acres, with prices starting around $500,000. The first phase will include 55 homes, and residents will enjoy exclusive amenities, including golf courses and a $40 million clubhouse.\n— Judah Duke\n",
    "related_links": [
      "https://therealdeal.com/texas/houston/2025/02/11/dc-partners-sells-houston-luxury-condo-unit/",
      "https://therealdeal.com/texas/houston/2024/06/05/dc-partners-scores-46m-pace-financing-for-luxury-hotel-in-houston/",
      "https://www.bizjournals.com/austin/news/2025/03/10/developer-fredericksburg-retail-mixed-use.html",
      "https://www.texasmonthly.com/being-texan/fredericksburg-new-aspen/",
      "https://therealdeal.com/texas/houston/2025/02/11/dc-partners-sells-houston-luxury-condo-unit/",
      "https://therealdeal.com/texas/houston/2024/06/05/dc-partners-scores-46m-pace-financing-for-luxury-hotel-in-houston/",
      "https://therealdeal.com/texas/2024/09/18/super-expensive-texas-hill-country-ranch-hits-market/"
    ],
    "market": "Texas",
    "published": "Tue, 11 Mar 2025 22:30:00 +0000",
    "published_dt": "2025-03-11T22:30:00+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/texas/dallas/2025/03/11/heres-what-could-happen-to-dallas-federal-buildings/",
    "title": "Redeveloping federal offices Trump’s unloading won’t be easy",
    "subhead": "Feds owns 1.7M sf in North Texas; none provide easy path",
    "authors": "ByJess Hardin",
    "pub_date": "Mar 11, 2025, 5:09 PM",
    "pub_date_dt": "2025-03-11T17:09:00",
    "content": "Developers trying to make lemonade out of the Trump administration’s plan to offload North Texas’ federal buildings will need a lot of sugar.\nThe General Services Administration’s list of buildings around the country that are burning a hole in the government’s pocket included five office buildings (and one small parking garage) in Dallas-Fort Worth totalling 1.7 million square feet.\nNone of them provide a quick and easy path to redevelopment.\nThe offerings include the mammoth Fritz G. Lanham Federal Building in downtown Fort Worth as well as three buildings in downtown Dallas, ranging from from 190,000 square feet to 261,000 square feet. There’s also a 317,000-square-foot building in the Dallas suburb of Farmers Branch.\nThe most exciting conversion prospect is the historic Santa Fe Federal Building at 1114 Commerce Street in downtown Dallas. Dallas developer Tanya Ragan could see it becoming a mixed-use project with a hotel, office, retail and most important, a “fabulous rooftop.”\n“It would be one of the best views in the city, because you’re adjacent to so many historic sites,” she said. “There are strict height restrictions and no obstructions.”\nThe expense, however, would be enormous. A transformation would require “incredible incentives” that city leadership might not support, she said.\nThe Farmers Branch building that’s home to an IRS office might be the most straightforward property from a marketing perspective, said Marcus &amp; Millichap veteran Ron Hebert. It’s a land play.\nIf the building at\n4050 Alpha Road\nwas torn down, the 9.44-acre plot would be “a great size for multifamily,” he said. The suburb’s school district is more desirable to Dallas’, he added, and that community would be more likely to tolerate rezoning.\n\n“You’d look out and see the stadium and the Green Belt. You could go walk around the college. It’s not a bad location,” he said.\nWhile it sits on a much smaller plot — 2.87 acres — the A. Maceo Smith Federal Building could also be a land play, Ragan said. The 189,000-square-foot office building at 525 South Griffin Street was built in 1971 and last renovated almost 15 years ago.\nBut its proximity to the convention center is a bonus, she said.\nIt could also work for an owner-user like a charter school or nonprofit organization, Partners’ Steve Triolet said.\nThe Terminal Annex, another mid-size property on the list, could also have a second life as an updated office building, Triolet said. Ragan pointed out that parking is bad at the location, and it’s on the National Registry of Historic Places, so it can’t be easily torn down.\nWhile downtown Fort Worth’s Fritz G. Lanham Federal Building has the benefit of a desirable location, its massive size and layout might make it an albatross of a development project.\nIt could be suitable for a multi-tenant conversion or repurposed into a mixed-use office space, Triolet said.\nRegardless of the fate of these properties, Ragan worries they’ll mess with comps if the government opts for a fire sale.\n“That is going to come up for conversation for everything else that is out there on the market,” she said.\n",
    "related_links": [
      "https://www.loopnet.com/property/4050-alpha-rd-dallas-tx-75244/48113-240425600C0010000/",
      "https://therealdeal.com/texas/2025/03/06/trump-team-targets-dfw-austin-federal-buildings-for-sell-off/",
      "https://therealdeal.com/chicago/2025/02/27/trump-musk-face-obstacles-in-downsizing-federal-offices/",
      "https://therealdeal.com/san-francisco/2025/03/05/deep-discounts-for-potential-federal-building-buyers-in-sf/"
    ],
    "market": "Texas",
    "published": "Tue, 11 Mar 2025 21:09:30 +0000",
    "published_dt": "2025-03-11T21:09:30+00:00",
    "author": "Jess Hardin"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/11/housing-advocate-sues-lafayette-for-misleading-housing-plan/",
    "title": "Suit accuses upscale East Bay city of shell game on housing element",
    "subhead": "Housing Action Coalition sues Lafayette for “misleading” housing plan",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 4:39 PM",
    "pub_date_dt": "2025-03-11T16:39:00",
    "content": "Lafayette, a city of $2 million homes, has played a shell game with state housing regulators to avoid building its share of affordable housing.\nThat’s the contention of the Housing Action Coalition, a San Francisco-based housing advocate that is suing the East Bay city for creating “misleading and unrealistic housing sites” to satisfy state-mandated housing goals,\nthe San Francisco Chronicle reported\n.\nThe lawsuit seeks a court to compel the city to adopt a revised plan with an update to its zoning laws. The city must rezone to build 2,114 homes, 943 of them affordable, by 2031.\nThe coalition accuses the city of “pretending” to comply with the planning blueprint, known as the housing element, required of every city and county across the state every eight years.\nLafayette’s alleged shell game includes relying on faith-based institutions and longtime businesses with no plans to develop housing as potential building sites for homes, according to the complaint filed by Farella Braun and Martel a San Francisco-based law firm.\nIn one case, the city said a CVS will be torn down and rebuilt into 26 homes — but CVS has a long-term lease, with no intention of moving, according to the lawsuit. Other examples were not disclosed.\n“We hoped that Lafayette would take its responsibility to plan for housing seriously, but instead, they passed a housing element that deliberately ignores the facts,” Ali Sapirman, the advocacy and policy manager with the Housing Action Coalition, told the Chronicle. “Lafayette is continuing a pattern of obstruction, using questionable calculations to block much-needed housing while pretending to comply with state law.\n“The housing crisis is severe, and every city, including Lafayette, must do its fair share,” Sapirman added.\n\nIn its housing plan, Lafayette proposed using city-owned parking lots for housing, as well as sites downtown and at religious institutions to build affordable housing. The city projects that 27 accessory dwelling units will be built each year, for a total of 216 units.\nOfficials also said more than 150 units were under construction, with another 570 approved units in the development pipeline.\nThe city didn’t immediately return a request for comment by the newspaper.\nLafayette was once a battleground for the region’s housing wars, with two lawsuits, a ballot referendum and more than 100 public hearings that delayed a 315-unit apartment building for almost a dozen years.\nLast year, the\nstate Supreme Court declined\nto hear an appeal from a neighborhood group attempting to stop the development, allowing it to move forward. The project has not broken ground.\nWithin a 10-year span, 115 homes were built in the city of 25,000 residents, including 10 in 2010, 76 in 2018 and 29 in 2019 — according to its housing element plan.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/eastbay/article/east-bay-city-delaying-housing-lawsuit-20213353.php",
      "https://www.sfchronicle.com/realestate/article/lafayette-housing-project-court-17844162.php",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/03/14/former-sf-giant-buster-posey-buys-lafayette-home-for-8-3m/",
      "https://therealdeal.com/san-francisco/2022/05/13/midwest-investor-pays-103m-for-two-shopping-centers-in-lafayette/",
      "https://therealdeal.com/san-francisco/2022/03/04/affordable-units-offered-in-luxury-condo-building-in-bay-area-city-of-lafayette/"
    ],
    "market": "San Francisco",
    "published": "Tue, 11 Mar 2025 20:39:54 +0000",
    "published_dt": "2025-03-11T20:39:54+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/11/bargain-hunter-eyes-hudson-pacific-property-off-embarcadero/",
    "title": "Local bargain hunter eyes Hudson Pacific property off Embarcadero",
    "subhead": "Frontline poised to buy historic office building for around $30M",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 4:00 PM",
    "pub_date_dt": "2025-03-11T16:00:00",
    "content": "Frontline Realty Capital has a pending deal to buy a 138,400-square-foot office building in San Francisco’s Bayside Village for around $30 million, nearly half its last traded price.\nThe locally based investor is moving to buy the four-story brick building at 625 Second Street, in Bayside Village west of the Embarcadero,\nthe San Francisco Business Times reported\n, citing an unidentified source. The seller is Hudson Pacific Properties, based in Los Angeles.\nThe real estate investment trust listed the 119-year-old brick and timber building last year, seeking between $200 and $250 per square foot, or between $27.7 million and $34.6 million.\nFinancial terms of the pending deal between Frontline and Hudson Pacific were not disclosed. But a source told the Business Times a Frontline purchase would “track” near the listed price.\nHudson Pacific bought the building in 2011 for $56.4 million, or $408 per square foot.\nThe Class A building, built in 1906 and renovated in 1999, has exposed timber beams and brick walls, and has the original arched brick doorways and metal sliding fire doors, according to KBS.\nThe building is now 38.7 percent leased, or more than 60 percent vacant.\n\nA deal would mark the second purchase for Frontline this year. In January, the firm snapped up an 91,000-square foot building in a lender sale at 1440 Broadway in downtown Oakland for\n$5.5 million, or $60 per square foot\n, 86 percent less than its previous sale.\nFrontline founder Rob Mann described 1440 Broadway as the type of building he wanted to acquire more of: a well-located asset “with significant potential to create value through thoughtful repositioning and patience.”\nFrontline Realty Capital, founded in 2016, invests in industrial, retail and office properties in the Bay Area, Inland Empire and select western markets, according to its website.\nHudson Pacific Properties, founded in 2009 by Victor Coleman, owns 2.4 million square feet of property in San Francisco, after a buying spree in the early 2010s, according to a regulatory filing. It’s selling\nfour office buildings for up to $150 million\nas it struggles with hundreds of millions in financial losses.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.bizjournals.com/sanfrancisco/news/2025/03/10/625-second-hudson-pacific-frontline-sale-sf.html",
      "https://therealdeal.com/san-francisco/2025/01/31/frontline-realty-buys-oaklands-original-highrise-for-38m/",
      "https://therealdeal.com/la/2025/02/26/hudson-pacific-to-sell-up-to-150m-in-offices-to-pay-debt/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2025/01/31/frontline-realty-buys-oaklands-original-highrise-for-38m/",
      "https://therealdeal.com/la/2025/02/26/hudson-pacific-to-sell-up-to-150m-in-offices-to-pay-debt/",
      "https://therealdeal.com/san-francisco/2024/11/14/hudson-pacific-sells-palo-alto-office-campus-for-23-million/"
    ],
    "market": "San Francisco",
    "published": "Tue, 11 Mar 2025 20:00:14 +0000",
    "published_dt": "2025-03-11T20:00:14+00:00",
    "author": "TRD Staff"
  },
  {
    "url": "https://therealdeal.com/san-francisco/2025/03/11/related-california-to-plant-a-41-story-office-hotel-stake-in-san-francisco/",
    "title": "Related California eyes 41-story office-hotel in San Francisco",
    "subhead": "Developer goes from “contrarian” to conviction for trophy tower near Jackson Square",
    "authors": "ByTRD Staff",
    "pub_date": "Mar 11, 2025, 12:10 PM",
    "pub_date_dt": "2025-03-11T12:10:00",
    "content": "Related California plans to build a 41-story office building and hotel in San Francisco while nearly two out of five city workplaces sit empty.\nFor the Irvine-based developer, it’s all in how you crunch the numbers for the proposed office-hotel tower at 530 Sansome Street, in the North Financial District across from the Transamerica Pyramid near Jackson Square,\nthe San Francisco Chronicle reported.\nYes, overall office vacancy across the city hovers at a dismal 37 percent.  Yes, the top five buildings have a 16 percent vacancy.\nBut when you pull away the drapes, the city’s true office trophies with views from the Golden Gate to the Bay Bridge command a vacancy of 6.9 percent — the target for the Related venture.\n“Right building in the right location at the right time,” Matt Witte, executive vice president of acquisitions and development for Related California, told the Chronicle.\n“This started out as a contrarian bet but as we dug in deeper and looked at the market, how it is evolving and maturing out of COVID, it doesn’t seem so contrarian any more,” added Gino Canori, president of Related California. “It’s a story about San Francisco’s recovery, about the city coming out of a tough time and building something everyone can be proud of.”\nPlans call for a 544-foot tower with 360,000 square feet of offices atop a five-star, 200-room hotel, plus a new firehouse at 447 Battery Street to replace a station swallowed up by the project. A previous 19-story hotel and fitness club project, approved in 2021, stalled.\nThe city is expected to publish an environmental study on Tuesday, March 11. Related hopes to secure approvals to build the tower this fall, allowing the firm to break ground by late next year. If all goes well, the gleaming glass rectangle could be completed by 2030.\nIt would be the first new North Financial District building since 350 Bush Street opened in 2018, and the first new five-star hotel in 30 years, according to the Chronicle. It’s expected to cost\n$600 million\n.\n\nThe tower, designed by Chicago-based SOM, would anchor a block across from the Transamerica Pyramid, which New York-based Michael Shvo revamped, investing $1 billion. Rents for top-floor offices in the area are north of $200 a square foot, more than three times the city average.\nIt would also be built next to Jackson Square — the hot spot in San Francisco’s glacial rebound.\nRelated California, a unit of New York-based Related Companies, “did a lot of homework,” touring buildings and digging into leasing data, Canori said.\nAs it hoovered up information, it grew convinced there was demand for a new building with “killer views” and features that top tenants want  — meeting rooms and workout facilities and outside terraces and swank restaurants.\nSuch amenities not only help recruit and retain talent. They attract them to a return-to-office.\nThree North Financial District tenants have leases expiring in 2030 who are “taking a very close look” at the proposed building, Canori told the newspaper, which “is further emboldening our ability to press ahead with getting the project approved and started.\n“We think the market is there,” he declared.\n—\nDana Bartholomew\n",
    "related_links": [
      "https://www.sfchronicle.com/sf/article/office-tower-real-estate-20213304.php",
      "https://therealdeal.com/san-francisco/2024/12/05/michael-shvo-talks-about-transamerica-pyramid/",
      "https://therealdeal.com/author/dana-bartholomew/",
      "https://therealdeal.com/san-francisco/2024/12/05/michael-shvo-talks-about-transamerica-pyramid/",
      "https://therealdeal.com/san-francisco/2024/07/29/colliers-derek-daniels-looks-at-san-franciscos-great-reset/"
    ],
    "market": "San Francisco",
    "published": "Tue, 11 Mar 2025 16:10:50 +0000",
    "published_dt": "2025-03-11T16:10:50+00:00",
    "author": "TRD Staff"
  }
]