[
    {
        "title": "Catellus, Deca pitch retail, warehouses for Phillips 66 refineries",
        "url": "https://www.therealdeal.com/la/2025/08/26/phillips-66-sites-poised-for-retail-warehouse-redevelopment/",
        "date": null,
        "subhead": "Heavy industrial sites in Wilmington, Carson poised for transformation",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 3:59 PM UTC",
        "pub_date_dt": "2025-08-26T15:59:00",
        "content": "Catellus Development and Deca are looking to turn a petroleum refinery near Long Beach into a modern industrial hub with restaurants and retail.\nThe developers have proposed replacing 406 acres of oil-refining operations and another 228-acre refinery site into millions of square feet of industrial space with grocers, restaurants, sports facilities and greenways available to nearby residents, CoStar\nreported\n. If approved, it would be among the largest conversions of previously environmentally hazardous land in California history.\nLast year,\noil giant Phillips 66\ntapped Catellus and Deca to help redevelop its Los Angeles refinery operations which include the 406-acre site at 1660 West Anaheim Street in Wilmington and a 228-acre site at 1520 East Sepulveda Boulevard in Carson. Catellus and Deca have filed plans with the city of Los Angeles for its Five Points Union Specific Plan, which would require zoning changes before any shovels can hit dirt.\nAt the Wilmington site, the Anaheim Street land will be split into two portions: A commercial and recreation strip along Anaheim Street with grocery stores, cafes, sports courts and greenways, and a logistics area with warehouses to the south.\n\nThe Wilmington development would stretch across three parcels including the 410-acre refinery site, a 10-acre vacant lot north of Anaheim Street and a 20-acre propane and butane storage yard. Plans have yet to be announced for the Carson site, though it could be redeveloped for industrial logistics use. It could also face separate legal and logistical hurdles due to its location in the city of Carson.\nIt wouldn’t be the first time Catellus has undertaken such a project.\nIn 2003, the Emeryville-based firm redeveloped the 200-acre former Pacific Refinery Company near San Francisco into a residential subdivision known as Victoria by the Bay. In order to do that, the company had to remove contaminants from the site, not unlike what it will have to do in Wilmington and Carson.\nMeanwhile, in Huntington Beach, Shopoff Realty is\nlooking to redevelop\nthe\nMagnolia Tank Farm\nwith housing.\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://www.costar.com/article/164982279/redevelopment-plans-for-massive-los-angeles-oil-refinery-show-modern-real-estate-needs",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/"
        ],
        "market": "Los Angeles"
    }
]