[
    {
        "title": "Alloy secures $500M for “world’s tallest” passive house building",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/alloy-snags-500m-for-one-third-avenue/",
        "date": null,
        "subhead": "Kayne Anderson, Vistria are providing $495M for energy-efficient Brooklyn project",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 26, 2025, 3:00 PM UTC",
        "pub_date_dt": "2025-08-26T15:00:00",
        "content": "Developers of what is poised to be the world’s tallest passive house building in the world secured $500 million to get the project off the ground.\nAlloy Development on Monday closed on $375 million in loans from Kayne Anderson Real Estate for One Third Avenue, a 583-unit tower planned for Downtown Brooklyn. Additionally, Vistria Group, in its first ground-up development, is infusing $120 million in equity and taking a majority stake in the project as a limited partner. Alloy, as general partner, will continue to lead development and is kicking in $40 million.\nAccording to Alloy, the 730-foot tower is slated to be the world’s tallest built to passive house standards, a design method aimed at cutting energy costs through extreme insulation. The project is the second phase of “Alloy Block,” which includes the city’s first all-electric skyscraper at 505 State Street and two public schools (also passive house) at 489 State Street.\n\nOne Third Avenue will include 143 affordable housing units, with monthly rents starting at $1,023 per month. These apartments will be reserved for tenants earning, on average, 60 percent of the area median income.\nResidential space will span the 11th through 60th floors, and the tower’s podium will include 60,000 square feet of office space. Two buildings constructed in the 1800s on State Street and Schermerhorn Street will also be incorporated into the development, and house 30,000 square feet of retail space.\nDemolition work on the site began earlier this year, and the development team expects to begin construction in the fall.\nWhen finished, Alloy Block is expected to include more than 1,000 homes, with 200 set aside as permanently affordable. The electric tower at 505 State Street was completed in July 2024. The developers\nsecured\n$290 million to replace a $210 million construction loan in December.\n",
        "related_links": [
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/05/city-council-approves-city-of-yes-for-housing-opportunity/"
        ],
        "market": "New York"
    },
    {
        "title": "Owner proposes rezoning LaGuardia Center in Astoria",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/owner-proposes-rezoning-laguardia-center-in-astoria/",
        "date": null,
        "subhead": "Rosenwach Group eyes nearly 500 apartments above shopping center",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 2:25 PM UTC",
        "pub_date_dt": "2025-08-26T14:25:00",
        "content": "The family-run Rosenwach Group is thinking of adding opportunities for hundreds of families to live at the site of a shopping center in Astoria.\nRosenwach filed an application with the Department of City Planning to rezone the LaGuardia Center at 43-02 Ditmars Boulevard in the Queens neighborhood, Crain’s\nreported\n. The firm wants to turn the low-rise shopping center into a mixed-use complex with nearly 500 units.\nRosenwach proposed a 412,000-square-foot complex that would be between eight and ten stories tall. The property would include 492 residential units, 25 percent of which would be affordable for those earning a maximum of 60 percent of the area median income.\nThe proposal also includes a significant retail component — 62,000 square feet in all on the ground floor, including a 2,300-square-foot cafe and gallery — which would allow the tenants of LaGuardia Center to remain in place when the redevelopment is completed. Tenants include a supermarket, a laundromat, a bank and restaurants.\nAdditional aspects of the proposal include a landscaped public terrace and parking for 175 vehicles.\n\n“We always thought that the center — now and hopefully in the future — was the heartbeat of the neighborhood,” director of operations Henry Rosenwach told the outlet. “We really just want to take it one step further for the community.”\nDevelopment costs and timeline were not disclosed. Because of previous work, however, Rosenwach expects to qualify for the lapsed 421a tax break, for which construction needs to be completed by the middle of June 2031 after the deadline was extended last year.\nRosenwach acquired the site in 1989 for an undisclosed price and operates out of the address. In addition to being a landlord, the firm also helped develop rooftop water towers across the city.\nElsewhere on Ditmars, Pasadena-based hospitality investor ASAP Holdings\nfiled a rezoning application\ntowards the end of 2023 to replace the 410 parking spaces at the New York LaGuardia Airport Marriott with a mixed-use building containing 437 apartments and a separate structure containing 98 affordable residences for seniors.\n—\nHolden Walter-Warner\n",
        "related_links": [
            "https://www.crainsnewyork.com/real-estate/rosenwach-group-plans-laguardia-center-rezoning",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/author/holden-walter-warner/",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/new-york/2025/02/13/durst-organization-sells-halletts-point-stake-to-affinius-capital/",
            "https://therealdeal.com/new-york/2023/02/23/silverstein-scores-165m-to-build-astoria-apartment-building/"
        ],
        "market": "New York"
    },
    {
        "title": "$17M Palm Beach townhome tops signed luxury contracts",
        "url": "https://www.therealdeal.com/miami/2025/08/26/17m-palm-beach-townhome-tops-signed-luxury-contracts/",
        "date": null,
        "subhead": "Palm Beach County luxe buyers signed 11 contracts totaling $64.7M last week",
        "authors": "By Kate Hinsche",
        "pub_date": "Aug 26, 2025, 2:30 PM UTC",
        "pub_date_dt": "2025-08-26T14:30:00",
        "content": "A Palm Beach townhome that sold for $16.5 million in April topped signed luxury contracts in Palm Beach County last week.\nBuyers signed 11 contracts between Aug. 18 and Aug. 24 for luxury properties in Palm Beach County, according to a market report from\nDouglas Elliman’\ns\nEklund-Gomes\nteam. The homes that went pending last week total $64.7 million in asking dollar volume and averaged 150 days on the market. That’s down from\n$117.8 million\nin asking dollar volume for 18 homes the previous week.\nThe team’s report tracks signed contracts for single-family homes and condos asking $3 million or more in the Beaches MLS. It identified 27 new listings, and a total of 994 active listings on the market.\nNine single-family homes and two condos found buyers last week. The condos that went pending are asking an average of $3.4 million, or $1,253 per square foot, and spent an average of 187 days on the market.\nThe single-family homes total $57.9 million in asking dollar volume and averaged 114 days on the market. The average asking price works out to $6.4 million.\n\nThe priciest home to find a buyer is the 4,000-square-foot townhome at 220 Brazilian Avenue in Palm Beach, asking $17 million. Records show the seller is Crystal Lahners, who bought it for\n$16.5 million\nin April. She is the widow of Dr. William Lahners, a prominent ophthalmologist and a partner with Center for Sight (CFS), who died in 2021. She listed their Siesta Key home for $31.5 million in February, but has since delisted it.\nThe Brazilian Avenue townhome was built in 2022 and has four bedrooms, five bathrooms and a pool. It hit the market asking $17 million in May. Chris Leavitt with Douglas Elliman and Ashley Copeland with Brown Harris Stevens have the listing.\nThe second-most expensive home to find a buyer is the nearly 5,100-square-foot waterfront home at 961 Iris Drive in Delray Beach, asking $8 million. Records show the seller is John Acunto, who bought it for $7.5 million in February. It was built on half an acre in 1978 and has four bedrooms, four bathrooms, two half-bathrooms, a pool and a dock, records and the listing show.\nHe listed it for $8 million in March, Zillow shows. Tinka Ellington and Rene Mahfood with Compass have the listing.",
        "related_links": [
            "https://therealdeal.com/company/douglas-elliman/",
            "https://therealdeal.com/tag/eklund-gomes/",
            "https://therealdeal.com/miami/2025/08/19/palm-beach-county-luxe-contracts-surge-to-118m/",
            "https://therealdeal.com/miami/2025/05/06/ecn-capitals-steven-hudson-sells-palm-beach-home-for-17m/"
        ],
        "market": "South Florida"
    },
    {
        "title": "Catellus, Deca pitch retail, warehouses for Phillips 66 refineries",
        "url": "https://www.therealdeal.com/la/2025/08/26/phillips-66-sites-poised-for-retail-warehouse-redevelopment/",
        "date": null,
        "subhead": "Heavy industrial sites in Wilmington, Carson poised for transformation",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 3:59 PM UTC",
        "pub_date_dt": "2025-08-26T15:59:00",
        "content": "Catellus Development and Deca are looking to turn a petroleum refinery near Long Beach into a modern industrial hub with restaurants and retail.\nThe developers have proposed replacing 406 acres of oil-refining operations and another 228-acre refinery site into millions of square feet of industrial space with grocers, restaurants, sports facilities and greenways available to nearby residents, CoStar\nreported\n. If approved, it would be among the largest conversions of previously environmentally hazardous land in California history.\nLast year,\noil giant Phillips 66\ntapped Catellus and Deca to help redevelop its Los Angeles refinery operations which include the 406-acre site at 1660 West Anaheim Street in Wilmington and a 228-acre site at 1520 East Sepulveda Boulevard in Carson. Catellus and Deca have filed plans with the city of Los Angeles for its Five Points Union Specific Plan, which would require zoning changes before any shovels can hit dirt.\nAt the Wilmington site, the Anaheim Street land will be split into two portions: A commercial and recreation strip along Anaheim Street with grocery stores, cafes, sports courts and greenways, and a logistics area with warehouses to the south.\n\nThe Wilmington development would stretch across three parcels including the 410-acre refinery site, a 10-acre vacant lot north of Anaheim Street and a 20-acre propane and butane storage yard. Plans have yet to be announced for the Carson site, though it could be redeveloped for industrial logistics use. It could also face separate legal and logistical hurdles due to its location in the city of Carson.\nIt wouldn’t be the first time Catellus has undertaken such a project.\nIn 2003, the Emeryville-based firm redeveloped the 200-acre former Pacific Refinery Company near San Francisco into a residential subdivision known as Victoria by the Bay. In order to do that, the company had to remove contaminants from the site, not unlike what it will have to do in Wilmington and Carson.\nMeanwhile, in Huntington Beach, Shopoff Realty is\nlooking to redevelop\nthe\nMagnolia Tank Farm\nwith housing.\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://www.costar.com/article/164982279/redevelopment-plans-for-massive-los-angeles-oil-refinery-show-modern-real-estate-needs",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/"
        ],
        "market": "Los Angeles"
    }
]