[
    {
        "title": "David Martin joins Michael Stern and his partners on planned South Beach condo tower",
        "url": "https://www.therealdeal.com/miami/2025/08/25/terra-joins-michael-stern-and-partners-on-south-beach-condos/",
        "date": null,
        "subhead": "Martin’s Terra now has an interest in the deal, spokesperson says",
        "authors": "By Katherine Kallergis",
        "pub_date": "Aug 25, 2025, 9:05 PM UTC",
        "pub_date_dt": "2025-08-25T21:05:00",
        "content": "Developer David Martin is now involved in Michael Stern’s planned luxury condo tower in Miami Beach, sources told\nThe Real Deal\n.\nState records show that in late July,\nMartin’s\nname and Terra’s address were added to LLCs that are tied to the planned project. JDS Pulse, an anonymous blog that\nStern sued in May\n, first disclosed Terra’s involvement.\nMartin’s Coconut Grove-based Terra does have an interest in the deal to develop the condo project at 1250 West Avenue, a spokesperson for Terra confirmed.\nGianluca Vacchi’s\nGV Development and RG Development are also partners in the project. A statement from JDS said that Terra is part of the development team for the project.\nThe developers did not disclose additional details.\nRecords show JDS and its partners have purchased at least two dozen condos at the building at 1250 West Avenue, which is home to the 15-story, circa-1964 Bay Garden Manor condos. It has 238 units. The developer’s 1250 West Ave LLC has been in contract to acquire the remaining majority of units, and could close on them soon, according to sources.\n\nThe JDS-led LLC secured a\ncontentious approval this summer\nfrom the Miami Beach City Commission that will allow for a taller and slimmer tower on the bayfront West Avenue site, which is next to the Stern-developed Monad Terrace luxury condo project.\nThe new building at 1250 West Avenue can be up to 330 feet tall, more than double what was allowed as of right. But a reduction in density brings the maximum number of condos down to 125 units from the 286 allowed by right.\nThe JDS-led venture will redevelop the Bikini Hostel property across the street at 1247 West Avenue as part of a public benefits package it’s providing to the city. The developer has been in contract to buy the property for months. Stern declined to disclose the purchase price at a recent commission meeting.\nThe commission granted final approvals to the development agreement and zoning amendments at a special meeting in late June, where Martin also secured an upzoning for the\nDeauville Beach Resort\nproperty. Martin is a 25 percent owner of that property; the controversial Meruelo family holds the majority interest.\nMartin has a history of involving himself in tricky deals, including the Deauville project. He was working on a bulk purchase of the Castle Beach Club property, an aging condo building in Miami Beach, but that\ndeal expired early last year.\nDevelopers have been increasingly joining forces with their competitors, bringing on additional equity partners or forming a joint venture partnership with other developers as they deal with rising costs. Earlier this year, Martin partnered with Edgardo Defortuna’s Fortune International Group to pay a\nrecord $205 million\nfor a Key Biscayne development site where they plan a 56-unit ultra-luxury condo building.\n",
        "related_links": [
            "https://therealdeal.com/tag/david-martin/",
            "https://therealdeal.com/miami/2025/05/01/michael-stern-sues-over-allegedly-defamatory-website/",
            "https://therealdeal.com/miami/2025/01/13/consultant-alleges-gianluca-vacchis-firm-owes-1-7m-in-fees/",
            "https://therealdeal.com/miami/2025/06/30/michael-sterns-jds-wins-final-ok-for-south-beach-upzoning/",
            "https://therealdeal.com/miami/2025/06/30/meruelos-and-martin-score-final-ok-for-deauville-miami-beach/",
            "https://therealdeal.com/miami/2024/02/14/terras-500m-bid-for-miami-beach-condo-building-expires/",
            "https://therealdeal.com/miami/2025/04/10/terra-fortune-pay-205m-for-silver-sands-key-biscayne-site/",
            "https://therealdeal.com/miami/2025/06/30/michael-sterns-jds-wins-final-ok-for-south-beach-upzoning/",
            "https://therealdeal.com/miami/2025/04/27/miami-beach-commissioners-debate-height-increases/",
            "https://therealdeal.com/miami/2025/05/01/michael-stern-sues-over-allegedly-defamatory-website/"
        ],
        "market": "South Florida"
    },
    {
        "title": "Loan tied to Gem Realty, Flynn’s SF Union Square offices head to sale",
        "url": "https://www.therealdeal.com/san-francisco/2025/08/25/lenders-prepare-to-sell-gem-realty-flynn-properties-debt/",
        "date": null,
        "subhead": "",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 8:44 PM UTC",
        "pub_date_dt": "2025-08-25T20:44:00",
        "content": "K-Star Asset Management isn’t moving to foreclose on two office buildings in San Francisco’s Union Square just yet.\nThe Dallas-based investment firm is planning to begin marketing the debt tied to 222 Kearny Street and 180 Sutter Street this month, the San Francisco Business Times\nreported\n. K-Star became the special servicer managing the $47.5 million in mortgage debt after property owners Gem Realty Capital and Flynn Properties were served a notice of default for the loan in April 2024.\nAn affiliate of Gem and Flynn partnered with the firms to acquire the properties in 2019 for about $75 million, or roughly $516 per square foot. Occupancy at the buildings has plummeted in recent years, from 91 percent in 2019 to 32 percent last September. The appraised value for the 121,000-square-foot 222 Kearny and 24,000-square-foot 180 Sutter fell to $18.3 million, or about $126 per square foot, last summer.\nA potential foreclosure auction has been\nrepeatedly rescheduled\n, most recently to Aug. 28, though it could be delayed again as Gem and Flynn’s lenders seek a third-party buyer for the loan. Auction records list the notice of sale amount as $56.7 million, or $391 per square foot.\n\nFlynn Properties recently acquired one of the 20 largest office buildings in San Francisco,\npaying\n$177 million, or $238 per square foot, in a deed in lieu of foreclosure for\nMarket Center\nin June. The two commercial skyscrapers at 555-575 Market Street were tied down by a $416 million loan from lender ING.\nSan Francisco had the highest office vacancy rate in the country at 34.7 percent in the first quarter,\naccording\nto the Kaplan Group. The city clawed its way out of last place when it came to\nreturn-to-office\nrates in the first quarter.\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://www.bizjournals.com/sanfrancisco/news/2025/08/22/union-square-note-sale-222-kearny.html",
            "https://therealdeal.com/san-francisco/2025/03/25/goldman-pushes-pair-of-union-square-office-buildings-to-auction/",
            "https://therealdeal.com/san-francisco/2025/06/02/restaurant-mogul-greg-flynn-to-buy-san-francisco-office-tower/",
            "https://therealdeal.com/san-francisco/2025/06/02/restaurant-mogul-greg-flynn-to-buy-san-francisco-office-tower/",
            "https://www.kaplancollectionagency.com/business-advice/which-city-could-house-the-most-people-by-converting-empty-offices/",
            "https://therealdeal.com/san-francisco/2025/03/19/san-francisco-no-longer-last-in-return-to-office-rankings/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/san-francisco/2025/03/25/goldman-pushes-pair-of-union-square-office-buildings-to-auction/",
            "https://therealdeal.com/san-francisco/2024/05/01/gem-realty-defaults-on-sf-buildings-with-47m-in-loans/",
            "https://therealdeal.com/san-francisco/2024/07/19/foreclosure-looms-for-gem-realty-and-flynns-sf-offices/"
        ],
        "market": "San Francisco"
    },
    {
        "title": "Real estate donors favor Adams in latest round, but money flow slows",
        "url": "https://www.therealdeal.com/new-york/2025/08/25/real-estate-donations-to-adams-slow/",
        "date": null,
        "subhead": "Mayor took in $60,500 compared to three-figure haul last round",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 25, 2025, 9:34 PM UTC",
        "pub_date_dt": "2025-08-25T21:34:00",
        "content": "After a post-primary spike in donations from real estate executives, Mayor Eric Adams’ campaign saw contributions from the industry level off.\nReal estate donors gave Adams a little more than $60,500 between July 12 and August 18, according to the latest filings with the city’s Campaign Finance Board. That’s down considerably from the more than $480,000 he received from the industry between June 25 and July 11, following former Gov. Andrew Cuomo’s defeat in the Democratic primary.\nThe sudden boost from the industry was\nseen\nas an early sign that real estate professionals — who had rallied behind Cuomo’s campaign leading up to the primary — were shifting support to the mayor’s re-election bid.\nBut over the last month, Adams, who is running as an independent, has ranked fourth in multiple\npolls\n, trailing behind Assembly member and Democratic nominee Zohran Mamdani, Cuomo and Republican nominee Curtis Sliwa. Though he escaped federal corruption charges himself, allegations have continued to plague his inner circle. Last week, current and former members of his administration were\nindicted\non charges related to speeding up construction approvals and steering contracts to certain developers.\nThe real estate contributions during the latest filing period — based on donors who self-reported working within various sectors of the industry — represent roughly 14 percent of the total $425,000 Adams brought in over the last month. During the previous filing period, he received $1.5 million in total donations.\nTodd Shapiro, a spokesperson for the Adams campaign, brushed off any suggestion that the latest donations indicate waning enthusiasm among industry players. He pointed to a number of fundraisers held by real estate executives after the primary.\nSL Green Realty’s Marc Holliday hosted a fundraiser for Adams in July, and employees of the real estate investment trust\ndonated\nmore than $67,000 to the mayor’s re-election period after the primary. Shapiro noted that the donations and fundraisers happen at different times, and looking at one filing period fails to account for big-picture support from the industry.\n“The real estate industry wholeheartedly supports Mayor Eric Adams,” he said.\nBefore news of the indictments, as well as\nreports\nthat one of his campaign advisors handed a reporter a potato chip bag stuffed with cash, real estate executives gave hundreds of thousands of dollars to Empower NYC, a super PAC backing Adams.\nAn LLC tied to Two Trees Management gave the super PAC $100,000 on August 11. GFP Real Estate’s Jeff Gural contributed $25,000 on August 15. In an email, Gural said he still thinks Adams is the best choice, but acknowledged that the “latest batch of arrests make it much harder for that to happen.” He doesn’t, however, intend to support another candidate.\nDeveloper Gary Barnett gave the PAC $250,000 on July 2, and billionaire Alexander Rovt donated $15,000 on June 6. Officials paused a city office lease at Rovt’s 14 Wall Street in November amid questions of whether the property got special treatment because of Rovt’s previous support of Adams. The administration ultimately allowed the lease to\nmove\nforward.\n\nThose who gave the Adams campaign the maximum $2,100 include Tao Group Hospitality co-CEOs Noah Tepperberg and Jason Strauss, based out of Manhattan and Las Vegas, respectively; Harry Bajraktari, whose eponymous Bronx firm owns and manages more than 70 buildings; Corcoran broker Dana Power; Nest Seekers broker Andy Kim; Adam Falk, a principal and co-portfolio manager at BH3 Management in Manhattan; Cushman &amp; Wakefield’s Gil Gideon; and Broadway Construction Group’s Joseph Aiello.\nLandlord Paul Gjonaj gave $1,000, while his brother, former Bronx Council member Mark Gjonaj, also an owner and property manager, gave $500. The former Council member, who had been subject to a\nprobe\nrelated to government contracts awarded to campaign donors (no charges or discipline were ever announced), dropped his bid for re-election in 2021, telling City &amp; State that the “current political climate is not favorable to a centrist ideology.”\nCuomo’s donations from the industry have bounced back since the last filing period. Over the last month, he brought in a little more than $53,700 from the real estate industry. After the primary through July 11, he only received $2,115 in total, with a $25 donation from one real estate agent (at the time, Cuomo’s team indicated that the campaign had stopped fundraising after maxing out on donations ahead of the primary).\nRFR Realty’s Charles and Gabriel Rosen each gave $2,100 in August. Others who gave the maximum amount to Cuomo during this filing period include Icon Realty Management’s Todd Cohen, CBRE’s Ken Meyerson, Florida developer Peter Brock and Rob Vecsler, CEO of Hyperion Group, a development firm based in Manhattan and Miami.\nBetween July 12 and August 18, the Cuomo campaign reported receiving just over $472,500 in donations. The campaign also transferred\n$68,000 from a state account\n.\nThe super PAC, Fix the City, received millions of dollars from industry donors in the lead-up to the primary. The PAC has indicated that it will still support Cuomo in the general election, but it hasn’t received many contributions from real estate donors since the June primary. Equity Residential gave it $10,000 earlier this month.\nMeanwhile, Mamdani reported taking in more than $1 million during this period. Though many in the industry have been critical of Mamdani’s policies,\nsome have donated\nto his campaign. They tend, however, to be nonprofit or affordable developers or otherwise smaller industry players.\nOne developer who donated to Mamdani explained that his support was a product simply of Mamdani being the Democratic nominee, and that the developer’s kids are roughly the same age as the Assembly member and are supporting him.\nMamdani’s latest filings indicate that roughly $19,700 came from real estate-related donors. That included a $2,100 contribution from Obaid Khan, chief financial officer at Tishman Realty.\nOver the last month, Sliwa raised roughly $406,400, with more than $9,000 coming from real estate donors. Attorney Jim Walden, who is running as an independent, received a total of $8,200 over the last month and reported some small donations from construction professionals.\n",
        "related_links": [
            "https://therealdeal.com/new-york/2025/07/16/real-estate-donates-to-eric-adams-mayoral-campaign/",
            "https://www.nytimes.com/interactive/polls/nyc-mayoral-election-polls-2025.html",
            "https://therealdeal.com/new-york/2025/08/21/ingrid-lewis-martin-jesse-hamilton-indicted-on-conspiracy-other-charges/",
            "https://therealdeal.com/new-york/2025/07/16/real-estate-donates-to-eric-adams-mayoral-campaign/",
            "https://www.thecity.nyc/2025/08/20/winnie-greco-eric-adams-aide-attempted-cash-katie-honan-reporter/",
            "https://therealdeal.com/new-york/2025/06/30/city-shrugs-off-concerns-about-14-wall-street-lease/",
            "https://www.cityandstateny.com/politics/2021/02/mark-gjonaj-will-not-run-for-reelection-to-new-york-city-council/175174/",
            "https://nyccfb.info/VSApps/CandidateSummary.aspx?as_cand_id=2993&as_election_cycle=2025&cand_name=Cuomo%2c+Andrew+M&office=Mayor&report=summ",
            "https://therealdeal.com/new-york/2025/07/03/zohran-mamdani-real-estate-industry-donations/",
            "https://therealdeal.com/new-york/2025/07/16/real-estate-donates-to-eric-adams-mayoral-campaign/",
            "https://therealdeal.com/new-york/2025/07/03/zohran-mamdani-real-estate-industry-donations/",
            "https://therealdeal.com/new-york/2025/08/23/real-estate-considers-eric-adams-support/"
        ],
        "market": "New York"
    },
    {
        "title": "Thrive Living secures $65M loan for modular apartments in East Hollywood",
        "url": "https://www.therealdeal.com/la/2025/08/25/jp-morgan-provides-construction-loan-for-modular-apartments/",
        "date": null,
        "subhead": "290-unit affordable property follows firm’s similar modular project in Chinatown",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 9:10 PM UTC",
        "pub_date_dt": "2025-08-25T21:10:00",
        "content": "Thrive Living’s affordable housing development in East Hollywood is moving forward with the help of a $65 million construction loan.\nThe Los Angeles-based developer, an affiliate of New York-based Magnum Real Estate Group, secured the loan from J.P. Morgan for a seven-story building at 1141 North Vermont Avenue, Urbanize Los Angeles\nreported\n.\nThe development will feature 290 studio, one-, two- and three-bedroom units for residents making up to 80 percent of the area median income. In Los Angeles County, this is\ndefined\nas a maximum annual income of $84,850 for one person or $121,450 for a household of four.\nTo bring the 1141 Vermont development to life, Thrive Living will use prefabricated modular units, thus allowing for a speedier construction timeline. Work on the site could be completed within 14 months, according to Urbanize. The property will feature amenities like a rooftop deck, a community room and various landscaped outdoor spaces.\nAnother modular Thrive Living project, a 376-unit development at 1457 North Main Street in Chinatown, also benefited from a J.P. Morgan construction loan, per Urbanize. By using modular construction there, Thrive\nexpects\nto cut costs by 15 percent.\n\nThe area near the Vermont/Santa Monica Metro station, where the 1141 Vermont development will rise, is in the midst of a transformation as other affordable housing projects get underway nearby.\nOutside the train station entrance, Little Tokyo Service Center built a 187-unit affordable housing complex, while one block to the east, Jamison Properties is similarly building a 177-unit mixed-income development.\nPrefabricated modular projects such as Thrive Living’s latest East Hollywood endeavor are proving to be beneficial in the Los Angeles area for both single-family and multifamily developments.\nIn the wake of January’s deadly wildfires, some homeowners in the Eaton and Palisades burn zones have turned to\nprefabricated models\nto erect\ntemporary housing\non their property. As Altadena, the Pacific Palisades, Malibu and other surrounding areas emerge from the ashes, modular housing could end up being a boon for these homeowners .\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://la.urbanize.city/post/modular-housing-nabs-65m-construction-loan-1141-n-vermont-ave-east-hollywood",
            "https://planning.lacounty.gov/wp-content/uploads/2025/05/Income-Limits-2025.pdf",
            "https://therealdeal.com/la/2024/12/05/thrive-expects-15-savings-with-modular-apartments-in-chinatown/",
            "https://therealdeal.com/la/2025/05/09/prefab-home-companies-offer-relief-to-la-fire-victims/",
            "https://therealdeal.com/la/2025/07/23/adus-provide-crucial-housing-to-wildfire-victims/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/la/2024/12/05/thrive-expects-15-savings-with-modular-apartments-in-chinatown/",
            "https://therealdeal.com/la/2024/09/30/thrive-living-to-build-first-us-costco-with-apartments/",
            "https://therealdeal.com/la/2023/01/13/thrive-living-to-put-costco-topped-by-800-apartments-in-baldwin-hills/"
        ],
        "market": "Los Angeles"
    },
    {
        "title": "Price revealed for Waterton’s Warner Center apartment complex buy",
        "url": "https://www.therealdeal.com/la/2025/08/25/waterton-paid-167-million-for-woodland-hills-apartments/",
        "date": null,
        "subhead": "AMLI Residential sold the Woodland Hills property for $167M",
        "authors": "By Alena BotrosResearch byAbigail Nehring",
        "pub_date": "Aug 25, 2025, 9:56 PM UTC",
        "pub_date_dt": "2025-08-25T21:56:00",
        "content": "How much did Waterton pay for the Warner Center?\nIt shelled out $167.4 million for the Woodland Hills apartment complex, property records reveal.\nWaterton\npurchased\nthe 522 apartments from AMLI Residential last month, but a price was not disclosed.\nAMLI Residential developed the property almost two decades ago. The complex at 21200 Kittridge Street is now called The Kitt at Warner Center and boasts a resort-inspired pool and spa, al fresco dining and an outdoor fireplace. The value-add, Chicago-based investor plans to renovate the one-, two-, and three-bedroom apartments and revamp common areas.\n\n“What made it attractive was primarily the value-add upside. The vast majority of units are in either original condition from 2007 or have been partially upgraded over the years. The common areas and amenities can be reconfigured and improved,” Kol Rath, vice president of acquisitions at Waterton, said when the deal was announced. The company, founded and helmed by David Schwartz, owns thousands of apartments in Los Angeles.\nThe Kitt at Warner Center is within a master-planned community, the Warner Center, where the billionaire owner of the Los Angeles Rams, Stanley Kroenke, has proposed a $10 billion\ndevelopment\n.\nWoodland Hills has a 4.3 percent multifamily vacancy rate, and commands $2,788 average rent per apartment, according to a second-quarter CBRE market\nreport\n. That’s on par with typical vacancies and rents throughout the Los Angeles market. The highest multifamily sale price for that period was $126 million for a 235-unit apartment building in Glendale, according to the report.\nWaterton has been pretty active, on the buy and sell side. The company recently began\nmarketing\ntwo 14-story apartment buildings in Chicago. Waterton paid about $82 million for the complex, called Grand Central, two years earlier. In another deal, last year Waterton\npurchased\na San Francisco complex encompassing seven six-story buildings from Brookfield for $177.5 million.\nAMLI last summer\nsold\na 325-unit apartment complex for around $89 million in South Florida.",
        "related_links": [
            "https://www.latimes.com/b2b/commercial-real-estate/story/2025-07-25/522-unit-warner-center-apartment-community-acquired-waterton",
            "https://www.latimes.com/sports/rams/story/2025-04-06/rams-new-headquarters-development-plan-warner-center",
            "https://mktgdocs.cbre.com/2299/e773dd9b-d72e-477a-b6ee-df59b9e6cd75-1176607916/Los_Angeles_Multifamily_Snapsh.pdf",
            "https://therealdeal.com/chicago/2025/08/20/waterton-lists-apartments-amid-chicagos-hot-investor-market/",
            "https://therealdeal.com/san-francisco/2024/09/19/brookfield-exits-sf-apartment-complex-with-178m-sale/",
            "https://therealdeal.com/miami/2024/06/26/amli-residential-sells-sunrise-apartment-complex-to-mesirow/"
        ],
        "market": "Los Angeles"
    },
    {
        "title": "Dry Creek buys distressed $47M Rosemont office loan at discount",
        "url": "https://www.therealdeal.com/chicago/2025/08/25/dry-creek-capital-buys-chicago-office-loan-at-discount/",
        "date": null,
        "subhead": "Deal put Colorado-based creditor in position to seize its second office building near O’Hare in recent months, following Farbman’s deed-in-lieu",
        "authors": "By Sam Lounsberry",
        "pub_date": "Aug 25, 2025, 9:53 PM UTC",
        "pub_date_dt": "2025-08-25T21:53:00",
        "content": "Dry Creek Capital is getting in position to gain a second foothold in the office market with distressed debt deals surrounding Chicago’s O’Hare International Airport.\nThe Denver-based firm acquired the loan note for the $47.3 million non-performing mortgage tied to the O’Hare International Center, a two-building, 530,000-square-foot property at 10255 and 10275 Higgins Road in Rosemont, Steve Emerson of Dry Creek confirmed. The property is owned by Utah-based Bridge Investment Group\nThe loan note traded for about $26.5 million, according to a person familiar with the deal. Emerson declined to discuss the price. But a transaction for that amount would have dealt a blow to Alabama-based lender Regions Bank, which originated a $50 million mortgage loan to Bridge in 2018 for the landlord’s $64 million purchase of the property. Bridge poured another $8 million into improvements during its ownership, meaning the landlord is feeling some financial pain as the property’s value is likely well below its investment.\nThe deal sets Dry Creek up to seize the property from Bridge, though Emerson said the path forward is still being discussed between the companies. The asset is 76 percent leased, according to JLL.\nThis is the buyer’s second distressed debt acquisition in the O’Hare office market. Dry Creek seized the 210,000-square-foot building at 25 Northwest Point Boulevard in Elk Grove Village earlier this summer from a venture of Michigan-based landlord Farbman Group.\nIt may not be Dry Creek’s last deal in the area, either, though it has recently been active in the Washington, D.C., region, Emerson said.\n\n“We’ve got a ton of dry powder,” he said. “We mainly purchase loans from banks.”\nBridge and Farbman are far from the only victims of the downturn for suburban Chicago office properties. The sector is rough for landlords, as vacancy is hovering near record highs of over 30 percent on average, with demand from tenants shrinking as companies cut space while remote and hybrid work schedules linger and interest rates are elevated. Landlords are being forced to offer steep concessions just to attract or keep tenants.\nOn top of that, landlords are skittish about sinking more money into their properties when leasing absorption has been negative for years, leaving a lot of suburban offices stuck in limbo.\nDry Creek stripped Farbman of the Northwest Point property two years after buying the loan note for the building, which took its second consecutive nosedive in value as the former landlord’s loan came due, Cook County property records show. Farbman bought the property for just under $20 million in 2013 from a John Buck Company venture that had bought it in 2007 for $31.5 million. Farbman used a $16 million mortgage loan from KeyBank to finance its acquisition, and distressed debt specialist Dry Creek acquired the note in 2023.\nJLL’s Tom Hall, Kyle Kaminski, Pat Shields and Sam DiFrancesca marketed the O’Hare International Center loan for sale.\n",
        "related_links": [
            "https://therealdeal.com/chicago/2024/11/12/distressed-downtown-chicago-office-towers-discount-deepens/",
            "https://therealdeal.com/chicago/2025/08/08/ohare-has-highest-office-rents-in-chicago-suburbs/",
            "https://therealdeal.com/chicago/2024/05/09/bridge-investment-group-selling-distressed-chicago-office-tower/"
        ],
        "market": "Chicago"
    },
    {
        "title": "R2, Cubed bet on discounted River North loft offices",
        "url": "https://www.therealdeal.com/chicago/2025/08/25/r2-cubed-real-estate-bet-on-discounted-chicago-loft-offices/",
        "date": null,
        "subhead": "Bought small office building for just under $5 million after lender foreclosed",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 10:00 PM UTC",
        "pub_date_dt": "2025-08-25T22:00:00",
        "content": "Boutique office properties are drawing the attention of real estate firms looking for big discounts on well-positioned buildings.\nThat’s the case with a deal inked last week by Chicago-based Cubed Real Estate and developer R2, who jointly paid just shy of $5 million for a River North loft office building, which the lender had seized a year prior, Crain’s\nreported\n. That puts the price at about $95 per square foot. The six-story, 52,500-square-foot building at 225 West Ohio Street was sold well below its going price a decade earlier of $13.3 million. Green Bay-based lender Associated Bank seized the property last year to resolve an outstanding loan on the building.\nAssociated took over the deed in a foreclosure from Dallas-based Transwestern Investment Group last summer. Transwestern refinanced the property in 2020 with a $9.4 million mortgage from Associated. Transwestern paid down the loan balance by $2.7 million, buying an extension beyond the original maturity date in 2023, but eventually the lender seized it.\nThe discounted price reflects the struggle office buildings have faced across the country post-pandemic, as high interest rates and work-from-home policies became the norm.\n\nCubed and R2 are betting on discounted offices increasing in value amid the trend of converting larger office towers into residential, removing some competition, Cubed principal Eric Weber told the outlet.\nThe River North building is 78 percent leased, and the buyers plan to lease it up. The largest tenant in the building is engineering and landscape design firm Terra Engineering. R2 has been testing investor interest in net-leased properties, which are characterized by a single long-term tenant covering most operational costs.\nThe purchase follows a\ntrend\nfor R2, which purchased another six-story building in\nRiver North\nearlier in August.The 70,000-square-foot\noffice\nproperty at 303 West Erie Street sold for $7.5 million, and it followed a similar steep discount pattern. The seller, New York-based Alvarez &amp; Marsal Property Investments, paid double that for the building in 2017.\n—\nEric Weilbacher\n",
        "related_links": [
            "https://www.chicagobusiness.com/commercial-real-estate/local-investors-buy-distressed-river-north-office-building?utm-content=article1-headline&utm_source=Sailthru&utm_medium=email&utm_campaign=Newsletter-commercial-real-estate-report-20250825",
            "https://therealdeal.com/chicago/2023/09/05/r2-goldman-sachs-selling-river-north-rei-building/",
            "https://therealdeal.com/chicago/2025/06/23/urban-innovations-leases-river-north-office-to-livingstone-partners/",
            "https://therealdeal.com/chicago/2025/08/21/next-realty-locks-in-rare-25-year-office-loan-in-chicago/",
            "https://therealdeal.com/chicago/2025/06/23/urban-innovations-leases-river-north-office-to-livingstone-partners/",
            "https://therealdeal.com/chicago/2025/08/21/next-realty-locks-in-rare-25-year-office-loan-in-chicago/",
            "https://therealdeal.com/chicago/2023/09/05/r2-goldman-sachs-selling-river-north-rei-building/"
        ],
        "market": "Chicago"
    },
    {
        "title": "Glencoe weighs incentives for historic homes as teardowns increase",
        "url": "https://www.therealdeal.com/chicago/2025/08/25/chicago-suburb-glencoe-weighs-preservation-incentives/",
        "date": null,
        "subhead": "Preservationists pitched tax breaks, discounted fees",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 9:15 PM UTC",
        "pub_date_dt": "2025-08-25T21:15:00",
        "content": "Glencoe officials are debating how far the village should go to preserve its historic housing stock, as teardown pressure chips away at the North Shore suburb’s architectural legacy.\nThe Preservation Commission pitched a package of new incentives, from tax rebates to permit fee discounts, aimed at encouraging owners to landmark their properties, the Record North Shore\nreported\n. But trustees balked at the potential price tag, questioning whether the village should shoulder the cost of keeping older homes intact.\nGlencoe designates homes in three categories: “certified landmarks,” which carry strict protections and qualify for state and local incentives; “honorary landmarks,” subject only to demolition delays and advisory reviews; and “historically significant” homes, which come with no regulatory teeth. Since 2013, when the state limited tax benefits to certified landmarks only, honorary designations have plummeted — and demolitions have picked up. Just three homes have received honorary status in the past 12 years, compared with 92 between 1990 and 2013. Eight honorary landmarks have been torn down since 2013, nearly matching the 13 lost over the prior two decades.\nIn an effort to reverse the trend, the commission proposed giving certified landmark owners rebates of up to 90 percent on building permit fees and $2,000 annual property tax breaks for eight years. Honorary landmarks would qualify for 50 percent fee rebates. Both programs would be capped annually to control village costs.\n\nThe group also asked trustees to consider zoning incentives, such as flexible setbacks and height allowances, as a lower-cost way to make preservation more appealing. Other recommendations included doubling demolition delays to 360 days and requiring owners to consent to honorary designations. The Village Board asked staff for more detail and is set to revisit the issue at its Sept. 18 meeting.\nThe question of preservation versus development is also being put to the test in other high-end\nChicagoland\nsuburbs. Last year, buyers in Winnetka wanted to tear down a $12.3 million historic mansion known as the\nClement Stone Mansio\nn, at 445 Sheridan Road, a Spanish revival built in 1912. And after rolling out an anti-teardown incentives package in\nHinsdale\nthree years ago, that town’s Historic Preservation Commission changed the minds of the buyers of a 1930s colonial mansion set to be demolished.\n—\nEric Weilbacher\n",
        "related_links": [
            "https://www.therecordnorthshore.org/2025/08/24/glencoe-weighs-options-to-encourage-preservation-discourage-teardowns/",
            "https://therealdeal.com/chicago/2023/03/31/billionaire-justin-ishbia-begins-demolition-for-epic-winnetka-estate/",
            "https://therealdeal.com/chicago/2024/04/05/buyers-request-demolition-for-12-3m-suburban-chicago-mansion/?utm_medium=social&utm_campaign=single_content_share&utm_source=mobile_app",
            "https://therealdeal.com/chicago/2023/12/12/demolition-request-in-hinsdale-historic-district-hits-wall/",
            "https://therealdeal.com/chicago/2024/04/05/buyers-request-demolition-for-12-3m-suburban-chicago-mansion/",
            "https://therealdeal.com/chicago/2023/03/31/billionaire-justin-ishbia-begins-demolition-for-epic-winnetka-estate/",
            "https://therealdeal.com/chicago/2023/12/12/demolition-request-in-hinsdale-historic-district-hits-wall/"
        ],
        "market": "Chicago"
    },
    {
        "title": "NYC’s top deals: Yoel Goldman’s stalled Crown Heights dev site trades for $10M",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/new-york-top-real-estate-deals-monday-aug-25-2025/",
        "date": null,
        "subhead": "TRD reports top transactions for Monday, Aug. 25, 2025",
        "authors": "By Mary Diduch",
        "pub_date": "Aug 26, 2025, 11:00 AM UTC",
        "pub_date_dt": "2025-08-26T11:00:00",
        "content": "There were 158 transactions, totaling $252 million, recorded in New York City on Monday, Aug. 25, 2025.\n🏆 Residential:\nThe top home sale recorded in New York was in the Flatiron District.\nJames and Sally Ratigan\nsold a condominium at\n63 West 17th Street\nfor $7.8 million. The buyers were attorney\nPeter Sluka\nand\nYixiao Feng.\nThe price for the more than 4,100-square-foot, split-level unit works out to about $1,900 per square foot. The condo has six bedrooms and two terraces measuring a combined 1,500 square feet. It had been on and off the market since 2022, when its asking price was $11.5 million, but its most recent asking price was just under $9 million. Compass’\nMichael Keith Davis\nand\nSuzanne Johansson-Cawley\nhad the listing. The Ratigans had paid $5.9 million for the home in 2021.\n🏆 Commercial:\nThe city’s top recorded commercial deal was near Times Square.\nAn investor’s purchase\nof the six-story retail portion of\n229 West 43rd Street\nfor just under $28 million hit records. The property had been home to Gulliver’s Gate and National Geographic before the pandemic. It once belonged to the Kushners, who lost the property to foreclosure last year after paying $295 million for the space a decade ago. The buyer took over the property from the lender and plans to redevelop the property, which is about 35 percent occupied. CBRE’s\nJack Stillwagon\nand Vice Chairman\nDoug Middleton\nbrokered the deal, and BayBridge Real Estate Capital’s\nJay Miller\nand\nAJ Felberbaum\nadvised the buyer.\n📊 Commercial:\nA deal for the stalled and struggling development site at\n1548 Bedford Avenue\nin Crown Heights closed, trading for $10.1 million. The seller was\nYoel Goldman\n’s All Year Management\n, who had planned to build a 100-key hotel there. The buyer was\nAvi Fisher’s Avery Hall\n, who secured a $10 million mortgage from\nMaxim Credit Group\nfor the deal. Goldman, who paid $7 million for the location in 2014, put the entity that owned the site into\nbankruptcy earlier this year\n, valuing the asset at $14 million.\n\n📊 Residential:\nA trust tied to\nAlberto Goldberger\n, a Bloomberg executive, scooped up a sponsor unit at\n200 East 20th Street,\ndeveloped by\nTidhar Group,\nfor $7 million. The Gramercy Park penthouse measures nearly 2,500 square feet. The deal pencils out to about $2,800 per square foot. Douglas Elliman’s\nElena Sarkissian\nand\nJane Powers\nhad the listing, which went live in June at $7.2 million.\n📊 Residential:\nIn Park Slope, a townhouse changed hands for $5.7 million. The buyers of\n647 Baltic Street\nwere\nSina Kian\n, an executive at a blockchain startup, and\nYaira Dubin\n, assistant to the solicitor general. The seller was an LLC managed by\nMeir Shaul\n, who purchased the property in 2021 for $1.3 million. THe home has a private garage, five bedrooms, four and a half bathrooms and a landscaped garden. It went up for sale in January for just under $6.8 million. Serhant’s\nMallory Bogard\nand\nBrandon Bogard\nrepresented the seller, and Compass’\nAaron Mazor\nbrought the buyers.\n📊 Residential:\nMusician Jamie Meline\n, who goes by the stage name El-P and is part of the rap duo Run the Jewels, parted with a townhouse at\n18 Verandah Place\nin Cobble Hill for $5.6 million. The buyer was a trust tied to\nEmily Wilson.\nThe 3,100-square-foot residence, a 28-foot-wide carriage house, has four bedrooms and was put on the market for $6 million in April. Corcoran’s\nKyle Talbott\nand\nKaren Talbott\nhad the listing.\nIf you like this digest, you can get it even earlier — every evening — by subscribing to TRD Data,\nhere\n.",
        "related_links": [
            "https://therealdeal.com/new-york/2025/08/23/nycs-real-estate-rout-office-resi-and-retail-hit-hard/",
            "https://therealdeal.com/new-york/2025/08/21/troubled-times-square-retail-space-sells-for-29m/",
            "https://therealdeal.com/tag/yoel-goldman/",
            "https://therealdeal.com/new-york/2025/01/03/yoel-goldman-puts-brooklyn-site-into-bankruptcy/",
            "https://therealdeal.com/new-york/2018/09/17/a-new-condo-development-may-be-coming-to-gramercy/",
            "https://therealdeal.com/new-york/2025/07/08/williamsburg-townhouse-asking-10m-seeks-neighborhood-record/",
            "https://therealdeal.com/data/latest/"
        ],
        "market": "New York"
    },
    {
        "title": "The Daily Dirt: Real estate donations by the numbers",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/real-estate-donations-in-nyc-mayoral-race/",
        "date": null,
        "subhead": "A rundown of the latest contributions in the mayoral race",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 26, 2025, 11:30 AM UTC",
        "pub_date_dt": "2025-08-26T11:30:00",
        "content": "A month’s worth of political donations isn’t the definitive record of who the real estate industry is supporting in the mayoral race.\nIt is, however, a pulse check. Leading up to the primary, the big industry players were overwhelmingly donating to former Gov. Andrew Cuomo. That changed after he lost, and then Mayor Eric Adams saw a sudden surge in industry donations. He brought in more than $489,000 from real estate donors after the primary, up through July 11.\nNow we have the latest donations, received between July 12 through August 18:\nZohran Mamdani\nReal estate donations: $19,720\nTotal contributions reported this period: $1 million\nEric Adams\nReal estate donations: $60,545\nTotal contributions reported this period: $425,181\nAndrew Cuomo\nReal estate donations: $53,720\nTotal contributions reported this period: $472,537 (plus a $68,225 transfer from a state fund)\nCurtis Sliwa\nReal estate donations: $9,939\nTotal contributions reported this period: $406,392\nJim Walden\n\nReal estate donations: $250\nTotal contributions reported this period: $8,222\nThe bottom line? The industry is still by and large supporting Adams and Cuomo. Donations to the mayor have slowed since the last filing period, but that seemed to be driven by an immediate (panicked) reaction to Cuomo’s primary loss.\nThe next filing deadline is Oct. 3, at which point we should have a better sense of whether the industry is deciding to pull back further on its spending ahead of the general election. Of course, if someone drops out, everything could change.\nWhat we’re thinking about:\nWill anyone drop out of the mayoral race before the general election? Have you heard anything about the land use ballot questions lately? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned:\nThe term synanthrope (undomesticated creatures that live in close proximity to humans, such as rats, pigeons or squirrels) comes from the Greek “syn,” meaning “together with” and anthropos, which is “man,” according to the book “The 99% Invisible City: A Field Guide to The Hidden World of Everyday Design.”\nElsewhere in New York…\n— Mayor Eric Adams’ former chief advisor, Ingrid Lewis-Martin, was indicted last week on charges that she accepted kickbacks, including a brief cameo on the TV show “Godfather of Harlem”, in exchange for interfering with a controversial traffic redesign. But she isn’t the only member of the mayor’s inner circle to get a gig with the show.\nGothamist\nreported that Adams’ son, Jordan Coleman, acted as personal assistant to actor Forest Whitaker during the show’s second season, in what was described by two production employees as a “political hire.”\n— Gothamist\nprofiled\nDrew Warshaw, who is emerging as a challenger to state Comptroller Tom DiNapoli. Warshaw’s platform focused on the affordability crisis. As part of his campaign, he wants to invest $10 billion of the state pension fund into affordable housing projects.\n— Zohran Mamdani’s campaign held a scavenger hunt over the weekend,\nNewsweek\nreported. The activity dovetailed with the mayoral candidate’s campaign promise of fast, free buses, as participants used public transit to cross the city to various stops, several of them transit-themed. —\nQuinn Waller\nClosing Time\nResidential:\nThe top residential deal recorded Monday was for a condominium unit at 63 West 17th Street for\n$7.8 million\n. The unit at The Lyla Condominium is 4,100 square feet and listed by\nCompass’\nThe Davis Team.\nCommercial:\nThe top commercial deal recorded was\n$5.4 million\nfor 856 Greene Avenue. The Bedford-Stuyvesant rental building is three stories, has six units and is 5,800 square feet.\nNew to the Market:\nThe highest price for a residential property hitting the market was $7 million for a penthouse unit at 545 West 110th Street. The Morningside Heights condo is 3,100 square feet.\nCompass’\nDeirdre De Risi and Marissa Galletti have the listing.\nBreaking Ground:\nThe largest new building project filed was for a proposed 222,596-square-foot, six-story school building at 153-10 Hillside Avenue in Queens. Carrie Moore of Skidmore, Owings and Merrill is the applicant of record.\n— Joseph Jungermann",
        "related_links": [
            "mailto:kathryn@therealdeal.com",
            "https://gothamist.com/news/the-godfather-gig-mayor-adams-son-worked-on-tv-show-cited-in-bribery-case-against-ex-adviser",
            "https://gothamist.com/news/battle-of-the-bean-counters-challenger-emerges-for-ny-comptroller",
            "https://www.newsweek.com/zohran-mamdani-held-zcavenger-hunt-across-nyc-what-we-saw-2118571",
            "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025082200118001",
            "https://www.compass.com/listing/63-west-17th-street-unit-7a-manhattan-ny-10011/1631311576342152481/",
            "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025081400706001",
            "https://www.compass.com/listing/545-west-110th-street-unit-ph11a-manhattan-ny-10025/1915349536760792017/"
        ],
        "market": "New York"
    },
    {
        "title": "Billionaire Marc Andreessen fetches $27M for Atherton estate",
        "url": "https://www.therealdeal.com/san-francisco/2025/08/25/marc-andreessen-sells-atherton-mansion-for-27-million/",
        "date": null,
        "subhead": "VC giant sold home after dropping $250M on Malibu properties",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 10:16 PM UTC",
        "pub_date_dt": "2025-08-25T22:16:00",
        "content": "Marc Andreessen is getting out of Dodge — or in this case, Atherton.\nThe billionaire tech investor sold his 12,000-square-foot estate in the wealthy town for nearly $27.2 million, the San Francisco Standard\nreported\n. That’s $2,266 per square foot. The venture capitalist\nlisted the property\nat 164 Elena Avenue for more than $33 million last year. The buyer’s identity hasn’t been disclosed.\nAndreessen paid $16.6 million for the home in 2007. The cofounder of the Andreessen Horowitz venture capital firm and early web browsers Mosaic and Netscape moved in the year after marrying Laura Arrillaga-Andreessen, daughter of billionaire developer John Arrillaga who helped build up Silicon Valley into the tech hub it is today.\nThe main house boasts two kitchens, seven fireplaces and media entertainment options via “visible and concealed screens,” according to the listing.\n\nBesides the main home, the property also has a one-bedroom guest house, a detached studio and a four-car garage partially converted into an office space. The home has a reflecting pool, fountains and a pergola; however, there’s no swimming pool or sports court.\nAndreessen dropped more than $250 million on three properties in Malibu in 2021 and 2022. He, along with basketball power couple Steph and Ayesha Curry, objected to Atherton city officials adding density to the town at that time.\nAtherton has become a go-to escape for Silicon Valley’s tech titans over the past decade. Former Google CEO Eric Schmidt and former Facebook COO Sheryl Sandberg have planted flags in the town over the years. Schmidt\noffloaded\nhis Atherton property last year and\nspent $24 million\non a three-bedroom apartment in San Francisco’s swanky Pacific Heights neighborhood.\nAndreessen’s Atherton home sale price represents about half of the year’s priciest sale in the Peninsula town. That award goes to tech Seagate CEO Stephen Luczo, who\nsold a property\nin April for $51.5 million.\n—\nChris Malone Méndez",
        "related_links": [
            "https://sfstandard.com/2025/08/20/marc-andreessen-atherton-home-sale/",
            "https://therealdeal.com/san-francisco/2024/03/18/billionaire-marc-andreessen-lists-atherton-estate-for-33m/",
            "https://therealdeal.com/san-francisco/2024/05/14/former-google-ceo-eric-schmidt-finds-buyer-for-atherton-home/",
            "https://therealdeal.com/san-francisco/2025/06/16/ex-google-ceo-drops-24-million-on-luxe-apartment/",
            "https://therealdeal.com/san-francisco/2025/04/29/tech-exec-stephen-luczo-sells-atherton-mansion-for-51-5m/",
            "https://therealdeal.com/author/chris-malone-mendez/"
        ],
        "market": "San Francisco"
    },
    {
        "title": "15-bedroom compound asking $5M tops Austin luxury sales",
        "url": "https://www.therealdeal.com/texas/austin/2025/08/26/this-15-bedroom-short-term-rental-topped-austins-home-sales/",
        "date": null,
        "subhead": "Billed as a golden goose for STRs or potential tech HQ, the estate in Bouldin Creek stretched the limits of the single-family classification",
        "authors": "By Isaiah Mitchell",
        "pub_date": "Aug 26, 2025, 12:00 PM UTC",
        "pub_date_dt": "2025-08-26T12:00:00",
        "content": "The most expensive residential property that sold in Austin last week is a suburban compound that sleeps 32 people, according to the Eklund Gomes Team at Douglas Elliman Real Estate.\nThe estate at 1304 Bouldin Avenue packs 15 bedrooms, 13 bathrooms, eight parking spots and a heated pool into a quarter of an acre. The sale price of the 6,400-square-foot property isn’t available, but it was asking $5 million when it sold after 101 days on the market, about $777 per square foot and $1 million higher than its last tax appraisal.\nThe listing agent, Eklund Gomes’ Jeff Burke, didn’t mince words in the listing summary: This single-family home is a business. The Bouldin Compound, as it’s known on Vrbo, is projected to generate $700,000 in revenue this year as a short-term rental. (It’s booked already for Labor Day weekend.) Catering to corporate retreats, the property managers have planned a conference area among other renovations. They’re also “actively working to build partnerships with major events like SXSW, ACL, F1 and the BLAST.tv Major, one of the world’s largest e-sports tournaments,” according to the listing.\n\nThe Bouldin Creek neighborhood is just across the river from downtown Austin and the Rainey Street Historic District, a nightlife hotspot.\nThe property has changed hands three times since it was built in 2018, and every owner after the original — a couple named Samuel and Lucia Ruiz — has been a business. The seller, an LLC registered to Adam Coleman, acquired the property last summer. Travis County hasn’t published records relating to the sale yet.\nThe Bouldin Compound shouldered a West Austin new build to second place in the city’s most-expensive residential sales last month. A five-bedroom mansion on 0.62 acres at 1604 Barclay Drive was asking $3.9 million when it sold last week.\n",
        "related_links": [
            "https://therealdeal.com/texas/2025/07/12/will-nvidias-massive-austin-office-lease-lead-to-revival/",
            "https://therealdeal.com/texas/2025/06/09/lakefront-estate-in-horseshoe-bay-near-austin-asks-10m/",
            "https://therealdeal.com/texas/austin/2025/04/24/15m-mansion-hits-austin-market/"
        ],
        "market": "Texas"
    },
    {
        "title": "Leander Springs lagoon project stagnates with city council denial",
        "url": "https://www.therealdeal.com/texas/austin/2025/08/25/iland-developments-leander-lagoon-project-denied-changes/",
        "date": null,
        "subhead": "iLand Development was denied changes to a city agreement",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 11:00 PM UTC",
        "pub_date_dt": "2025-08-25T23:00:00",
        "content": "The developers of a $1 billion project in Leander were dealt another setback by the Austin suburb.\nAustin-based iLand Development Group’s updated plans for the 78-acre Leander Springs project was denied by the Leander City Council last week, Austin Business Journal\nreported\n. The unanimous vote denied amendments to its public utility district agreement with the city, further delaying any dirt moving on the ambitious mixed-use project centered around a 4-acre artificial lagoon, which was first announced five years ago.\nThe developer requested amendments to reduce the required number of apartments from 1,600 to 1,200, as well as some changes to the timeline. It asked for removal of the date required for certificate of completion on the lagoon, and to remove the time requirement for hotel construction and delivery. The PUD requires the hotel to be complete by the end of 2028.\nThe amendment also would’ve removed the requirement that the Lagoon be open to the public, with admission offered at a discount to Leander residents.\nKey sticking points in moving the development forward have been water usage, stakeholder investment, a terminated\n$22 million\ncity incentive package — lost by tapping the federal EB-5 program, which trades permanent resident status to foreign investors and their families in exchange for investment in commercial enterprises. The Texas Commission on Environmental Quality’s website lists a permit application for an entity tied to the project to discharge up an average of 1.4 million gallons of treated effluent and stormwater per day. Leander Mayor Christine DeLisle has long been skeptical of the project due to concerns over water usage.\n\nAnother request in the PUD amendment was to designate the lagoon as a “non-essential use” in terms of water so that it would have had to comply with conservation.\nAfter  the Aug. 21 meeting, iLand said in a statement that the company is eager to move forward with the project, and that the water management plan presented to the City Council and residents is robust. iLand dropped Miami-based Crystal Lagoons as the lagoon developer, and Austin-based VVater has replaced it.\nThe setbacks don’t stop with just water-use concerns for the project, at FM 2243 and the 183A frontage, intended to transform Leander into a\nCentral Texas\ndestination. Since announcing the project in 2020, iLand has faced setbacks that include $3 million in liens to contractors.\n—\nEric Weilbacher\n",
        "related_links": [
            "https://www.bizjournals.com/austin/news/2025/08/22/leander-springs-lagoon-iland-denied-council.html",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/austin/2025/06/30/lagoon-surf-park-developments-abound-in-central-texas/",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/2025/07/06/lagoon-apartment-development-proposals-abound-in-central-texas/"
        ],
        "market": "Texas"
    },
    {
        "title": "$25M Westlake office redo lures Texas’ largest Century 21 office",
        "url": "https://www.therealdeal.com/texas/dallas/2025/08/25/century-21-mike-bowman-signs-lease-at-westlake-office/",
        "date": null,
        "subhead": "Three recent leases brought 1M-sf property owned by Glenstar, Singerman Real Estate to 80% leased",
        "authors": "By Jess Hardin",
        "pub_date": "Aug 25, 2025, 10:11 PM UTC",
        "pub_date_dt": "2025-08-25T22:11:00",
        "content": "The $25 million renovation of a Westlake office campus has lured tenants, including Texas’s largest Century 21 brokerage.\nCentury 21 Mike Bowman signed one of three new leases at Terraces at Solana, an eight-building, 1.1 million-square-foot office complex at 1500 Solana Boulevard. The leases bring the property’s occupancy to 80 percent, according to a release from property owners Glenstar and Singerman Real Estate, which are based in Chicago.\nThe resi brokerage, which had a 17,000-square-foot office in Grapevine, will occupy 18,000 square feet on the first floor of the 278,000-square-foot Building 8 starting in September.\nIn addition, workforce development company Pluralsight moved its headquarters from Draper, Utah, to a 26,000-square-foot space in Building 6. Defense contractor M1 Support Services is shifting its headquarters from Denton to Building 5 of Terraces, where it inked a deal for 26,000 square feet of the 124,000-square-foot building.\nThe leasing momentum at the property follows a $25 million renovation completed in 2021. The campus now has 50,000 square feet of amenity space, including a restaurant, conference center, gym and covered parking.\n\nThe amenities sealed the deal for Century 21 Mike Bowman, said president Dave Bowman. Specifically, the brokerage will be able to host national events in the conference center.\nThese wins for the property speak to the strength of the office market in Dallas-Fort Worth suburbs. Companies are eager to locate closer to where employees live, in places like Westlake, which is an upscale suburb about 30 miles northwest of Dallas.\nHalfway through the year, JLL reported positive net absorption for the North Texas office market. It was highest in the second quarter in suburbs like Plano, McKinney and Irving’s Las Colinas area.\nVacancy is stuck at 27.7 percent across Dallas-Fort Worth, according to JLL. The high rate is attributable to empty space in the region’s office properties built in the ’80s and ’90s.\nThe vacancy rate has declined for Class A properties, CBRE reported, highlighting the continued prevalence of the flight-to-quality trend that has office users seeking properties with high-end amenities to lure their remote workers back to the office.\n",
        "related_links": [
            "https://therealdeal.com/texas/2025/07/09/dallas-office-market-resilient-in-face-of-economic-uncertainty/",
            "https://therealdeal.com/texas/2025/04/14/suburban-lease-up-shows-strength-of-dallas-office-market/",
            "https://therealdeal.com/texas/dallas/2025/03/06/sally-beauty-relocates-hq-to-planos-legacy-west/"
        ],
        "market": "Texas"
    },
    {
        "title": "Dallas quietly hires Hillwood to scout Mavericks arena sites",
        "url": "https://www.therealdeal.com/texas/dallas/2025/08/25/dallas-quietly-hires-hillwood-to-scout-mavericks-arena-sites/",
        "date": null,
        "subhead": "$75K contract kept under wraps as team weighs move from American Airlines Center",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 10:06 PM UTC",
        "pub_date_dt": "2025-08-25T22:06:00",
        "content": "Dallas has been working behind the scenes to map out a new home for the Mavericks, even as officials keep the details under wraps.\nThe city hired Hillwood Urban Services this spring under a $75,000 consulting deal to identify potential sites for a new NBA arena, the Dallas Morning News\nreported\n. The three-month contract — approved administratively without City Council sign-off — tasked Hillwood with site evaluations, feasibility analysis and final recommendations for where the Mavs might land after their lease at American Airlines Center expires in 2031, in time to open an arena by the 2031-2032 NBA season.\nNeither the city nor Hillwood, the developer behind the AAC and Victory Park, disclosed what sites were studied. Dallas rejected a public records request  from the outlet for related documents, citing confidentiality exemptions tied to economic development negotiations. The city appealed to the Texas Attorney General to keep the information sealed, saying disclosure would reveal incentive offers still in play.\n\nThe cloak-and-dagger approach comes as speculation mounts. Mavericks CEO Rick Welts confirmed last month that officials floated several possible locations and said the team is assessing two of them, though he cautioned that “neither may work.” Sources have suggested possibilities ranging from land near the planned convention center downtown to the former Valley View mall site in North Dallas. The county-owned jail land has also been floated, though officials say no talks have occurred.\nWelts, who previously oversaw the development of the $1.4 billion Chase Center in San Francisco during his time with the\nGolden State Warriors\n, said the\nMavericks\nare leaning toward a basketball-only facility. Hiring Welts to lead the organization last year might also provide fuel to the idea of anchoring a new stadium to a\ncasino\n.\nThe hunt for a site is only half the battle — financing could prove far trickier. In San Antonio, where officials are mulling a $1.3 billion arena for the\nSpurs\n, the funding plan includes $311 million in tourism taxes and up to $489 million in city money, alongside $500 million from the team.—\nEric Weilbacher\n",
        "related_links": [
            "https://www.dallasnews.com/news/politics/2025/08/20/dallas-hired-firm-to-find-recommend-new-sites-for-new-mavericks-arena/",
            "https://therealdeal.com/texas/dallas/2025/04/18/dallas-mavericks-seeking-arena-site-within-city-limits/",
            "https://therealdeal.com/texas/dallas/2025/03/21/dallas-suburb-approves-las-vegas-sands-resort-without-casino/",
            "https://therealdeal.com/texas/dallas/2024/12/19/dallas-mavericks-hire-ceo-at-helm-of-stadium-development/",
            "https://therealdeal.com/texas/san-antonio/2025/08/20/spurs-arena-plan-ties-venue-to-massive-mixed-use-buildout/",
            "https://therealdeal.com/texas/dallas/2025/04/18/dallas-mavericks-seeking-arena-site-within-city-limits/",
            "https://therealdeal.com/texas/dallas/2024/12/19/dallas-mavericks-hire-ceo-at-helm-of-stadium-development/",
            "https://therealdeal.com/texas/san-antonio/2025/08/20/spurs-arena-plan-ties-venue-to-massive-mixed-use-buildout/"
        ],
        "market": "Texas"
    },
    {
        "title": "Boston developer with $6B pipeline skips NYC",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/why-developer-michael-fallon-loves-nyc-but-builds-in-southeast/",
        "date": null,
        "subhead": "Fallon Company CEO explains why he prefers Charlotte, Raleigh and Nashville",
        "authors": "By Erik Engquist",
        "pub_date": "Aug 26, 2025, 2:00 PM UTC",
        "pub_date_dt": "2025-08-26T14:00:00",
        "content": "Two decades ago, the\nFallon Company\ndeveloped a 20-unit condominium on Sackett Street in Brooklyn. Since then the Boston-based builder has finished more than $5 billion worth of projects, but not a single one in New York City.\nIt’s not because CEO Michael Fallon, whose father\nJoseph Fallon\nfounded the company in 1993, has anything against New York City.\n“New York is such a fabulous place,” he said, describing it as the social, cultural and business mecca of the United States. “It’s such a deep pool of opportunity.”\nYet Fallon sees greener pastures for his firm in the Southeast, in particular Nashville and Charlotte, as well as his home market of Boston.\n“Why are we focused on the markets we’re focused on? Scale and access to capital,” the 36-year-old said in a Zoom interview with\nThe Real Deal\n.\nFallon likes building in Nashville and Charlotte because of their good infrastructure, financial health, amenable stakeholders, business-friendly political climates and nice weather. Also, both have a National Football League franchise.\nMost of Fallon’s $6 billion pipeline is in the Southeast. There, he doesn’t have to worry that locals will elect political leaders eager to “decommoditize” housing — a concept that popped up as Fallon researched\nZohran Mamdani\nin preparation for his\nTRD\ninterview.\nIn one campaign video, Mamdani says, “If we want to end the housing crisis, the solution has to be moving toward the\nfull de-commodification of housing\n.”\nTo the contrary, the only feasible strategy to end — or prevent — a housing crisis is to allow for-profit development at scale.\nFallon does that by building affordable units the traditional way, typically with Low Income Housing Tax Credits, partnerships with big insurers such as Mass Mutual and Prudential, and debt from major lenders including\nFortress Investment Group\n; Santander,\nBank OZK\n, Wells Fargo and Key Bank.\nThe first phase of his next\nNashville project\nwill be 100 percent affordable and have north of 300 units. In the second phase, 10 percent of the units will be income-restricted. The\n$3 billion project\n, of which Fallon is the master developer, is expected to break ground next year.\n\nFallon is also working with\nCharlotte’s housing authority\non a mixed-use project with 975 residential units, 405,000 square feet of office, 36,000 square feet of retail and amenities, and a 180-key hotel. Phase one includes 329 units, 20 percent of which will be affordable.\nTo be sure, the Fallon Company’s last New York project was long before the socialist Mamdani came along. It has steered clear because like most developers, it prefers to operate in markets where it knows the players and the regulatory, cultural and political environment.\n“It’s about de-risking that whole spectrum of development as much as you can,” the CEO said. “In New York, it’s very complex and challenging to build.”\nHis company has been in Charlotte since 2016, Raleigh since 2018 and Nashville since 2019.\n“Nashville in particular is very focused on ‘how do we make this a compelling investment opportunity for a company relocation?’” Fallon said. “You need the city to remove friction points, and that is what the city and state are really good at.”\nTennessee’s capital city is pursuing smart growth and striving to be competitive with other Southeast markets in attracting development, the CEO said.\nNew York has become more\nhospitable\nto new housing since the city’s vacancy rate was found to have sunk to a\nrecord low of 1.4 percent\nin 2023, but it still requires\nhigh wages\nand\nsubstantial affordability\nin large multifamily projects. The hotel workers union has effectively\nblocked nonunion hotels\n. Rezoning remains a\ncrapshoot\n, and\nhistoric districts\nand\nlocal opposition\nare major obstacles.\nDoing a big project in New York would mean navigating these pitfalls and competing with firms familiar with the ins and outs of the city; Fallon cited the Related Companies’\nHudson Yards\nand Tishman Speyer’s\nthe Spiral\nas among his favorite developments. He would also have to find investors to bet on that proposition.\n“We need to focus on markets where we have a competitive edge in product, in relationships, in policy,” Fallon said. “That works for partners with very long-term capital.”\n",
        "related_links": [
            "https://therealdeal.com/company/the-fallon-company/",
            "https://therealdeal.com/miami/2024/05/02/resi-roundup-real-estate-beverage-and-concrete-moguls-buy-and-sell-south-florida-homes/",
            "https://therealdeal.com/people/zohran-mamdani/",
            "https://www.foxnews.com/politics/resurfaced-video-shows-nyc-mayoral-hopeful-saying-he-wants-replace-private-homes-communal-living",
            "https://therealdeal.com/new-york/2025/03/31/steve-stuart-to-leave-fortress/",
            "https://www.bloomberg.com/news/features/2018-07-10/how-a-tiny-bank-from-the-ozarks-got-big-and-outpaced-wall-street",
            "https://therealdeal.com/national/nashville/2025/01/31/nashvilles-east-bank-developer-fallon-co-hires-mixed-use-pro/",
            "https://therealdeal.com/national/nashville/2025/06/26/nashvilles-east-bank-megadevelopment-draws-lawmaker-scrutiny/",
            "https://therealdeal.com/national/charlotte/2024/03/15/fallon-co-to-start-affordable-development-in-charlotte/",
            "https://therealdeal.com/new-york/2024/01/05/pro-housing-forces-turn-tide-in-brooklyn-the-daily-dirt/",
            "https://www.nyc.gov/site/hpd/news/007-24/new-york-city-s-vacancy-rate-reaches-historic-low-1-4-percent-demanding-urgent-action-new#/0",
            "https://therealdeal.com/new-york/2025/03/21/the-era-of-99-unit-buildings-has-arrived/",
            "https://therealdeal.com/new-york/2024/04/24/developers-weigh-in-on-new-yorks-485x-tax-break/",
            "https://therealdeal.com/new-york/2022/12/09/how-special-are-these-permits-no-one-got-any/",
            "https://therealdeal.com/new-york/2024/02/07/council-member-crystal-hudson-crushes-crown-heights-project/",
            "https://therealdeal.com/new-york/2024/05/21/court-hands-win-to-howard-hughes-250-water-street/",
            "https://therealdeal.com/new-york/2023/03/15/brooklyn-housing-project-killed-by-city-council/",
            "https://therealdeal.com/new-york/2025/07/01/how-related-companies-got-hudson-yards-approved-and-saved-2b/",
            "https://therealdeal.com/new-york/2025/01/07/tishman-speyer-seeks-to-refi-the-spiral-with-2-7b-bond-sale/",
            "https://therealdeal.com/national/nashville/2025/06/26/nashvilles-east-bank-megadevelopment-draws-lawmaker-scrutiny/",
            "https://therealdeal.com/national/nashville/2025/01/31/nashvilles-east-bank-developer-fallon-co-hires-mixed-use-pro/",
            "https://therealdeal.com/national/charlotte/2024/03/15/fallon-co-to-start-affordable-development-in-charlotte/"
        ],
        "market": "New York"
    },
    {
        "title": "Mansions at Acqualina closing tops Miami-Dade weekly condo sales",
        "url": "https://www.therealdeal.com/miami/2025/08/26/miami-dade-county-weekly-condo-sales-drop-to-49m/",
        "date": null,
        "subhead": "Seventy-six sales totaled $49M in dollar volume last week",
        "authors": "By Kate HinscheResearch byAdam Farence",
        "pub_date": "Aug 26, 2025, 1:45 PM UTC",
        "pub_date_dt": "2025-08-26T13:45:00",
        "content": "Miami-Dade County’s condo dollar volume dropped last week, despite a boost in sales.\nBrokers closed 76 condo sales totaling $49 million from Aug. 18 to Aug. 24. The previous week, brokers closed 55 condo sales totaling\n$94.2 million\n.\nLast week’s units sold for an average of $644,907, lower than the $1,713,245 average price from the previous week. The average price per square foot fell to $493 from $820, according to data from Redfin.\nFor the top 10 sales, prices ranged from $1.3 million to $6.9 million.\nUnit 902 at Mansions at Acqualina, at 17749 Collins Avenue in Sunny Isles Beach, took the top spot with a $6.9 million closing. The sale closed at $1,502 per square foot after nine days on market.\nMaria Barbosa with Elite International Realty had the listing, and Marvin Anhalt with Anhalt Realty brought the buyer.\nUnit 2104 at Asia Brickell Key, at 900 Brickell Key Boulevard in Miami, closed for the second highest amount, $2.4 million, or $912 per square foot after 110 days on market.\nChristopher Jude with PGutman LLC had the listing, and Daniel Hernandez with Compass brought the buyer.\nHere’s a breakdown of the top 10 sales from Aug. 18 to Aug. 24:\n\nMost Expensive\nMansions at Acqualina, 17749 Collins Avenue, unit 902, in Sunny Isles Beach | Price: $6,925,000 | $1,502 psf | Listing agent: Maria Barbosa with Elite International Realty | Buyer’s agent: Marvin Anhalt with Anhalt Realty\nLeast Expensive\nAtlantic One at the Point, 21200 Point Place, unit 1802, in Aventura | Price: $1,300,000 | $476 psf | Listing agent: Paola Wagener with Charles Rutenberg Realty\nHighest Price Per Square Foot\nMansions at Acqualina, 17749 Collins Avenue, unit 902, in Sunny Isles Beach | Price: $6,925,000 | $1,502 psf | Listing agent: Maria Barbosa with Elite International Realty | Buyer’s agent: Marvin Anhalt with Anhalt Realty\nLowest Price Per Square Foot\nAtlantic One at the Point, 21200 Point Place, unit 1802, in Aventura | Price: $1,300,000 | $476 psf | Listing agent: Paola Wagener with Charles Rutenberg Realty",
        "related_links": [
            "https://therealdeal.com/miami/2025/08/19/miami-dade-county-weekly-condo-sales-reach-94m/"
        ],
        "market": "South Florida"
    },
    {
        "title": "August slowdown loud and clear as LA signed contract volume falls",
        "url": "https://www.therealdeal.com/la/2025/08/26/las-signed-luxury-contracts-asking-volume-slips-44/",
        "date": null,
        "subhead": "Asking volume for the week fell to $86.7M across 14 contracts for luxury homes",
        "authors": "By Kari Hamanaka",
        "pub_date": "Aug 26, 2025, 2:00 PM UTC",
        "pub_date_dt": "2025-08-26T14:00:00",
        "content": "Maybe it was the heat wave.\nSigned contracts last week in L.A. County fell 44 percent from a year ago to $86.7 million in asking volume, in what some in the industry are calling August’s typical\nsummer cool down\n. Fourteen properties went into contract last week, which is four fewer than the comparable period in 2024, according to the\nEklund Weekly Luxury Report Los Angeles\n.\nThe report is compiled by Marcy Roth of Douglas Elliman’s Eklund Gomes team and counts single-family homes and condominiums listed at $4 million or more in the Multiple Listing Service.\nRoth called the week’s performance a “simple blip in the market,” that is historically seen with the back-to-school period.\n“August is traditionally our slowest month of the year and has, previous to this week, been performing above expectations, so we see no cause for alarm in regards to a decline in the market,” Roth said.\nTopping last week’s signed contracts was 130 South Cliffwood Avenue, which has a listing price just shy of $14 million.\nBerkshire Hathaway HomeServices California Properties’ David Offer holds the listing on behalf of a family trust, according to property records.\n\nThe\nBrentwood\nresidence has seven bedrooms and eight bathrooms, coming in at nearly 6,300 square feet. The lot is more than 20,000 square feet sitting behind gates with hedges for further privacy. Built in 1925, the New England traditional-style home recently received some touch-ups that included oak floors and interior paint.\nAside from the main residence, there’s a two-story guest house with a bedroom, kitchenette and two bathrooms. Outdoors has a pool and sprawling lawns.\nThe next priciest listing to go into contract last week was 1760 Carla Ridge in Beverly Hills, which is listed for $13.5 million.\nThe Beverly Hills Estates’ Robby Sutton and Rayni Williams are the listing agents. Property records show a family trust is selling the home.\nThe Trousdale Estates residence has five bedrooms and five bathrooms across nearly 5,000 square feet. It offers big views of Century City, Downtown Los Angeles, the ocean and the Santa Monica Mountains.\nThe Mid-Century modern home was designed by Rex Lotery, the architect behind Elvis Presley’s Trousdale Estates home.\n",
        "related_links": [
            "https://therealdeal.com/la/2025/08/06/signed-contracts-in-las-high-end-fall/",
            "https://therealdeal.com/la/2025/08/19/manse-at-the-riviera-country-clubs-7th-hole-asks-110m/",
            "https://therealdeal.com/la/2025/08/12/spec-developers-brentwood-project-asking-24m-tops-la-signed-contracts/",
            "https://therealdeal.com/la/2025/08/19/manse-at-the-riviera-country-clubs-7th-hole-asks-110m/",
            "https://therealdeal.com/la/2025/08/12/spec-developers-brentwood-project-asking-24m-tops-la-signed-contracts/",
            "https://therealdeal.com/la/2025/08/06/signed-contracts-in-las-high-end-fall/"
        ],
        "market": "Los Angeles"
    },
    {
        "title": "Alloy secures $500M for “world’s tallest” passive house building",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/alloy-snags-500m-for-one-third-avenue/",
        "date": null,
        "subhead": "Kayne Anderson, Vistria are providing $495M for energy-efficient Brooklyn project",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 26, 2025, 3:00 PM UTC",
        "pub_date_dt": "2025-08-26T15:00:00",
        "content": "Developers of what is poised to be the world’s tallest passive house building in the world secured $500 million to get the project off the ground.\nAlloy Development on Monday closed on $375 million in loans from Kayne Anderson Real Estate for One Third Avenue, a 583-unit tower planned for Downtown Brooklyn. Additionally, Vistria Group, in its first ground-up development, is infusing $120 million in equity and taking a majority stake in the project as a limited partner. Alloy, as general partner, will continue to lead development and is kicking in $40 million.\nAccording to Alloy, the 730-foot tower is slated to be the world’s tallest built to passive house standards, a design method aimed at cutting energy costs through extreme insulation. The project is the second phase of “Alloy Block,” which includes the city’s first all-electric skyscraper at 505 State Street and two public schools (also passive house) at 489 State Street.\n\nOne Third Avenue will include 143 affordable housing units, with monthly rents starting at $1,023 per month. These apartments will be reserved for tenants earning, on average, 60 percent of the area median income.\nResidential space will span the 11th through 60th floors, and the tower’s podium will include 60,000 square feet of office space. Two buildings constructed in the 1800s on State Street and Schermerhorn Street will also be incorporated into the development, and house 30,000 square feet of retail space.\nDemolition work on the site began earlier this year, and the development team expects to begin construction in the fall.\nWhen finished, Alloy Block is expected to include more than 1,000 homes, with 200 set aside as permanently affordable. The electric tower at 505 State Street was completed in July 2024. The developers\nsecured\n$290 million to replace a $210 million construction loan in December.\n",
        "related_links": [
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/05/city-council-approves-city-of-yes-for-housing-opportunity/"
        ],
        "market": "New York"
    },
    {
        "title": "Owner proposes rezoning LaGuardia Center in Astoria",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/owner-proposes-rezoning-laguardia-center-in-astoria/",
        "date": null,
        "subhead": "Rosenwach Group eyes nearly 500 apartments above shopping center",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 2:25 PM UTC",
        "pub_date_dt": "2025-08-26T14:25:00",
        "content": "The family-run Rosenwach Group is thinking of adding opportunities for hundreds of families to live at the site of a shopping center in Astoria.\nRosenwach filed an application with the Department of City Planning to rezone the LaGuardia Center at 43-02 Ditmars Boulevard in the Queens neighborhood, Crain’s\nreported\n. The firm wants to turn the low-rise shopping center into a mixed-use complex with nearly 500 units.\nRosenwach proposed a 412,000-square-foot complex that would be between eight and ten stories tall. The property would include 492 residential units, 25 percent of which would be affordable for those earning a maximum of 60 percent of the area median income.\nThe proposal also includes a significant retail component — 62,000 square feet in all on the ground floor, including a 2,300-square-foot cafe and gallery — which would allow the tenants of LaGuardia Center to remain in place when the redevelopment is completed. Tenants include a supermarket, a laundromat, a bank and restaurants.\nAdditional aspects of the proposal include a landscaped public terrace and parking for 175 vehicles.\n\n“We always thought that the center — now and hopefully in the future — was the heartbeat of the neighborhood,” director of operations Henry Rosenwach told the outlet. “We really just want to take it one step further for the community.”\nDevelopment costs and timeline were not disclosed. Because of previous work, however, Rosenwach expects to qualify for the lapsed 421a tax break, for which construction needs to be completed by the middle of June 2031 after the deadline was extended last year.\nRosenwach acquired the site in 1989 for an undisclosed price and operates out of the address. In addition to being a landlord, the firm also helped develop rooftop water towers across the city.\nElsewhere on Ditmars, Pasadena-based hospitality investor ASAP Holdings\nfiled a rezoning application\ntowards the end of 2023 to replace the 410 parking spaces at the New York LaGuardia Airport Marriott with a mixed-use building containing 437 apartments and a separate structure containing 98 affordable residences for seniors.\n—\nHolden Walter-Warner\n",
        "related_links": [
            "https://www.crainsnewyork.com/real-estate/rosenwach-group-plans-laguardia-center-rezoning",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/author/holden-walter-warner/",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/new-york/2025/02/13/durst-organization-sells-halletts-point-stake-to-affinius-capital/",
            "https://therealdeal.com/new-york/2023/02/23/silverstein-scores-165m-to-build-astoria-apartment-building/"
        ],
        "market": "New York"
    },
    {
        "title": "$17M Palm Beach townhome tops signed luxury contracts",
        "url": "https://www.therealdeal.com/miami/2025/08/26/17m-palm-beach-townhome-tops-signed-luxury-contracts/",
        "date": null,
        "subhead": "Palm Beach County luxe buyers signed 11 contracts totaling $64.7M last week",
        "authors": "By Kate Hinsche",
        "pub_date": "Aug 26, 2025, 2:30 PM UTC",
        "pub_date_dt": "2025-08-26T14:30:00",
        "content": "A Palm Beach townhome that sold for $16.5 million in April topped signed luxury contracts in Palm Beach County last week.\nBuyers signed 11 contracts between Aug. 18 and Aug. 24 for luxury properties in Palm Beach County, according to a market report from\nDouglas Elliman’\ns\nEklund-Gomes\nteam. The homes that went pending last week total $64.7 million in asking dollar volume and averaged 150 days on the market. That’s down from\n$117.8 million\nin asking dollar volume for 18 homes the previous week.\nThe team’s report tracks signed contracts for single-family homes and condos asking $3 million or more in the Beaches MLS. It identified 27 new listings, and a total of 994 active listings on the market.\nNine single-family homes and two condos found buyers last week. The condos that went pending are asking an average of $3.4 million, or $1,253 per square foot, and spent an average of 187 days on the market.\nThe single-family homes total $57.9 million in asking dollar volume and averaged 114 days on the market. The average asking price works out to $6.4 million.\n\nThe priciest home to find a buyer is the 4,000-square-foot townhome at 220 Brazilian Avenue in Palm Beach, asking $17 million. Records show the seller is Crystal Lahners, who bought it for\n$16.5 million\nin April. She is the widow of Dr. William Lahners, a prominent ophthalmologist and a partner with Center for Sight (CFS), who died in 2021. She listed their Siesta Key home for $31.5 million in February, but has since delisted it.\nThe Brazilian Avenue townhome was built in 2022 and has four bedrooms, five bathrooms and a pool. It hit the market asking $17 million in May. Chris Leavitt with Douglas Elliman and Ashley Copeland with Brown Harris Stevens have the listing.\nThe second-most expensive home to find a buyer is the nearly 5,100-square-foot waterfront home at 961 Iris Drive in Delray Beach, asking $8 million. Records show the seller is John Acunto, who bought it for $7.5 million in February. It was built on half an acre in 1978 and has four bedrooms, four bathrooms, two half-bathrooms, a pool and a dock, records and the listing show.\nHe listed it for $8 million in March, Zillow shows. Tinka Ellington and Rene Mahfood with Compass have the listing.",
        "related_links": [
            "https://therealdeal.com/company/douglas-elliman/",
            "https://therealdeal.com/tag/eklund-gomes/",
            "https://therealdeal.com/miami/2025/08/19/palm-beach-county-luxe-contracts-surge-to-118m/",
            "https://therealdeal.com/miami/2025/05/06/ecn-capitals-steven-hudson-sells-palm-beach-home-for-17m/"
        ],
        "market": "South Florida"
    },
    {
        "title": "Catellus, Deca pitch retail, warehouses for Phillips 66 refineries",
        "url": "https://www.therealdeal.com/la/2025/08/26/phillips-66-sites-poised-for-retail-warehouse-redevelopment/",
        "date": null,
        "subhead": "Heavy industrial sites in Wilmington, Carson poised for transformation",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 3:59 PM UTC",
        "pub_date_dt": "2025-08-26T15:59:00",
        "content": "Catellus Development and Deca are looking to turn a petroleum refinery near Long Beach into a modern industrial hub with restaurants and retail.\nThe developers have proposed replacing 406 acres of oil-refining operations and another 228-acre refinery site into millions of square feet of industrial space with grocers, restaurants, sports facilities and greenways available to nearby residents, CoStar\nreported\n. If approved, it would be among the largest conversions of previously environmentally hazardous land in California history.\nLast year,\noil giant Phillips 66\ntapped Catellus and Deca to help redevelop its Los Angeles refinery operations which include the 406-acre site at 1660 West Anaheim Street in Wilmington and a 228-acre site at 1520 East Sepulveda Boulevard in Carson. Catellus and Deca have filed plans with the city of Los Angeles for its Five Points Union Specific Plan, which would require zoning changes before any shovels can hit dirt.\nAt the Wilmington site, the Anaheim Street land will be split into two portions: A commercial and recreation strip along Anaheim Street with grocery stores, cafes, sports courts and greenways, and a logistics area with warehouses to the south.\n\nThe Wilmington development would stretch across three parcels including the 410-acre refinery site, a 10-acre vacant lot north of Anaheim Street and a 20-acre propane and butane storage yard. Plans have yet to be announced for the Carson site, though it could be redeveloped for industrial logistics use. It could also face separate legal and logistical hurdles due to its location in the city of Carson.\nIt wouldn’t be the first time Catellus has undertaken such a project.\nIn 2003, the Emeryville-based firm redeveloped the 200-acre former Pacific Refinery Company near San Francisco into a residential subdivision known as Victoria by the Bay. In order to do that, the company had to remove contaminants from the site, not unlike what it will have to do in Wilmington and Carson.\nMeanwhile, in Huntington Beach, Shopoff Realty is\nlooking to redevelop\nthe\nMagnolia Tank Farm\nwith housing.\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://www.costar.com/article/164982279/redevelopment-plans-for-massive-los-angeles-oil-refinery-show-modern-real-estate-needs",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/"
        ],
        "market": "Los Angeles"
    }
]