[
    {
        "title": "NYC’s top deals: Yoel Goldman’s stalled Crown Heights dev site trades for $10M",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/new-york-top-real-estate-deals-monday-aug-25-2025/",
        "date": null,
        "subhead": "TRD reports top transactions for Monday, Aug. 25, 2025",
        "authors": "By Mary Diduch",
        "pub_date": "Aug 26, 2025, 11:00 AM UTC",
        "pub_date_dt": "2025-08-26T11:00:00",
        "content": "There were 158 transactions, totaling $252 million, recorded in New York City on Monday, Aug. 25, 2025.\n🏆 Residential:\nThe top home sale recorded in New York was in the Flatiron District.\nJames and Sally Ratigan\nsold a condominium at\n63 West 17th Street\nfor $7.8 million. The buyers were attorney\nPeter Sluka\nand\nYixiao Feng.\nThe price for the more than 4,100-square-foot, split-level unit works out to about $1,900 per square foot. The condo has six bedrooms and two terraces measuring a combined 1,500 square feet. It had been on and off the market since 2022, when its asking price was $11.5 million, but its most recent asking price was just under $9 million. Compass’\nMichael Keith Davis\nand\nSuzanne Johansson-Cawley\nhad the listing. The Ratigans had paid $5.9 million for the home in 2021.\n🏆 Commercial:\nThe city’s top recorded commercial deal was near Times Square.\nAn investor’s purchase\nof the six-story retail portion of\n229 West 43rd Street\nfor just under $28 million hit records. The property had been home to Gulliver’s Gate and National Geographic before the pandemic. It once belonged to the Kushners, who lost the property to foreclosure last year after paying $295 million for the space a decade ago. The buyer took over the property from the lender and plans to redevelop the property, which is about 35 percent occupied. CBRE’s\nJack Stillwagon\nand Vice Chairman\nDoug Middleton\nbrokered the deal, and BayBridge Real Estate Capital’s\nJay Miller\nand\nAJ Felberbaum\nadvised the buyer.\n📊 Commercial:\nA deal for the stalled and struggling development site at\n1548 Bedford Avenue\nin Crown Heights closed, trading for $10.1 million. The seller was\nYoel Goldman\n’s All Year Management\n, who had planned to build a 100-key hotel there. The buyer was\nAvi Fisher’s Avery Hall\n, who secured a $10 million mortgage from\nMaxim Credit Group\nfor the deal. Goldman, who paid $7 million for the location in 2014, put the entity that owned the site into\nbankruptcy earlier this year\n, valuing the asset at $14 million.\n\n📊 Residential:\nA trust tied to\nAlberto Goldberger\n, a Bloomberg executive, scooped up a sponsor unit at\n200 East 20th Street,\ndeveloped by\nTidhar Group,\nfor $7 million. The Gramercy Park penthouse measures nearly 2,500 square feet. The deal pencils out to about $2,800 per square foot. Douglas Elliman’s\nElena Sarkissian\nand\nJane Powers\nhad the listing, which went live in June at $7.2 million.\n📊 Residential:\nIn Park Slope, a townhouse changed hands for $5.7 million. The buyers of\n647 Baltic Street\nwere\nSina Kian\n, an executive at a blockchain startup, and\nYaira Dubin\n, assistant to the solicitor general. The seller was an LLC managed by\nMeir Shaul\n, who purchased the property in 2021 for $1.3 million. THe home has a private garage, five bedrooms, four and a half bathrooms and a landscaped garden. It went up for sale in January for just under $6.8 million. Serhant’s\nMallory Bogard\nand\nBrandon Bogard\nrepresented the seller, and Compass’\nAaron Mazor\nbrought the buyers.\n📊 Residential:\nMusician Jamie Meline\n, who goes by the stage name El-P and is part of the rap duo Run the Jewels, parted with a townhouse at\n18 Verandah Place\nin Cobble Hill for $5.6 million. The buyer was a trust tied to\nEmily Wilson.\nThe 3,100-square-foot residence, a 28-foot-wide carriage house, has four bedrooms and was put on the market for $6 million in April. Corcoran’s\nKyle Talbott\nand\nKaren Talbott\nhad the listing.\nIf you like this digest, you can get it even earlier — every evening — by subscribing to TRD Data,\nhere\n.",
        "related_links": [
            "https://therealdeal.com/new-york/2025/08/23/nycs-real-estate-rout-office-resi-and-retail-hit-hard/",
            "https://therealdeal.com/new-york/2025/08/21/troubled-times-square-retail-space-sells-for-29m/",
            "https://therealdeal.com/tag/yoel-goldman/",
            "https://therealdeal.com/new-york/2025/01/03/yoel-goldman-puts-brooklyn-site-into-bankruptcy/",
            "https://therealdeal.com/new-york/2018/09/17/a-new-condo-development-may-be-coming-to-gramercy/",
            "https://therealdeal.com/new-york/2025/07/08/williamsburg-townhouse-asking-10m-seeks-neighborhood-record/",
            "https://therealdeal.com/data/latest/"
        ],
        "market": "New York"
    },
    {
        "title": "The Daily Dirt: Real estate donations by the numbers",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/real-estate-donations-in-nyc-mayoral-race/",
        "date": null,
        "subhead": "A rundown of the latest contributions in the mayoral race",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 26, 2025, 11:30 AM UTC",
        "pub_date_dt": "2025-08-26T11:30:00",
        "content": "A month’s worth of political donations isn’t the definitive record of who the real estate industry is supporting in the mayoral race.\nIt is, however, a pulse check. Leading up to the primary, the big industry players were overwhelmingly donating to former Gov. Andrew Cuomo. That changed after he lost, and then Mayor Eric Adams saw a sudden surge in industry donations. He brought in more than $489,000 from real estate donors after the primary, up through July 11.\nNow we have the latest donations, received between July 12 through August 18:\nZohran Mamdani\nReal estate donations: $19,720\nTotal contributions reported this period: $1 million\nEric Adams\nReal estate donations: $60,545\nTotal contributions reported this period: $425,181\nAndrew Cuomo\nReal estate donations: $53,720\nTotal contributions reported this period: $472,537 (plus a $68,225 transfer from a state fund)\nCurtis Sliwa\nReal estate donations: $9,939\nTotal contributions reported this period: $406,392\nJim Walden\n\nReal estate donations: $250\nTotal contributions reported this period: $8,222\nThe bottom line? The industry is still by and large supporting Adams and Cuomo. Donations to the mayor have slowed since the last filing period, but that seemed to be driven by an immediate (panicked) reaction to Cuomo’s primary loss.\nThe next filing deadline is Oct. 3, at which point we should have a better sense of whether the industry is deciding to pull back further on its spending ahead of the general election. Of course, if someone drops out, everything could change.\nWhat we’re thinking about:\nWill anyone drop out of the mayoral race before the general election? Have you heard anything about the land use ballot questions lately? Send a note to\nkathryn@therealdeal.com\n.\nA thing we’ve learned:\nThe term synanthrope (undomesticated creatures that live in close proximity to humans, such as rats, pigeons or squirrels) comes from the Greek “syn,” meaning “together with” and anthropos, which is “man,” according to the book “The 99% Invisible City: A Field Guide to The Hidden World of Everyday Design.”\nElsewhere in New York…\n— Mayor Eric Adams’ former chief advisor, Ingrid Lewis-Martin, was indicted last week on charges that she accepted kickbacks, including a brief cameo on the TV show “Godfather of Harlem”, in exchange for interfering with a controversial traffic redesign. But she isn’t the only member of the mayor’s inner circle to get a gig with the show.\nGothamist\nreported that Adams’ son, Jordan Coleman, acted as personal assistant to actor Forest Whitaker during the show’s second season, in what was described by two production employees as a “political hire.”\n— Gothamist\nprofiled\nDrew Warshaw, who is emerging as a challenger to state Comptroller Tom DiNapoli. Warshaw’s platform focused on the affordability crisis. As part of his campaign, he wants to invest $10 billion of the state pension fund into affordable housing projects.\n— Zohran Mamdani’s campaign held a scavenger hunt over the weekend,\nNewsweek\nreported. The activity dovetailed with the mayoral candidate’s campaign promise of fast, free buses, as participants used public transit to cross the city to various stops, several of them transit-themed. —\nQuinn Waller\nClosing Time\nResidential:\nThe top residential deal recorded Monday was for a condominium unit at 63 West 17th Street for\n$7.8 million\n. The unit at The Lyla Condominium is 4,100 square feet and listed by\nCompass’\nThe Davis Team.\nCommercial:\nThe top commercial deal recorded was\n$5.4 million\nfor 856 Greene Avenue. The Bedford-Stuyvesant rental building is three stories, has six units and is 5,800 square feet.\nNew to the Market:\nThe highest price for a residential property hitting the market was $7 million for a penthouse unit at 545 West 110th Street. The Morningside Heights condo is 3,100 square feet.\nCompass’\nDeirdre De Risi and Marissa Galletti have the listing.\nBreaking Ground:\nThe largest new building project filed was for a proposed 222,596-square-foot, six-story school building at 153-10 Hillside Avenue in Queens. Carrie Moore of Skidmore, Owings and Merrill is the applicant of record.\n— Joseph Jungermann",
        "related_links": [
            "mailto:kathryn@therealdeal.com",
            "https://gothamist.com/news/the-godfather-gig-mayor-adams-son-worked-on-tv-show-cited-in-bribery-case-against-ex-adviser",
            "https://gothamist.com/news/battle-of-the-bean-counters-challenger-emerges-for-ny-comptroller",
            "https://www.newsweek.com/zohran-mamdani-held-zcavenger-hunt-across-nyc-what-we-saw-2118571",
            "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025082200118001",
            "https://www.compass.com/listing/63-west-17th-street-unit-7a-manhattan-ny-10011/1631311576342152481/",
            "https://a836-acris.nyc.gov/DS/DocumentSearch/DocumentDetail?doc_id=2025081400706001",
            "https://www.compass.com/listing/545-west-110th-street-unit-ph11a-manhattan-ny-10025/1915349536760792017/"
        ],
        "market": "New York"
    },
    {
        "title": "Billionaire Marc Andreessen fetches $27M for Atherton estate",
        "url": "https://www.therealdeal.com/san-francisco/2025/08/25/marc-andreessen-sells-atherton-mansion-for-27-million/",
        "date": null,
        "subhead": "VC giant sold home after dropping $250M on Malibu properties",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 10:16 PM UTC",
        "pub_date_dt": "2025-08-25T22:16:00",
        "content": "Marc Andreessen is getting out of Dodge — or in this case, Atherton.\nThe billionaire tech investor sold his 12,000-square-foot estate in the wealthy town for nearly $27.2 million, the San Francisco Standard\nreported\n. That’s $2,266 per square foot. The venture capitalist\nlisted the property\nat 164 Elena Avenue for more than $33 million last year. The buyer’s identity hasn’t been disclosed.\nAndreessen paid $16.6 million for the home in 2007. The cofounder of the Andreessen Horowitz venture capital firm and early web browsers Mosaic and Netscape moved in the year after marrying Laura Arrillaga-Andreessen, daughter of billionaire developer John Arrillaga who helped build up Silicon Valley into the tech hub it is today.\nThe main house boasts two kitchens, seven fireplaces and media entertainment options via “visible and concealed screens,” according to the listing.\n\nBesides the main home, the property also has a one-bedroom guest house, a detached studio and a four-car garage partially converted into an office space. The home has a reflecting pool, fountains and a pergola; however, there’s no swimming pool or sports court.\nAndreessen dropped more than $250 million on three properties in Malibu in 2021 and 2022. He, along with basketball power couple Steph and Ayesha Curry, objected to Atherton city officials adding density to the town at that time.\nAtherton has become a go-to escape for Silicon Valley’s tech titans over the past decade. Former Google CEO Eric Schmidt and former Facebook COO Sheryl Sandberg have planted flags in the town over the years. Schmidt\noffloaded\nhis Atherton property last year and\nspent $24 million\non a three-bedroom apartment in San Francisco’s swanky Pacific Heights neighborhood.\nAndreessen’s Atherton home sale price represents about half of the year’s priciest sale in the Peninsula town. That award goes to tech Seagate CEO Stephen Luczo, who\nsold a property\nin April for $51.5 million.\n—\nChris Malone Méndez",
        "related_links": [
            "https://sfstandard.com/2025/08/20/marc-andreessen-atherton-home-sale/",
            "https://therealdeal.com/san-francisco/2024/03/18/billionaire-marc-andreessen-lists-atherton-estate-for-33m/",
            "https://therealdeal.com/san-francisco/2024/05/14/former-google-ceo-eric-schmidt-finds-buyer-for-atherton-home/",
            "https://therealdeal.com/san-francisco/2025/06/16/ex-google-ceo-drops-24-million-on-luxe-apartment/",
            "https://therealdeal.com/san-francisco/2025/04/29/tech-exec-stephen-luczo-sells-atherton-mansion-for-51-5m/",
            "https://therealdeal.com/author/chris-malone-mendez/"
        ],
        "market": "San Francisco"
    },
    {
        "title": "15-bedroom compound asking $5M tops Austin luxury sales",
        "url": "https://www.therealdeal.com/texas/austin/2025/08/26/this-15-bedroom-short-term-rental-topped-austins-home-sales/",
        "date": null,
        "subhead": "Billed as a golden goose for STRs or potential tech HQ, the estate in Bouldin Creek stretched the limits of the single-family classification",
        "authors": "By Isaiah Mitchell",
        "pub_date": "Aug 26, 2025, 12:00 PM UTC",
        "pub_date_dt": "2025-08-26T12:00:00",
        "content": "The most expensive residential property that sold in Austin last week is a suburban compound that sleeps 32 people, according to the Eklund Gomes Team at Douglas Elliman Real Estate.\nThe estate at 1304 Bouldin Avenue packs 15 bedrooms, 13 bathrooms, eight parking spots and a heated pool into a quarter of an acre. The sale price of the 6,400-square-foot property isn’t available, but it was asking $5 million when it sold after 101 days on the market, about $777 per square foot and $1 million higher than its last tax appraisal.\nThe listing agent, Eklund Gomes’ Jeff Burke, didn’t mince words in the listing summary: This single-family home is a business. The Bouldin Compound, as it’s known on Vrbo, is projected to generate $700,000 in revenue this year as a short-term rental. (It’s booked already for Labor Day weekend.) Catering to corporate retreats, the property managers have planned a conference area among other renovations. They’re also “actively working to build partnerships with major events like SXSW, ACL, F1 and the BLAST.tv Major, one of the world’s largest e-sports tournaments,” according to the listing.\n\nThe Bouldin Creek neighborhood is just across the river from downtown Austin and the Rainey Street Historic District, a nightlife hotspot.\nThe property has changed hands three times since it was built in 2018, and every owner after the original — a couple named Samuel and Lucia Ruiz — has been a business. The seller, an LLC registered to Adam Coleman, acquired the property last summer. Travis County hasn’t published records relating to the sale yet.\nThe Bouldin Compound shouldered a West Austin new build to second place in the city’s most-expensive residential sales last month. A five-bedroom mansion on 0.62 acres at 1604 Barclay Drive was asking $3.9 million when it sold last week.\n",
        "related_links": [
            "https://therealdeal.com/texas/2025/07/12/will-nvidias-massive-austin-office-lease-lead-to-revival/",
            "https://therealdeal.com/texas/2025/06/09/lakefront-estate-in-horseshoe-bay-near-austin-asks-10m/",
            "https://therealdeal.com/texas/austin/2025/04/24/15m-mansion-hits-austin-market/"
        ],
        "market": "Texas"
    },
    {
        "title": "Leander Springs lagoon project stagnates with city council denial",
        "url": "https://www.therealdeal.com/texas/austin/2025/08/25/iland-developments-leander-lagoon-project-denied-changes/",
        "date": null,
        "subhead": "iLand Development was denied changes to a city agreement",
        "authors": "By TRD Staff",
        "pub_date": "Aug 25, 2025, 11:00 PM UTC",
        "pub_date_dt": "2025-08-25T23:00:00",
        "content": "The developers of a $1 billion project in Leander were dealt another setback by the Austin suburb.\nAustin-based iLand Development Group’s updated plans for the 78-acre Leander Springs project was denied by the Leander City Council last week, Austin Business Journal\nreported\n. The unanimous vote denied amendments to its public utility district agreement with the city, further delaying any dirt moving on the ambitious mixed-use project centered around a 4-acre artificial lagoon, which was first announced five years ago.\nThe developer requested amendments to reduce the required number of apartments from 1,600 to 1,200, as well as some changes to the timeline. It asked for removal of the date required for certificate of completion on the lagoon, and to remove the time requirement for hotel construction and delivery. The PUD requires the hotel to be complete by the end of 2028.\nThe amendment also would’ve removed the requirement that the Lagoon be open to the public, with admission offered at a discount to Leander residents.\nKey sticking points in moving the development forward have been water usage, stakeholder investment, a terminated\n$22 million\ncity incentive package — lost by tapping the federal EB-5 program, which trades permanent resident status to foreign investors and their families in exchange for investment in commercial enterprises. The Texas Commission on Environmental Quality’s website lists a permit application for an entity tied to the project to discharge up an average of 1.4 million gallons of treated effluent and stormwater per day. Leander Mayor Christine DeLisle has long been skeptical of the project due to concerns over water usage.\n\nAnother request in the PUD amendment was to designate the lagoon as a “non-essential use” in terms of water so that it would have had to comply with conservation.\nAfter  the Aug. 21 meeting, iLand said in a statement that the company is eager to move forward with the project, and that the water management plan presented to the City Council and residents is robust. iLand dropped Miami-based Crystal Lagoons as the lagoon developer, and Austin-based VVater has replaced it.\nThe setbacks don’t stop with just water-use concerns for the project, at FM 2243 and the 183A frontage, intended to transform Leander into a\nCentral Texas\ndestination. Since announcing the project in 2020, iLand has faced setbacks that include $3 million in liens to contractors.\n—\nEric Weilbacher\n",
        "related_links": [
            "https://www.bizjournals.com/austin/news/2025/08/22/leander-springs-lagoon-iland-denied-council.html",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/austin/2025/06/30/lagoon-surf-park-developments-abound-in-central-texas/",
            "https://therealdeal.com/texas/2024/08/16/lagoon-development-loses-22m-incentives-faces-3m-in-liens/",
            "https://therealdeal.com/texas/2025/07/06/lagoon-apartment-development-proposals-abound-in-central-texas/"
        ],
        "market": "Texas"
    },
    {
        "title": "$25M Westlake office redo lures Texas’ largest Century 21 office",
        "url": "https://www.therealdeal.com/texas/dallas/2025/08/25/century-21-mike-bowman-signs-lease-at-westlake-office/",
        "date": null,
        "subhead": "Three recent leases brought 1M-sf property owned by Glenstar, Singerman Real Estate to 80% leased",
        "authors": "By Jess Hardin",
        "pub_date": "Aug 25, 2025, 10:11 PM UTC",
        "pub_date_dt": "2025-08-25T22:11:00",
        "content": "The $25 million renovation of a Westlake office campus has lured tenants, including Texas’s largest Century 21 brokerage.\nCentury 21 Mike Bowman signed one of three new leases at Terraces at Solana, an eight-building, 1.1 million-square-foot office complex at 1500 Solana Boulevard. The leases bring the property’s occupancy to 80 percent, according to a release from property owners Glenstar and Singerman Real Estate, which are based in Chicago.\nThe resi brokerage, which had a 17,000-square-foot office in Grapevine, will occupy 18,000 square feet on the first floor of the 278,000-square-foot Building 8 starting in September.\nIn addition, workforce development company Pluralsight moved its headquarters from Draper, Utah, to a 26,000-square-foot space in Building 6. Defense contractor M1 Support Services is shifting its headquarters from Denton to Building 5 of Terraces, where it inked a deal for 26,000 square feet of the 124,000-square-foot building.\nThe leasing momentum at the property follows a $25 million renovation completed in 2021. The campus now has 50,000 square feet of amenity space, including a restaurant, conference center, gym and covered parking.\n\nThe amenities sealed the deal for Century 21 Mike Bowman, said president Dave Bowman. Specifically, the brokerage will be able to host national events in the conference center.\nThese wins for the property speak to the strength of the office market in Dallas-Fort Worth suburbs. Companies are eager to locate closer to where employees live, in places like Westlake, which is an upscale suburb about 30 miles northwest of Dallas.\nHalfway through the year, JLL reported positive net absorption for the North Texas office market. It was highest in the second quarter in suburbs like Plano, McKinney and Irving’s Las Colinas area.\nVacancy is stuck at 27.7 percent across Dallas-Fort Worth, according to JLL. The high rate is attributable to empty space in the region’s office properties built in the ’80s and ’90s.\nThe vacancy rate has declined for Class A properties, CBRE reported, highlighting the continued prevalence of the flight-to-quality trend that has office users seeking properties with high-end amenities to lure their remote workers back to the office.\n",
        "related_links": [
            "https://therealdeal.com/texas/2025/07/09/dallas-office-market-resilient-in-face-of-economic-uncertainty/",
            "https://therealdeal.com/texas/2025/04/14/suburban-lease-up-shows-strength-of-dallas-office-market/",
            "https://therealdeal.com/texas/dallas/2025/03/06/sally-beauty-relocates-hq-to-planos-legacy-west/"
        ],
        "market": "Texas"
    },
    {
        "title": "Boston developer with $6B pipeline skips NYC",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/why-developer-michael-fallon-loves-nyc-but-builds-in-southeast/",
        "date": null,
        "subhead": "Fallon Company CEO explains why he prefers Charlotte, Raleigh and Nashville",
        "authors": "By Erik Engquist",
        "pub_date": "Aug 26, 2025, 2:00 PM UTC",
        "pub_date_dt": "2025-08-26T14:00:00",
        "content": "Two decades ago, the\nFallon Company\ndeveloped a 20-unit condominium on Sackett Street in Brooklyn. Since then the Boston-based builder has finished more than $5 billion worth of projects, but not a single one in New York City.\nIt’s not because CEO Michael Fallon, whose father\nJoseph Fallon\nfounded the company in 1993, has anything against New York City.\n“New York is such a fabulous place,” he said, describing it as the social, cultural and business mecca of the United States. “It’s such a deep pool of opportunity.”\nYet Fallon sees greener pastures for his firm in the Southeast, in particular Nashville and Charlotte, as well as his home market of Boston.\n“Why are we focused on the markets we’re focused on? Scale and access to capital,” the 36-year-old said in a Zoom interview with\nThe Real Deal\n.\nFallon likes building in Nashville and Charlotte because of their good infrastructure, financial health, amenable stakeholders, business-friendly political climates and nice weather. Also, both have a National Football League franchise.\nMost of Fallon’s $6 billion pipeline is in the Southeast. There, he doesn’t have to worry that locals will elect political leaders eager to “decommoditize” housing — a concept that popped up as Fallon researched\nZohran Mamdani\nin preparation for his\nTRD\ninterview.\nIn one campaign video, Mamdani says, “If we want to end the housing crisis, the solution has to be moving toward the\nfull de-commodification of housing\n.”\nTo the contrary, the only feasible strategy to end — or prevent — a housing crisis is to allow for-profit development at scale.\nFallon does that by building affordable units the traditional way, typically with Low Income Housing Tax Credits, partnerships with big insurers such as Mass Mutual and Prudential, and debt from major lenders including\nFortress Investment Group\n; Santander,\nBank OZK\n, Wells Fargo and Key Bank.\nThe first phase of his next\nNashville project\nwill be 100 percent affordable and have north of 300 units. In the second phase, 10 percent of the units will be income-restricted. The\n$3 billion project\n, of which Fallon is the master developer, is expected to break ground next year.\n\nFallon is also working with\nCharlotte’s housing authority\non a mixed-use project with 975 residential units, 405,000 square feet of office, 36,000 square feet of retail and amenities, and a 180-key hotel. Phase one includes 329 units, 20 percent of which will be affordable.\nTo be sure, the Fallon Company’s last New York project was long before the socialist Mamdani came along. It has steered clear because like most developers, it prefers to operate in markets where it knows the players and the regulatory, cultural and political environment.\n“It’s about de-risking that whole spectrum of development as much as you can,” the CEO said. “In New York, it’s very complex and challenging to build.”\nHis company has been in Charlotte since 2016, Raleigh since 2018 and Nashville since 2019.\n“Nashville in particular is very focused on ‘how do we make this a compelling investment opportunity for a company relocation?’” Fallon said. “You need the city to remove friction points, and that is what the city and state are really good at.”\nTennessee’s capital city is pursuing smart growth and striving to be competitive with other Southeast markets in attracting development, the CEO said.\nNew York has become more\nhospitable\nto new housing since the city’s vacancy rate was found to have sunk to a\nrecord low of 1.4 percent\nin 2023, but it still requires\nhigh wages\nand\nsubstantial affordability\nin large multifamily projects. The hotel workers union has effectively\nblocked nonunion hotels\n. Rezoning remains a\ncrapshoot\n, and\nhistoric districts\nand\nlocal opposition\nare major obstacles.\nDoing a big project in New York would mean navigating these pitfalls and competing with firms familiar with the ins and outs of the city; Fallon cited the Related Companies’\nHudson Yards\nand Tishman Speyer’s\nthe Spiral\nas among his favorite developments. He would also have to find investors to bet on that proposition.\n“We need to focus on markets where we have a competitive edge in product, in relationships, in policy,” Fallon said. “That works for partners with very long-term capital.”\n",
        "related_links": [
            "https://therealdeal.com/company/the-fallon-company/",
            "https://therealdeal.com/miami/2024/05/02/resi-roundup-real-estate-beverage-and-concrete-moguls-buy-and-sell-south-florida-homes/",
            "https://therealdeal.com/people/zohran-mamdani/",
            "https://www.foxnews.com/politics/resurfaced-video-shows-nyc-mayoral-hopeful-saying-he-wants-replace-private-homes-communal-living",
            "https://therealdeal.com/new-york/2025/03/31/steve-stuart-to-leave-fortress/",
            "https://www.bloomberg.com/news/features/2018-07-10/how-a-tiny-bank-from-the-ozarks-got-big-and-outpaced-wall-street",
            "https://therealdeal.com/national/nashville/2025/01/31/nashvilles-east-bank-developer-fallon-co-hires-mixed-use-pro/",
            "https://therealdeal.com/national/nashville/2025/06/26/nashvilles-east-bank-megadevelopment-draws-lawmaker-scrutiny/",
            "https://therealdeal.com/national/charlotte/2024/03/15/fallon-co-to-start-affordable-development-in-charlotte/",
            "https://therealdeal.com/new-york/2024/01/05/pro-housing-forces-turn-tide-in-brooklyn-the-daily-dirt/",
            "https://www.nyc.gov/site/hpd/news/007-24/new-york-city-s-vacancy-rate-reaches-historic-low-1-4-percent-demanding-urgent-action-new#/0",
            "https://therealdeal.com/new-york/2025/03/21/the-era-of-99-unit-buildings-has-arrived/",
            "https://therealdeal.com/new-york/2024/04/24/developers-weigh-in-on-new-yorks-485x-tax-break/",
            "https://therealdeal.com/new-york/2022/12/09/how-special-are-these-permits-no-one-got-any/",
            "https://therealdeal.com/new-york/2024/02/07/council-member-crystal-hudson-crushes-crown-heights-project/",
            "https://therealdeal.com/new-york/2024/05/21/court-hands-win-to-howard-hughes-250-water-street/",
            "https://therealdeal.com/new-york/2023/03/15/brooklyn-housing-project-killed-by-city-council/",
            "https://therealdeal.com/new-york/2025/07/01/how-related-companies-got-hudson-yards-approved-and-saved-2b/",
            "https://therealdeal.com/new-york/2025/01/07/tishman-speyer-seeks-to-refi-the-spiral-with-2-7b-bond-sale/",
            "https://therealdeal.com/national/nashville/2025/06/26/nashvilles-east-bank-megadevelopment-draws-lawmaker-scrutiny/",
            "https://therealdeal.com/national/nashville/2025/01/31/nashvilles-east-bank-developer-fallon-co-hires-mixed-use-pro/",
            "https://therealdeal.com/national/charlotte/2024/03/15/fallon-co-to-start-affordable-development-in-charlotte/"
        ],
        "market": "New York"
    },
    {
        "title": "Mansions at Acqualina closing tops Miami-Dade weekly condo sales",
        "url": "https://www.therealdeal.com/miami/2025/08/26/miami-dade-county-weekly-condo-sales-drop-to-49m/",
        "date": null,
        "subhead": "Seventy-six sales totaled $49M in dollar volume last week",
        "authors": "By Kate HinscheResearch byAdam Farence",
        "pub_date": "Aug 26, 2025, 1:45 PM UTC",
        "pub_date_dt": "2025-08-26T13:45:00",
        "content": "Miami-Dade County’s condo dollar volume dropped last week, despite a boost in sales.\nBrokers closed 76 condo sales totaling $49 million from Aug. 18 to Aug. 24. The previous week, brokers closed 55 condo sales totaling\n$94.2 million\n.\nLast week’s units sold for an average of $644,907, lower than the $1,713,245 average price from the previous week. The average price per square foot fell to $493 from $820, according to data from Redfin.\nFor the top 10 sales, prices ranged from $1.3 million to $6.9 million.\nUnit 902 at Mansions at Acqualina, at 17749 Collins Avenue in Sunny Isles Beach, took the top spot with a $6.9 million closing. The sale closed at $1,502 per square foot after nine days on market.\nMaria Barbosa with Elite International Realty had the listing, and Marvin Anhalt with Anhalt Realty brought the buyer.\nUnit 2104 at Asia Brickell Key, at 900 Brickell Key Boulevard in Miami, closed for the second highest amount, $2.4 million, or $912 per square foot after 110 days on market.\nChristopher Jude with PGutman LLC had the listing, and Daniel Hernandez with Compass brought the buyer.\nHere’s a breakdown of the top 10 sales from Aug. 18 to Aug. 24:\n\nMost Expensive\nMansions at Acqualina, 17749 Collins Avenue, unit 902, in Sunny Isles Beach | Price: $6,925,000 | $1,502 psf | Listing agent: Maria Barbosa with Elite International Realty | Buyer’s agent: Marvin Anhalt with Anhalt Realty\nLeast Expensive\nAtlantic One at the Point, 21200 Point Place, unit 1802, in Aventura | Price: $1,300,000 | $476 psf | Listing agent: Paola Wagener with Charles Rutenberg Realty\nHighest Price Per Square Foot\nMansions at Acqualina, 17749 Collins Avenue, unit 902, in Sunny Isles Beach | Price: $6,925,000 | $1,502 psf | Listing agent: Maria Barbosa with Elite International Realty | Buyer’s agent: Marvin Anhalt with Anhalt Realty\nLowest Price Per Square Foot\nAtlantic One at the Point, 21200 Point Place, unit 1802, in Aventura | Price: $1,300,000 | $476 psf | Listing agent: Paola Wagener with Charles Rutenberg Realty",
        "related_links": [
            "https://therealdeal.com/miami/2025/08/19/miami-dade-county-weekly-condo-sales-reach-94m/"
        ],
        "market": "South Florida"
    },
    {
        "title": "August slowdown loud and clear as LA signed contract volume falls",
        "url": "https://www.therealdeal.com/la/2025/08/26/las-signed-luxury-contracts-asking-volume-slips-44/",
        "date": null,
        "subhead": "Asking volume for the week fell to $86.7M across 14 contracts for luxury homes",
        "authors": "By Kari Hamanaka",
        "pub_date": "Aug 26, 2025, 2:00 PM UTC",
        "pub_date_dt": "2025-08-26T14:00:00",
        "content": "Maybe it was the heat wave.\nSigned contracts last week in L.A. County fell 44 percent from a year ago to $86.7 million in asking volume, in what some in the industry are calling August’s typical\nsummer cool down\n. Fourteen properties went into contract last week, which is four fewer than the comparable period in 2024, according to the\nEklund Weekly Luxury Report Los Angeles\n.\nThe report is compiled by Marcy Roth of Douglas Elliman’s Eklund Gomes team and counts single-family homes and condominiums listed at $4 million or more in the Multiple Listing Service.\nRoth called the week’s performance a “simple blip in the market,” that is historically seen with the back-to-school period.\n“August is traditionally our slowest month of the year and has, previous to this week, been performing above expectations, so we see no cause for alarm in regards to a decline in the market,” Roth said.\nTopping last week’s signed contracts was 130 South Cliffwood Avenue, which has a listing price just shy of $14 million.\nBerkshire Hathaway HomeServices California Properties’ David Offer holds the listing on behalf of a family trust, according to property records.\n\nThe\nBrentwood\nresidence has seven bedrooms and eight bathrooms, coming in at nearly 6,300 square feet. The lot is more than 20,000 square feet sitting behind gates with hedges for further privacy. Built in 1925, the New England traditional-style home recently received some touch-ups that included oak floors and interior paint.\nAside from the main residence, there’s a two-story guest house with a bedroom, kitchenette and two bathrooms. Outdoors has a pool and sprawling lawns.\nThe next priciest listing to go into contract last week was 1760 Carla Ridge in Beverly Hills, which is listed for $13.5 million.\nThe Beverly Hills Estates’ Robby Sutton and Rayni Williams are the listing agents. Property records show a family trust is selling the home.\nThe Trousdale Estates residence has five bedrooms and five bathrooms across nearly 5,000 square feet. It offers big views of Century City, Downtown Los Angeles, the ocean and the Santa Monica Mountains.\nThe Mid-Century modern home was designed by Rex Lotery, the architect behind Elvis Presley’s Trousdale Estates home.\n",
        "related_links": [
            "https://therealdeal.com/la/2025/08/06/signed-contracts-in-las-high-end-fall/",
            "https://therealdeal.com/la/2025/08/19/manse-at-the-riviera-country-clubs-7th-hole-asks-110m/",
            "https://therealdeal.com/la/2025/08/12/spec-developers-brentwood-project-asking-24m-tops-la-signed-contracts/",
            "https://therealdeal.com/la/2025/08/19/manse-at-the-riviera-country-clubs-7th-hole-asks-110m/",
            "https://therealdeal.com/la/2025/08/12/spec-developers-brentwood-project-asking-24m-tops-la-signed-contracts/",
            "https://therealdeal.com/la/2025/08/06/signed-contracts-in-las-high-end-fall/"
        ],
        "market": "Los Angeles"
    },
    {
        "title": "Alloy secures $500M for “world’s tallest” passive house building",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/alloy-snags-500m-for-one-third-avenue/",
        "date": null,
        "subhead": "Kayne Anderson, Vistria are providing $495M for energy-efficient Brooklyn project",
        "authors": "By Kathryn Brenzel",
        "pub_date": "Aug 26, 2025, 3:00 PM UTC",
        "pub_date_dt": "2025-08-26T15:00:00",
        "content": "Developers of what is poised to be the world’s tallest passive house building in the world secured $500 million to get the project off the ground.\nAlloy Development on Monday closed on $375 million in loans from Kayne Anderson Real Estate for One Third Avenue, a 583-unit tower planned for Downtown Brooklyn. Additionally, Vistria Group, in its first ground-up development, is infusing $120 million in equity and taking a majority stake in the project as a limited partner. Alloy, as general partner, will continue to lead development and is kicking in $40 million.\nAccording to Alloy, the 730-foot tower is slated to be the world’s tallest built to passive house standards, a design method aimed at cutting energy costs through extreme insulation. The project is the second phase of “Alloy Block,” which includes the city’s first all-electric skyscraper at 505 State Street and two public schools (also passive house) at 489 State Street.\n\nOne Third Avenue will include 143 affordable housing units, with monthly rents starting at $1,023 per month. These apartments will be reserved for tenants earning, on average, 60 percent of the area median income.\nResidential space will span the 11th through 60th floors, and the tower’s podium will include 60,000 square feet of office space. Two buildings constructed in the 1800s on State Street and Schermerhorn Street will also be incorporated into the development, and house 30,000 square feet of retail space.\nDemolition work on the site began earlier this year, and the development team expects to begin construction in the fall.\nWhen finished, Alloy Block is expected to include more than 1,000 homes, with 200 set aside as permanently affordable. The electric tower at 505 State Street was completed in July 2024. The developers\nsecured\n$290 million to replace a $210 million construction loan in December.\n",
        "related_links": [
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/20/alloy-development-nabs-loan-for-all-electric-tower/",
            "https://therealdeal.com/new-york/2024/12/05/city-council-approves-city-of-yes-for-housing-opportunity/"
        ],
        "market": "New York"
    },
    {
        "title": "Owner proposes rezoning LaGuardia Center in Astoria",
        "url": "https://www.therealdeal.com/new-york/2025/08/26/owner-proposes-rezoning-laguardia-center-in-astoria/",
        "date": null,
        "subhead": "Rosenwach Group eyes nearly 500 apartments above shopping center",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 2:25 PM UTC",
        "pub_date_dt": "2025-08-26T14:25:00",
        "content": "The family-run Rosenwach Group is thinking of adding opportunities for hundreds of families to live at the site of a shopping center in Astoria.\nRosenwach filed an application with the Department of City Planning to rezone the LaGuardia Center at 43-02 Ditmars Boulevard in the Queens neighborhood, Crain’s\nreported\n. The firm wants to turn the low-rise shopping center into a mixed-use complex with nearly 500 units.\nRosenwach proposed a 412,000-square-foot complex that would be between eight and ten stories tall. The property would include 492 residential units, 25 percent of which would be affordable for those earning a maximum of 60 percent of the area median income.\nThe proposal also includes a significant retail component — 62,000 square feet in all on the ground floor, including a 2,300-square-foot cafe and gallery — which would allow the tenants of LaGuardia Center to remain in place when the redevelopment is completed. Tenants include a supermarket, a laundromat, a bank and restaurants.\nAdditional aspects of the proposal include a landscaped public terrace and parking for 175 vehicles.\n\n“We always thought that the center — now and hopefully in the future — was the heartbeat of the neighborhood,” director of operations Henry Rosenwach told the outlet. “We really just want to take it one step further for the community.”\nDevelopment costs and timeline were not disclosed. Because of previous work, however, Rosenwach expects to qualify for the lapsed 421a tax break, for which construction needs to be completed by the middle of June 2031 after the deadline was extended last year.\nRosenwach acquired the site in 1989 for an undisclosed price and operates out of the address. In addition to being a landlord, the firm also helped develop rooftop water towers across the city.\nElsewhere on Ditmars, Pasadena-based hospitality investor ASAP Holdings\nfiled a rezoning application\ntowards the end of 2023 to replace the 410 parking spaces at the New York LaGuardia Airport Marriott with a mixed-use building containing 437 apartments and a separate structure containing 98 affordable residences for seniors.\n—\nHolden Walter-Warner\n",
        "related_links": [
            "https://www.crainsnewyork.com/real-estate/rosenwach-group-plans-laguardia-center-rezoning",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/author/holden-walter-warner/",
            "https://therealdeal.com/new-york/2023/12/01/hotel-parking-lot-near-laguardia-to-become-535-unit-building/",
            "https://therealdeal.com/new-york/2025/02/13/durst-organization-sells-halletts-point-stake-to-affinius-capital/",
            "https://therealdeal.com/new-york/2023/02/23/silverstein-scores-165m-to-build-astoria-apartment-building/"
        ],
        "market": "New York"
    },
    {
        "title": "$17M Palm Beach townhome tops signed luxury contracts",
        "url": "https://www.therealdeal.com/miami/2025/08/26/17m-palm-beach-townhome-tops-signed-luxury-contracts/",
        "date": null,
        "subhead": "Palm Beach County luxe buyers signed 11 contracts totaling $64.7M last week",
        "authors": "By Kate Hinsche",
        "pub_date": "Aug 26, 2025, 2:30 PM UTC",
        "pub_date_dt": "2025-08-26T14:30:00",
        "content": "A Palm Beach townhome that sold for $16.5 million in April topped signed luxury contracts in Palm Beach County last week.\nBuyers signed 11 contracts between Aug. 18 and Aug. 24 for luxury properties in Palm Beach County, according to a market report from\nDouglas Elliman’\ns\nEklund-Gomes\nteam. The homes that went pending last week total $64.7 million in asking dollar volume and averaged 150 days on the market. That’s down from\n$117.8 million\nin asking dollar volume for 18 homes the previous week.\nThe team’s report tracks signed contracts for single-family homes and condos asking $3 million or more in the Beaches MLS. It identified 27 new listings, and a total of 994 active listings on the market.\nNine single-family homes and two condos found buyers last week. The condos that went pending are asking an average of $3.4 million, or $1,253 per square foot, and spent an average of 187 days on the market.\nThe single-family homes total $57.9 million in asking dollar volume and averaged 114 days on the market. The average asking price works out to $6.4 million.\n\nThe priciest home to find a buyer is the 4,000-square-foot townhome at 220 Brazilian Avenue in Palm Beach, asking $17 million. Records show the seller is Crystal Lahners, who bought it for\n$16.5 million\nin April. She is the widow of Dr. William Lahners, a prominent ophthalmologist and a partner with Center for Sight (CFS), who died in 2021. She listed their Siesta Key home for $31.5 million in February, but has since delisted it.\nThe Brazilian Avenue townhome was built in 2022 and has four bedrooms, five bathrooms and a pool. It hit the market asking $17 million in May. Chris Leavitt with Douglas Elliman and Ashley Copeland with Brown Harris Stevens have the listing.\nThe second-most expensive home to find a buyer is the nearly 5,100-square-foot waterfront home at 961 Iris Drive in Delray Beach, asking $8 million. Records show the seller is John Acunto, who bought it for $7.5 million in February. It was built on half an acre in 1978 and has four bedrooms, four bathrooms, two half-bathrooms, a pool and a dock, records and the listing show.\nHe listed it for $8 million in March, Zillow shows. Tinka Ellington and Rene Mahfood with Compass have the listing.",
        "related_links": [
            "https://therealdeal.com/company/douglas-elliman/",
            "https://therealdeal.com/tag/eklund-gomes/",
            "https://therealdeal.com/miami/2025/08/19/palm-beach-county-luxe-contracts-surge-to-118m/",
            "https://therealdeal.com/miami/2025/05/06/ecn-capitals-steven-hudson-sells-palm-beach-home-for-17m/"
        ],
        "market": "South Florida"
    },
    {
        "title": "Catellus, Deca pitch retail, warehouses for Phillips 66 refineries",
        "url": "https://www.therealdeal.com/la/2025/08/26/phillips-66-sites-poised-for-retail-warehouse-redevelopment/",
        "date": null,
        "subhead": "Heavy industrial sites in Wilmington, Carson poised for transformation",
        "authors": "By TRD Staff",
        "pub_date": "Aug 26, 2025, 3:59 PM UTC",
        "pub_date_dt": "2025-08-26T15:59:00",
        "content": "Catellus Development and Deca are looking to turn a petroleum refinery near Long Beach into a modern industrial hub with restaurants and retail.\nThe developers have proposed replacing 406 acres of oil-refining operations and another 228-acre refinery site into millions of square feet of industrial space with grocers, restaurants, sports facilities and greenways available to nearby residents, CoStar\nreported\n. If approved, it would be among the largest conversions of previously environmentally hazardous land in California history.\nLast year,\noil giant Phillips 66\ntapped Catellus and Deca to help redevelop its Los Angeles refinery operations which include the 406-acre site at 1660 West Anaheim Street in Wilmington and a 228-acre site at 1520 East Sepulveda Boulevard in Carson. Catellus and Deca have filed plans with the city of Los Angeles for its Five Points Union Specific Plan, which would require zoning changes before any shovels can hit dirt.\nAt the Wilmington site, the Anaheim Street land will be split into two portions: A commercial and recreation strip along Anaheim Street with grocery stores, cafes, sports courts and greenways, and a logistics area with warehouses to the south.\n\nThe Wilmington development would stretch across three parcels including the 410-acre refinery site, a 10-acre vacant lot north of Anaheim Street and a 20-acre propane and butane storage yard. Plans have yet to be announced for the Carson site, though it could be redeveloped for industrial logistics use. It could also face separate legal and logistical hurdles due to its location in the city of Carson.\nIt wouldn’t be the first time Catellus has undertaken such a project.\nIn 2003, the Emeryville-based firm redeveloped the 200-acre former Pacific Refinery Company near San Francisco into a residential subdivision known as Victoria by the Bay. In order to do that, the company had to remove contaminants from the site, not unlike what it will have to do in Wilmington and Carson.\nMeanwhile, in Huntington Beach, Shopoff Realty is\nlooking to redevelop\nthe\nMagnolia Tank Farm\nwith housing.\n—\nChris Malone Méndez\n",
        "related_links": [
            "https://www.costar.com/article/164982279/redevelopment-plans-for-massive-los-angeles-oil-refinery-show-modern-real-estate-needs",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/author/chris-malone-mendez/",
            "https://therealdeal.com/la/2024/10/17/phillips-66-to-close-south-bay-refineries-on-650-acres/",
            "https://therealdeal.com/la/2025/02/13/shopoff-snags-61m-loan-for-homes-hotel-in-huntington-beach/",
            "https://therealdeal.com/la/2024/07/03/shopoff-to-build-250-homes-and-hotel-in-huntington-beach/"
        ],
        "market": "Los Angeles"
    }
]